[
    {
        "content": "This overview details the characteristics and attributes of hot-deformed Duplex Stainless Steel ( DSS ) 2205, emphasizing its phases, alloying elements, and deformation behaviour. Due to its exceptional mixofmechanical qualities and corrosion resistance, it has found extensive applications in water treatment and desalination, chemical industries, oil and gas storage tankers, construction, food production, and marine environments. Its properties during hot deformation are crucial in de /uniFB01 ning its applications. DSS 2205 features a balanced dual-phase microstructure, with ferrite ( α ) and austenite ( γ ) phases in roughly equal quantities, resulting in high mechanical characteristics and corrosion resistance. Depending on the alloy composition and processing conditions, hot deformation can result in the development of secondary phases. Temperature, strain rate, and initial microstructure impact DSS 2205 ' s hot deformation. Hot deformation initiates several forms of grain boundaries, which contribute to microstructural evolution and yielding properties. Therefore, the characteristics of hot-deformed DSS 2205 show a re /uniFB01 ned and dynamically recrystallized microstructure, resulting in improved properties. Understanding the interaction of alloying components, phases, and deformation conditions can help optimize the hot deformation process for DSS 2205. In conclusion, this study emphasizes optimizing the phases and deformation parameters to fully utilize DSS2205indemandingapplications.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Duplex stainless steels ( DSSs ) are Fe-Cr-Ni-Mo-N alloys with roughly equal ferrite and austenite phases. It is classi /uniFB01 ed as a dual-phase type of stainless steel [ 1, 2 ] . These steels contain less nickel than austenitic steels and have a low carbon content. AISI 2205 DSS type contains 0.02% carbon, 22% chromium, 5.5% nickel, 3% molybdenum,and0.14%nitrogen [ 3 ] . In stainless steels such as 2205, each alloying element plays a signi /uniFB01 cant role. Chromium ( Cr ) enhances corrosion resistance and improves its hardness [ 4 -6 ] . Through the creation of molybdate, the element molybdenum ( Mo ) protects duplex stainless steel from pitting and corrosion. However, excess Mo can also weaken the steel ' s toughness by causing intermetallic phases to form. Increases in nitrogen ( N ) impact the hot workability of DSS and improve corrosion resistance. Since nickel ( Ni ) stabilizes austenite, a drop in Ni concentration has an adverse effect on corrosion resistance and toughness [ 7 ] .\nFromthechemical analysis of DSS 2205, the elements are classi /uniFB01 ed as stabilizers for either phase. Ferriteforming elements, which are corrosion-resistant in nature, lead to the formation of intermetallic elements when they are beyond proportions, thereby causing embrittlement of the material. The ferrite stabilizers in DSS 2205 are chromium and molybdenum, both of which contribute to increased hardness. The sigma phase, in particular, contains higher concentrations of these ferrite-stabilizing elements. Therefore, precise chromium andmolybdenumcontentcontrol is essential to manage sigma phase formation. Additionally, the chi phase, which precedes sigma phase precipitation, forms at temperatures below 650 ° C. To effectively control both phases, it ' s necessary to regulate the chemical composition ( MoandCr ) andcarefully manage the cooling rate during annealing or normalizing [ 8, 9 ] .\nIntermetallic phases ( such as sigma, chi, R, and alpha prime ) , along with nitrides and carbides, will likely formif the cooling rate is not precisely controlled after solidi /uniFB01 cation. These intermetallic phases can signi /uniFB01 cantly impact the mechanical properties of DSS 2205 [ 10 ] . The details can be found in the ternary phase diagram presented in /uniFB01 gure 1.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "DSS2205applications include oil and gas [ 12 ] , chemical processing [ 13 ] , pulp and paper [ 14 ] , and desalination facilities [ 15, 16 ] . Due to its cost-effectiveness, duplex alloy 2205 is utilized in many maritime applications, including propellers, shafts, rudders, seals, pumps, fasteners, instruments, bearings, and valves. In marine conditions, DSS 2205 is prized for its weldability, machinability, and surfacing properties [ 17 ] . DSS 2205 is utilized in the chemical sector for phosphoric acid applications and organic acid processing and is the preferred material for subsea hydraulic control lines in the oil and gas sector [ 18, 19 ] . It is used in subsea oil and gas industry applications in hydraulic control lines for offshore platforms. DSS 2205 ' s adaptability encourages its use in a range of industrial settings. Alloy 2205 duplex stainless steel is well-suited for use in cargo tanks of maritime chemical tankers, particularly those storing wet phosphoric acid, sulfuric acid, hydrogen sul /uniFB01 de, and cargoes containing free halides, such as chlorides [ 9, 20 ] . Recently, it has gained applications in the civil and construction industries, and its use for bridge decking can increase durability and lower maintenance costs than typical [ 21 ] . Some researchers have adopted it for bio-medical applications as an alternative to SS 316 [ 22 ] . The 2205 duplex stainless steel with herringbone for plate heat exchangers was successfully developed [ 22 ] .\nThefollowing sections provide an overview of the characteristics of DSS 2205, with a detailed discussion of the factors in /uniFB02 uencing them. The alloy ' s phases, including secondary ones, will be identi /uniFB01 ed. The impact of alloying elements on the material ' s yield properties will be analyzed. Both the intrinsic and functional properties of DSS 2205 will be explored, followed by an in-depth examination of the alloy ' s deformation behaviour. Key factors affecting deformation, such as grain boundaries and their movement, will be highlighted, along with their effects on the material ' s phase composition, microstructure, mechanical properties, and corrosion resistance.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Usually, DSS 2205 has two primary phases ( ferriteδ andausteniteγ ) , as portrayed in /uniFB01 gure 2; however, engineering processes such as deformation, heat treatment or aging cause the material to precipitate or develop newphases, and in some cases, detrimental to the integrity of the material ' s properties. The prominent secondary phases observed in the treatment of DSS 2205 are the sigma and chi phases [ 24 ] .\nDuring the cooling of DSS 2205 or other processing, various intermetallic phases may form, including carbides, nitrides, and other secondary phases [ 10, 25 ] . These transformations can negatively affect the corrosion resistance and mechanical properties of DSS, particularly Duplex 2205. However, some intermetallic phases with high chromium content exhibit greater corrosion resistance [ 26, 27 ] . The sigma phase ( σ ) has a tetragonal structure containing 30 atoms per unit cell. Its formation decreases both corrosion resistance and mechanical properties in duplex stainless steels due to its speci /uniFB01 c chemical composition, typically Fe-20Cr-4Ni with 4% -7%\nMo,depending on the alloy composition [ 28 -30 ] . Sigma phase forms more readily in austenitic stainless steels than in duplex grades, though its volume can be minimized by adjusting alloy composition and increasing cooling rates [ 31 ] . The toughness properties can be reduced by Sigma precipitation. During hot deformation, the 2205 DSS tends to form a σ phase, precipitating along the δ / γ interfaces and exhibiting two morphologies blocky-like at early stages and coral-like at later stages. This could be attributed to the evolution of supersaturation and diffusion of Cr and Mo during isothermal aging ( see /uniFB01 gure 3 ) [ 32 ] .\nWhenDSSisheatedto600 -1000 ° C, detrimental phases such as intermetallic, carbides, and nitrides may precipitate, resulting in decreased ductility, toughness, and corrosion resistance. This is due to chromium and molybdenumdepletion in the matrix and subsequent buildup in secondary phases. A tiny ( ∼ 1% ) σ -phase precipitation considerably lowers toughness, and 10% can produce full embrittlement [ 33 ] .\nFigure 4 depicts the mechanism of σ -phase nucleation at austenite / ferrite interphase, which produces Cr andModiffusion from austenite into the σ -phase. Recent investigations found σ -phase nucleation at α / γ contacts and as intragranular precipitates inside ferrite, resulting in a more compact structure [ 34 ] .\nChi phase ( χ ) is present in small amounts in DSS and negatively affects corrosion resistance and mechanical properties [ 35 -37 ] . It contains high levels of Mo and low levels of Cr compared to the sigma phase and is more stable at lower temperatures, potentially transforming to the sigma phase with extended aging [ 38 ] .\nThechi ( χ ) phase signi /uniFB01 cantly impacts the microstructure and 2205 duplex stainless steel ( DSS ) characteristics, as seen in /uniFB01 gure 5. These intermetallic phases develop between 600 -1000 ° C, with the χ phase usually forming before the σ phase [ 40, 41 ] . Even in small concentrations ( < 0.5% ) , their presence considerably",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "reduces fracture toughness and corrosion resistance of 2205 DSS [ 42 ] . Processing methods alter these phases ' precipitation mechanism and volume, with cold-rolled samples producing more precipitate than hot-rolled samples. The presence of the chi phase changes the corrosion behaviour of 2205 DSS, impacting pitting start sites andgalvanic corrosion between phases [ 43, 44 ] . Precipitates occur at α / γ , α / α , and γ / γ interfaces when 2205 DSSisaged at 850 ° Cfor10 min to 200 h. Initially, M23C6 carbides develop, causing local Cr depletion and the creation of the lath-shaped γ 2 phase. As aging advances, the χ phase, rich in molybdenum, arises and dominates for up to 4 h. Between 2 -4 h, the χ phase gradually evolves into the σ phase, which becomes the major phase from4to10 h. Precipitates coarsen over time ( see /uniFB01 gure 6 ) , causing the microstructure to change [ 45 ] . Understanding the creation and consequences of the χ phase is critical for maximizing the performance of 2205 DSSindifferent applications.\nThecarbon ( C ) content in duplex stainless steels is controlled between 0.03 and 0.05 wt% to limit carbide formation, as high Cr and Mo content already reduce corrosion resistance. Small amounts of carbide may precipitate during aging, typically at ferrite / austenite boundaries, which lowers intergranular corrosion resistance [ 38, 46, 47 ] . The R phase precipitates at 550 ° C -650 ° C, reducing fracture toughness and increasing susceptibility to pitting corrosion in DSS [ 48 -50 ] . In another study [ 51 ] , the R phase ( Mo-rich intermetallic complexes ) stability is observed at around 700 ° Cineither isothermal aging or continuous cooling.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Chromium ( 22 -23% ) is the element with the highest content in DSS and forms ferrite ( stabilizer ) . Duplex stainless steel ' s corrosion resistance is attributed to its Cr concentration; if the content is lower than projected, the DSS ' s corrosion resistance will not be enough for corrosive environments like manufacturing facilities. A higher concentration of Cr in DSS caused the sigma to precipitate more, exposing the DSS to a heat history more akin to the heat-affect zone. Additionally, the steel ' s hardness will increase [ 52 ] . In other studies, DSS 2205 needs at least 10.5 wt% Cr to generate a stable passive function for corrosion resistance, which improves with increasing concentration [ 53 ] . However, additional elements like Ni, Mo, and Si are required for ef /uniFB01 cient corrosion prevention in strongly oxidising or reducing situations. Duplex stainless steels ( DSSs ) require at least 18 wt% Cr to preserve their two-phase structure. Cr strengthens solid solutions and improves oxidation resistance at high temperatures [ 54 ] . Excessive Cr, especially when combined with Mo, causes secondary phase precipitation ( χ , σ , α ′ , Cr2N, π , and R phases ) , leading to increased embrittlement and decreased pitting corrosion resistance [ 55 ] .\nNickel ( 4.5 -6.5% ) is the alloy that carries the duplex microstructure as an austenite-forming element ( stabilizer ) [ 56 ] . It is responsible for sustaining the austenite phase in the matrix [ 57 ] . This enhances DSS ' s hardness and corrosion resistance, among other qualities [ 10 ] . The two qualities won ' t be enough if the Ni content is less than 4.5%. In a heat-affected zone, excess Ni will accelerate the sigma phase formation and reduce corrosion resistance [ 52 ] . In the study conducted by Potgieter et al [ 58 ] , nickel ( 3 -8 wt% ) in DSS modulates the ferrite-austenite ratio rather than increasing corrosion resistance. Ni content can be adjusted to manage austenite fraction and mechanical stability while keeping Cr and Mo levels constant [ 59 ] . Excess Ni promotes σ -phase precipitation and reduces toughness, whereas insuf /uniFB01 cient Ni decreases austenite content, plasticity, and toughness [ 60 ] . The ideal ferrite-to-austenite ratio ( 1:1 ) ensures optimum corrosion resistance. The assertions meanthat insuf /uniFB01 cient Ni creates phase imbalance and decreases pitting corrosion resistance; hence, a minimum Nilevel is required for DSS performance.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Copper ( upto3.0% ) improves corrosion resistance and grain boundaries. It is more crucial for toughness andhotworkability [ 61, 62 ] . Copper widens the austenite zone, boosts stacking fault energy, and enhances corrosion resistance in DSSs. It is highly soluble in austenite ( ∼ 4 wt% ) but not in ferrite ( ∼ 0.2 wt% ) , resulting in rapid Cu-rich phase precipitation in ferrite [ 63 ] . Cu improves strength and hardness through nano-scaled ε -Cu phase precipitation, affecting work hardening and deformation mechanisms. Small Cu additions ( 0.5 -1.0 wt% ) increase corrosion resistance, particularly in sour conditions, and give antibacterial characteristics [ 64 ] . Cu concentration ( 3.4 wt% ) increases intragranular austenite development in ferrite, resulting in lower yield strength. Cu enhances Cr migration, leading to a higher pitting resistance equivalent number ( PREN ) . However, excessive Cu can lower corrosion resistance due to ε -Cuprecipitation. Cu minimizes σ -phase formation while slightly promoting Cr2N and χ -phase precipitation [ 65 ] . Cu reduces brittleness but enhances Cr activity, resulting in α ′ phase precipitation, which can reduce corrosion resistance.\nMolybdenum ( 3 -3.5% ) is a stabilizing ingredient that forms ferrite. By producing a resistant substance knownasmolybdate, Mo is used as an alloy to protect duplex stainless steel from corrosion and to increase its strength through solid-solution strengthening. When the amount of Mo exceeds the ideal level, the toughness of duplex stainless steel deteriorates, and the sigma and chi phases form [ 10 ] . However, Mo can cause the precipitation of σ and χ phases, leading to increased embrittlement and cracking susceptibility, complicating hot working [ 39 ] . Mo strengthens DSSs by increasing yield strength while decreasing ultimate tensile strength. It improves high-temperature strength, creep resistance, and intergranular corrosion protection. In LDSSs, Mo improves austenite stability while decreasing strain-induced martensite [ 66 ] . In SDSSs, increasing Mo concentration increases strength but decreases elongation. Mo diffuses from ferrite to austenite, which may inhibit ferrite recrystallization and grain development [ 59 ] . To balance corrosion resistance and mechanical qualities, DSS 2205 should have a maximum Mo concentration of about 4 wt% [ 67 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Carbon ( 0.03 ) is an austenite-forming element and acts as a stabilizer, signi /uniFB01 cantly enhancing the material ' s strength [ 68 ] . However, keeping the carbon content below a speci /uniFB01 c limit is recommended to prevent reduced corrosion resistance, which can result from forming certain phases [ 7 ] . Carbon promotes austenite production andincreases steel strength, hardness, and wear resistance via solid solution strengthening. However, excessive carbon in duplex stainless steels ( DSSs ) causes carbide ( M23C6, M7C3 ) production at grain boundaries, depleting chromium ( Cr ) andmolybdenum ( Mo ) , lowering intergranular and pitting corrosion resistance [ 69, 70 ] . Carbide precipitation also lowers plasticity and toughness. Carbon concentration must be optimized since it segregates during solidi /uniFB01 cation, affecting microstructure and increasing the danger of hot cracking. Lower carbon concentration reduces intermetallic phase precipitation, which improves impact and crack resistance [ 71 ] . According to studies, more carbon increases austenite content while decreasing the impact energy and electrochemical corrosion resistance. Carbon in a solid solution strengthens and stabilizes austenite, while low-\ncarbon austenite transforms under strain earlier in DSSs due to the TRIP effect [ 71 ] . Commercial DSSs typically limit carbon content to less than 0.03 wt% to preserve mechanical stability and corrosion resistance.\nNitrogen ( 0.14 -0.2 ) is an austenite-forming element and stabilizer that enhances corrosion resistance. If nitrogen content is too low, the corrosion resistance will be insuf /uniFB01 cient; however, excessive nitrogen can negatively impact hot workability [ 25 ] . In a previous work, it was observed that chromium nitride precipitates dueto nitrogen ( N ) supersaturation in the ferrite matrix [ 72 ] . It strengthens austenite as an interstitial solid solution and affects the mechanical characteristics of the duplex stainless steel [ 73 ] . When the nitrogen level exceeds 0.12 wt%, austenite becomes harder than ferrite. The solubility of N rises with Mn addition, increasing metastability and deformation behaviour via TRIP and TWIP interactions [ 74 ] . N improves corrosion resistance, especially against pitting and stress corrosion in chloride conditions. It generates a protective N-rich layer, which prevents local acidi /uniFB01 cation and speeds up passivation. However, too much nitrogen can form Cr2N andCrNprecipitates, lowering ferrite content and corrosion resistance [ 24 ] . N strengthens DSS 2205 by boosting ferrite-austenite transition and delaying intermetallic phase precipitation [ 75 ] . High nitrogen content improves tensile strength and elongation but may result in nitrogen gas porosities. Overall, regulated N alloying enhances mechanical characteristics, corrosion resistance, and weldability while reducing hazardous phase forms.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Mn ( 2% ) is the element manganese ( Mn ) , which is frequently utilized to improve hot workability in duplex stainless steels ( DSS ) because it functions well as an oxidizing agent. The material ' s resistance to high processing temperatures is reinforced by its presence. The material may become less hot and workable and be more susceptible to cracking and deformation under thermal stress if the manganese content rises above advised thresholds [ 76 ] . Mn increases stacking fault energy, improves deformation processes, and boosts N solubility, strength, and hardness [ 77 ] . Excessive Mn increases σ -phase precipitation, which decreases corrosion resistance [ 78 ] . The effects of Mn on mechanical and corrosion properties vary according to its content. Moderate Mn increases strength and pitting resistance; however, excessive Mn up to 8.1 wt% creates phase imbalance, lowering impact energy and elongation [ 79 ] . In LDSSs, high Mn levels boost TRIP effects but may reduce tensile strength [ 79 ] . Mn improves high-temperature oxidation resistance by creating a protective Cr2O3 layer that promotes self-repair of the oxide coating.\nFromtheabovediscussions, it is evident that every elemental composition greatly impacts the yielding properties of DSS 2205.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Duplex stainless steel ( DSS ) possesses favourable mechanical properties, including toughness, yield strength, hardness, and tensile strength. These properties depend on maintaining speci /uniFB01 c annealing temperatures and cooling rates. Still, they may also decrease due to factors like nitrogen ( N ) , oxygen ( O ) , hydrogen ( H ) content, high ferrite levels, and large grain size [ 80 ] . The formation of intermetallic phases, especially the sigma phase, impacts DSS toughness, often leading to brittleness [ 25 ] . Even a small volume fraction of the sigma phase can signi /uniFB01 cantly reduce toughness due to its network-like morphology, which promotes long-distance crack formation. This leads to ductile fractures in the austenitic phase and cleavage in ferrite. The Sigma phase forms within a larger matrix of ferrite and austenite at high temperatures. Optimal toughness is typically achieved with anannealing temperature of around 850 ° C, while higher ferrite content at 1100 ° Calso increases toughness. Haghdadi et al [ 81 ] found that DSS has greater toughness in the transverse direction than in the longitudinal direction. Intermetallic phase formation in DSS increases hardness and brittleness as these phases consume available ferrite, reducing its content and causing embrittlement [ 82 ] . However, Higher sigma phase content further increases hardness. Research by Paulraj and Garg [ 10 ] onaging DSS across temperatures from 650 ° C -975 ° Crevealed that hardness consistently increases with aging time at all temperatures. However, low sigma phase volume fraction is not a reliable hardness indicator [ 82 ] . Both yield and tensile strength increase with sigma phase formation within the 750 ° C -850 ° Ctemperature range [ 10 ] . At lower temperatures, the sigma phase forms a network-like structure. At 850 ° C, micro-cracking of the sigma phase can cause reductions in strength beyond expected yield levels, leading to low-stress failures. Additionally, tensile strength shows minimal changes with increased sigma phase volume fraction at high annealing temperatures [ 83 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Because of its high concentrations of molybdenum ( Mo ) , nickel ( Ni ) , and chromium ( Cr ) , which improve its resistance to pitting and crevice corrosion, duplex stainless steel ( DSS ) 2205 exhibits strong corrosion resistance [ 1 ] . DSS 2205 has a minimum critical pitting temperature ( CPT ) of 35 ° Candprovides good resistance to stress corrosion cracking caused by chloride at 15 ° C. Above 300 ° C, DSS 2205 also functions effectively in high-\ntemperature oxidation settings, while extended exposure may cause embrittlement. This embrittlement can be lessened by carefully monitoring the annealing process and maintaining heat treatment temperatures between 1020 ° Cand1100 ° C, followed by quick quenching [ 84 ] . DSS 2205 is commonly applied in environments requiring high resistance to temperature and corrosion. According to Sathiya et al [ 85 ] , important industries include petrochemical and chemical processing facilities, food processing, oil distillation, bleach washers, heat exchangers, tubes and pipelines, and naval construction.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Hotdeformation, such as DSS 2205, occurs when the material is heated above its recrystallization temperature during the deformation process [ 86 -92 ] . In DSS 2205, the softer ferrite phase absorbs most of the strain in the early phases and is dominated by dynamic recrystallization. As strain increases, the load is gradually transferred to the austenite phase, leading to further dislocation until dynamic recrystallization takes place. The strain distribution between austenite and ferrite results in complex hot deformation behaviour [ 93, 94 ] . When hot deformation aligns dislocations within subgrain boundaries, phase changes may occur concurrently with dynamic and static recovery. Restoration, deformation, and phase transition interaction is essential in thermomechanical processing for materials like duplex stainless steel. Extrusion, forging, and hot rolling are metalworking processes that commonly entail dynamic recrystallization and recovery processes [ 95 -97 ] . Comparedtosingle-phased ferritic or austenitic stainless steels, the microstructure evolution and mechanical interaction of the ferrite and austenitic phases during the hot deformation process of Duplex 2205 are more complicated. By raising the temperature and lowering the strain rate, austenite ' s dynamic recrystallization is enhanced. During the heat deformation of 2205, the ferrite phase has a larger dynamic recrystallization componentthantheaustenite phase [ 98, 99 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Stacking fault energy ( SFE ) , starting grain size, thermo-mechanical processing conditions, and the presence of second-phase particles are some of the essential elements that affect the complicated process of dynamic recrystallization ( DRX ) [ 100 -102 ] . These factors in /uniFB02 uence the microstructural development, mechanical characteristics, and overall performance of metals and alloys during hot deformation in different ways. Continuous dynamic recrystallization ( CDRX ) , discontinuous dynamic recrystallization ( DDRX ) , and geometric dynamic recrystallization ( GDRX ) are the three main forms of DRX, and each has distinct properties [ 101, 103 -107 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "During hot deformation processes, a form of dynamic recrystallization known as discontinuous dynamic recrystallization ( DDRX ) usually takes place in materials with low stacking fault energy ( SFE ) [ 108 ] . In DDRX, areas of the material that are heavily populated with dislocations are replaced by newly nucleated and growing strain-free grains [ 109 ] ( /uniFB01 gure 7 ) . This method differs from continuous dynamic recrystallisation because it includes the creation of new grains rather than the progressive rearranging of dislocations inside existing grains [ 103, 110, 111 ] .\nIn this form, the applied load establishes an accumulation of dislocations in the material ' s microstructure. Whenamaterialsuch as DSS 2205 possesses low SFE, the dislocations do not rearrange or annihilate easily, which could translate to a high density of dislocations closer to the grain boundaries of the material [ 112 ] . This increases the stored energy in those sites as a result of localized buildup dislocations and forms new grains. The boundaries of existing grains are usually where these new strain-free grains form since they have the largest dislocation density and stored energy [ 113 ] . The newly created grains start to develop while the DDRX process goes on by /uniFB01 lling surrounding deformed regions full of dislocations [ 114 ] . This growing mechanism relieves the internal stresses in the material and lowers the total dislocation density. As a result, the original, distorted structure is no longer dominated by the dislocations, and the microstructure has new, recrystallized grains.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Aprocess known as continuous dynamic recrystallization ( CDRX ) takes place during deformation in materials with high stacking fault energy ( SFE ) [ 53 -55 ] . As the material experiences plastic deformation in CDRX, subgrain and cell structures with low-angle grain boundaries are formed, as illustrated in /uniFB01 gure 8. Rapid\ndislocation annihilation and rearrangement are made possible by high SFE, which promotes effective dynamic recovery. As a result of this recovery process, dislocations are arranged into distinct cells and subgrains, forming low-angle grain boundaries inside the original grains.\nAsstrain and deformation rise, these low-angle barriers eventually change into high-angle grain boundaries. This change happens when the misorientation angle between adjacent subgrains increases with heightened\nFigure 9. Theprogression of grain thickness ( spacing of high-angle grain boundaries in the direction of decreasing dimension ) and subgrain size during geometric dynamic recrystallization ( GDRX ) . Reproduced with permission from [ 103 ] .\nstrain due to dislocation accumulation and rearrangement within the subgrains [ 115, 116 ] . When these misorientations eventually reach a critical level, low-angle boundaries are transformed into high-angle ones. Unlike discontinuous dynamic recrystallization ( DDRX ) , which is the nucleation and growth of new grains, the result is a new, re /uniFB01 nedgrain structure created by a slow, continuous process [ 117 ] . The slow development of high-angle grain boundaries in CDRX improves deformation resistance and is advantageous in applications that call for a re /uniFB01 nedgrain structure and resistance to work hardening.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "During large-strain deformation, a process known as geometric dynamic recrystallization ( GDRX ) takes place, which is typi /uniFB01 ed by notable alterations in the structure and appearance of deformed grains [ 118 -120 ] . The initial grains lengthen and thin out as deformation advances, frequently taking on wavy or serrated surfaces along their edges. Intense deformation leads to the grains stretching and realigning, creating local protrusions or bulges, which results in this serration; nonetheless, even as strain increases, the grains may still be identi /uniFB01 ed as separate entities, as described in /uniFB01 gure 9.\nAt a critical thickness of these long grains, usually about the size of 1 -2 subgrains, the boundary serrations becomesointense that portions of the grain are pinched off. The long grains break apart at this point, forming new, high-angle, equiaxed grains roughly equal in all dimensions [ 121 ] . A stable, /uniFB01 ne-grained structure can form inside the material because of the pinching-off process. The resulting equiaxed grains have high-angle grain boundaries, which provide better resistance to further deformation and are also thermodynamically stable [ 122 ] . GDRXcreates a high-angle boundary network that resists dislocation movement better than low-angle boundaries, increasing the material ' s overall strength and ductility.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Athermally triggered phenomenon known as dynamic recovery ( DRV ) occurs when metals and alloys undergo hot deformation [ 123 -126 ] . Internal stress is decreased, and the microstructure is stabilized through the slow rearrangement and annihilation of dislocations caused by deformation. Dynamic recovery does not always result in recrystallization, even though it frequently precedes dynamic recrystallization. Dynamic recovery mostly happens through processes within the current grains, with little to no grain boundary migration, as opposed to recrystallization, which includes the migration of high-angle grain boundaries and the creation of newgrains [ 127 ] . During dynamic recovery, dislocations in the crystal structure reorganize to produce lowenergy structures such as dislocation cells or subgrains with low-angle borders. This procedure reduces dislocation density, allowing the material to soften somewhat and accommodate more deformation. The gradual creation of these subgrain structures improves stability by minimizing the accumulation of dislocations in a concentrated area and allowing for more uniform plastic deformation. Dynamic recovery is especially\ncritical in materials with high stacking fault energy, such as DSS 2205, where dislocations can move and rearrange more readily [ 128, 129 ] . This process is a prominent mechanism during hot working, such as forging, rolling, and extrusion, as well as in metal creep behaviour under long-term high-temperature circumstances. By stabilizing the microstructure and limiting excessive hardening, dynamic recovery plays a vital role in enabling materials to tolerate high strains and resist failure during lengthy plastic deformation, enhancing their overall workability and performance in industrial applications [ 130 ] . All these are subject to grain boundary conditions andgrain migrations",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Agrain boundary in crystalline materials is an area that separates two misoriented crystals ( or grains ) of the same phase that come into close contact [ 131 -133 ] . Because the two grains have different orientations, the grain boundary acts as a transition area, causing atoms to shift slightly from their usual lattice locations to those within the crystal interior. This atomic movement reduces the excess energy associated with the material ' s discontinuity [ 134 ] . Grain borders are typically considered two-dimensional and serve as the primary interface between adjacent grains. A phase boundary occurs when two grains have different chemical compositions or crystal lattice characteristics. Misalignment of adjacent grains causes less effective atomic packing at the grain boundary, resulting in a somewhat less ordered atomic structure and higher internal energy in this region [ 135 ] . Grain boundaries are de /uniFB01 nedbyanumberofindependent factors known as microscopic degrees of freedom ( DOF ) , which are critical for characterizing the crystallography of the boundary. The DOFs de /uniFB01 ne the border based on the misorientation of the two grains and the orientation of their boundary planes. They also describe important properties, including the rotation angle, rotation axis, and boundary plane [ 136 ] .\nGrain boundary migration is the term used to describe the movement of a grain boundary between two neighbouring grains. The boundary is shifted as a result of individual atoms from one-grain diffusing across it andincorporating into the next grain. The boundary movement ' s direction is the opposite of the atomic diffusion ' s [ 137 ] . For duplex steel such as 2205, displacements take place between the boundaries of the austenite andferrite grains, and dislocations tend to form near the ferrite matrix ' s limits [ 138 ] . Grain boundary movement is primarily driven by three factors, which are listed in decreasing order of in /uniFB02 uence: ( 1 ) Chemical Energy: Grain-to-grain boundary migration can lower chemical potential due to variations in solute concentration or chemical composition; ( 2 ) Strain Energy: This results from the material ' s stored dislocations. The total dislocation density is usually decreased when the boundary migrates to release the strain energy, and ( 3 ) Elastic Energy: The boundary shifts to reduce the total elastic energy because of variations in elastic strain among the grains. Grain boundary migration is primarily driven by the need to lower the system ' s overall energy. The process is primarily driven by the total grain boundary energy, which is reduced as the boundaries shift [ 139 ] . Grain growth and recrystallization are two processes that depend on grain boundary migration. Grain size and shape changes as a result of boundary movement in these processes. The fundamental process that makes this movementpossible is the diffusion of atoms over the boundary. The migration of low-angle grain boundaries ( LAGBs ) andhigh-angle grain boundaries ( HAGBs ) during hot-rolled metal annealing is essential for microstructure recovery and re /uniFB01 nement.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Thelow-angle grain boundary ( LAGB ) , also referred to as a sub-grain boundary, occurs when the misorientation between two grains is 15 degrees or less [ 140 -143 ] . These boundaries are characterized by a periodic arrangement of dislocations, which play a crucial role in the design and con /uniFB01 guration of dislocation structures. Two primary types of LAGBs exist: the twist low-angle grain boundary and the tilt low-angle grain boundary. In tilt boundaries, the dislocations are primarily edge dislocations, with Burgers vectors perpendicular to the boundary plane and line directions aligned with the rotational axis [ 144 ] . If the tilt boundary is asymmetrical with respect to the two adjacent crystals, two different edge dislocations with distinct Burgers vectors are needed to accommodate the mismatch [ 137 ] .\nOntheother hand, twist boundaries consist of screw dislocations with Burgers vectors lying within the boundary plane [ 133 ] . Parallel screw dislocations induce shear deformation, while two perpendicular dislocations result in pure rotational movement [ 136 ] . The primary mechanism for the migration of low-angle grain boundaries ( LAGBs ) in DSS 2205 ( DuplexStainless Steel 2205 ) is the climb and glide of the boundary ' s dislocations. Dislocation theory thus provides an effective explanation for the behaviour of LAGB migration. Mobile dislocations within the boundary cause the entire boundary to shift when they move. In contrast to high-\nangle grain boundaries, low-angle grain boundaries have been found to have substantially less mobility [ 133 ] . Themigration mechanism of LAGBs is characterized by a constant rate of movement, indicating that a given boundary ' s mobility stays constant during isothermal annealing. Bulk diffusion governs this behaviour, which meansthat atoms ' diffusion within the bulk material, as opposed to at the surface, controls the migration of LAGBs.Theconnection between misorientation and boundary mobility is a notable feature of LAGB migration. This suggests that LAGBs can migrate more quickly and are more mobile when their misorientation angles are higher. Moreover, a low-angle grain boundary ' s energy is extremely sensitive to its misorientation. Because of the increased dislocation density and, consequently, higher internal stress within the boundary region, the energy of the boundary tends to increase with the misorientation angle [ 145 ] . As a result, the level of misorientation directly impacts LAGBs ' energy and movement.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Ahigh-angle grain boundary ( HGB ) is one when the misorientation of two adjacent grains exceeds 15 degrees. These borders have a relatively open atomic structure due to the considerable misalignment of the crystal lattices. This mismatch causes broad areas of poor atomic packing, where links between atoms are either broken or signi /uniFB01 cantly deformed [ 146 ] . As a result of the disruption in the usual atomic arrangement, high-angle grain boundaries have higher energy levels. The structural model is often used to describe the atomic structure of highangle grain boundaries. According to this hypothesis, HGBs are composed of a repeating pattern of structural units, which re /uniFB02 ect small groupings of atoms grouped in certain patterns. These units show the limited and different ways in which atoms can be packed together at the boundary despite the region ' s overall disarray [ 147 ] . High-angle grain boundaries are classi /uniFB01 ed into single, vicinal, and general. Singular grain boundaries are wellde /uniFB01 nedstructural units that have unique, low-energy structures. Vicinal grain boundaries are misoriented from a solitary border, resulting in a transitional structure. In contrast, general grain boundaries lack any distinctive, repeating pattern and have the highest energy and most disorganized atomic organization.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Notevery high-angle grain boundary has an open, chaotic structure. Certain high-angle boundaries may have slightly lower energies than ordinary random boundaries in rare instances. This occurs when particular misorientations and boundary planes allow the two adjacent crystal lattices to align in a way that reduces interatomic bond distortion [ 148 ] . These speci /uniFB01 c conditions produce a more organized and stable boundary structure, lowering the overall energy associated with the boundary. Twin boundaries are one of the most basic types of special high-angle boundaries [ 149 ] . Twinning occurs when the orientation of the two grains across a twin boundary is the same as their identical counterpart. When the twin boundary is parallel to the twinning axis, the atoms at the border integrate perfectly into the crystal lattices of both grains, resulting in minimum deformation. This excellent match contributes to lower boundary energy than other high-angle grain barriers where atomic mis /uniFB01 t is more noticeable. In the recent work [ 150 ] , grain boundary sliding occurs during superplastic deformation, which enhances grain boundary mobility. It has a deleterious effect on sigma phase precipitation, causing some of it to precipitate on twin borders with lesser mobility.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "After material processing, such as heat treatment, nitriding, alloying, forming, and deformation, the properties andcharacteristics of materials change. Therefore, the changes in some properties after hot deformation are discussed as follows.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Duplex stainless steel ' s ( DSS ) phase transition and microstructure evolution are greatly in /uniFB02 uenced by hot deformation. According to Li et al [ 151 ] , precipitation increases with increasing temperatures and degrees of deformation in 2205 DSS, where secondary austenite production takes place during hot deformation and cooling. Dynamic recrystallization and recovery are important factors in the evolution of the microstructure, andtheideal hot deformation parameters for Cu-bearing 2205 DSS are 1100 -1150 ° Cand0.1 -1 s -1 strain rate [ 152 ] . Comparing single-phase investigations to austenite in DSS, ferrite shows a higher strain rate and temperature sensitivity but lower hot strength and work hardening [ 153 ] . Deformation and phase change can cause localized distribution of microstructural components and carbide precipitation on grain boundaries, as reported in carbon steels [ 154 ] . Understanding these intricate relationships is critical for improving DSS ' s hot working processes.\n2205 DSS changes into several phase transformations as a result of processing and distortion. These changes combinetogenerate secondary phases such as intermetallic, carbides, and nitrides. Intermetallic phases typically\nFigure 10. Themicrostructure of hot deformed DSS 2205 at different strain rates and ageing time of ( a ) 950 ° C, ä = 0%, ( b ) 950 ° C, ä = 50%, ( c ) 1000 ° C, ä = 40%,and ( d ) 1100 ° C, ä = 15%.Reproduced with permission from [ 151 ] . CC BY-NC-ND4.0.\nhave a high concentration of chromium, which may aid in reducing the onset of corrosion [ 155 ] . For example, the aging treatment of hot-rolled resulted in huge precipitation of the Chi ( χ ) andSigma ( σ ) phases, respectively [ 42 ] . In the work of Li et al [ 151 ] , where the effect of hot deformation was observed on the material, it was discovered that there are no secondary austenite microstructural changes in the absence of deformation. In further work by Shimomura et al [ 156 ] , it was established that the deformation of the γ phase corresponded with changes in the shape of the /uniFB02 owstress curves from DRV-type to DRX-type. Likewise, at 950 -1100 ° C, secondary austenite ( γ ′ ) developed inside the ferrite matrix, as seen in /uniFB01 gure 10. This precipitation increased with longer aging time and higher deformation. Similarly, the initial γ ′ phase gradually converted into the secondary austenite ( γ 2 ) phase over time. Also, in another work, the ideal hot deformation temperature range is between 1423 and 1523 K; temperatures above this cause high-temperature brittleness. With the dynamic recovery in the austenite ( γ ) phase and dynamic recrystallization in the ferrite ( δ ) phase, hot deformation produced a /uniFB01 ner microstructure than the as-cast material. Small secondary austenite ( γ ) phase islands precipitated on the ferrite ( δ ) matrix, which can signi /uniFB01 cantly enhance the 2205 duplex stainless steel ' s hot ductility behaviour [ 157 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Thehotdeformation of Cu-bearing 2205 duplex stainless steel ( 2205-Cu DSS ) showsthat the shapes of /uniFB02 ow curves were greatly in /uniFB02 uenced by the relative volume fractions of the ferrite and austenite phases [ 153 ] . This is because, at low strain rates, dynamic recrystallization ( DRX ) occurs in the ferrite phase as the temperature rises. It was also established that the activation energy for hot deformation of the 2205-Cu DSS was around 405 -452 kJ mol -1 , which was affected by the deformation parameters strain, strain rate, and temperature [ 152, 158 ] . In the work of Mampuya et al [ 23 ] , it was observed that the initial lamellar microstructure of duplex stainless steel 2205 was converted into a clustered or blocky structure with intermetallic precipitates. Furthermore, such microstructure changes, such as the formation of intermetallic phases, can reduce the overall mechanical properties of duplex stainless steel. The type of desired microstructure can be developed through control and managed heating and heat treatment during hot deformation. In the work of Cojocaru et al [ 110 ] , hot deformation at temperatures ranging from 1000 to 1025 ° C, 2205 duplex stainless steel ' s microstructure sustains equal proportions of austenite ( γ ) andferrite ( δ ) phases. Also, a secondary austenite ( γ 2 ) phase formed at the ferrite ( δ ) grain boundaries at temperatures between 1200 and 1275 ° C, which was followed by a decrease in internal stresses and an increase in dynamic recrystallization in the ferrite phase. Since the harmful sigma ( σ ) phase only appeared at temperatures below 1050 ° C, the 2205 DSS can be safely hot deformed by upsetting at temperatures between 1050 and 1275 ° C. At higher temperatures, the material constants were more comparable to the d-ferrite phase, whereas at lower temperatures, they were closer to the austenite phase [ 159 ] . Above all, the amountofphaseandsecondary phase changes and precipitations are dependent on the number of passes,\nFigure 11. EBSDmapsofaustenite and ferrite grain misorientations and the corresponding histograms of the distribution of ferrite grain boundaries with respect to misorientation angles at ( a ) , ( b ) T = 1323 K, = 0.01 s -1 , = 0.4; ( c ) , ( d ) T = 1323 K, = 0.01 s -1 , = 0.8; ( e ) , ( f ) T = 1323 K, = 30 s -1 , = 0.8. Reproduced with permission from [ 94, 163 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "dwelling time, and the holing temperature [ 160 ] . The production of intermetallic phases, particularly at temperatures ranging from 500 to 1000 ° C, can have a major impact on the mechanical and corrosion properties of duplex stainless steels ( DSS ) andsuper duplex stainless steels ( SDSS ) such as 2205, particularly during welding procedures [ 10 ] . Even a small volume fraction of intermetallic phases, particularly the sigma phase, can signi /uniFB01 cantly impair the toughness of DSS and SDSS due to their hard and brittle nature, resulting in embrittlement and lowering these materials ' corrosion resistance [ 161 ] . Controlling the production of intermetallic phases during processing by using appropriate chemical compositions and carefully controlling heating and cooling rates can assist in improving the mechanical and corrosion properties of DSS and SDSS [ 161 ] . In the deformation such as friction stir welding, the duplex and super duplex stainless steel joints showed comparable microstructural properties, leading to notable grain re /uniFB01 nementandenhancedhardness of the welded joints. Continuous dynamic recrystallization in the ferrite, followed by austenite fragmentation and recrystallization, were the microstructural restoration mechanisms that produced /uniFB01 ner austenite grains than ferrite grains. Chromium nitride or chi-phase precipitates were seen at the ferrite-austenite boundary in the steel [ 162 ] .\nAt a low strain rate and high temperature, ferrite experiences considerable microstructural changes, including the creation of low-angle grain boundaries ( LAGB ) due to dynamic retrogression. As strain increases, LAGBgradually converts into high-angle grain boundaries ( HAGB ) , allowing for continuous dynamic recrystallization ( CDRX ) . This change is caused by dislocation absorption and boundary contacts, which results in equiaxed grains. The CDRX procedure is less effective at a greater strain rate, with a HAGB percentage of only 28%.Thissuggests decreased strain partitioning, which reduces the severity of grain boundary evolution in ferrites. Furthermore, dynamic recrystallization is absent in austenite at both strain rate circumstances [ 163 ] . This is evident in /uniFB01 gure 11.\nIn the study conducted by Sasaki et al [ 34 ] , three types of compressed microstructures were observed in the ferrite single-phase steels: pancake-shaped ferrite grains ( coarse compressed ferrite grain ) , subgrains at grain boundaries, and partially recrystallized microstructures. as depicted in /uniFB01 gure 12. The recrystallization of ferritic\nFigure 12. EBSDdataofinitial microstructures at various deformation temperatures and 30 s -1 strain rate ( a ) Ferrite single-phase steels; ( b ) Austenite single-phase steels. Reproduced from [ 34 ] . CC BY 4.0.\nstainless steels has a high stacking fault energy ( SFE ) , which allows dislocations to climb or cross-slip more easily, resulting in dynamic recovery. Only the γ -phase of 2205 during hot deformation had dynamic recovery; nevertheless, the δ phase experienced dynamic recrystallization [ 164 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Strain is mostly partitioned into ferrite at lower strain rates, leaving the austenite islands generally spherical andwithlittle dislocation density even after 0.4 strain. However, the austenite islands elongate signi /uniFB01 cantly at larger strain rates, indicating stronger plastic deformation. Furthermore, higher strain rates cause enhanced strain partitioning in austenite, resulting in a larger dislocation density and tangled dislocations throughout the structure [ 58 ] , as seen in the TEM structure in /uniFB01 gure 13.\nAt a high strain rate ( 30 s -1 ) , increasing the deformation temperature to 1423 K increases the proportion of HAGBsinferrite to 35%. Lowering it to 1223 K reduces HAGBs to 15%, boosting CDRX at higher temperatures. Asthe temperature falls ( 1473 -1223 K ) , the austenite phase percentage rises from around 35% to 50%. Lower temperatures also promote DDRX in austenite, resulting in a necklace-like structure at grain boundaries while reducing CDRX in ferrite [ 165 ] . The main deformation mechanism was slip transfer between the austenite and ferrite phases. When the Luster-Morris value is greater than 0.81, dislocation slip may happen across the phase boundaries, as depicted in TEM images in /uniFB01 gure 14 [ 145 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Hotdeformation has a major impact on duplex stainless steel ' s mechanical properties and microstructure ( DSS 2205 ) . At high temperatures ( 950 -1150 ° C ) , austenite exhibits dynamic recrystallization ( DRX ) , whereas ferrite exhibits dynamic recovery ( DRV ) [ 152, 166 ] . The ideal hot deformation parameters for 2205-Cu DSS are 1100 -1150 ° Candstrain rates of 0.1 -1 s -1 [ 152 ] . SAF 2205 ' s tensile strength declines fast between 800 -950 ° C andsteadily from 1000 -1100 ° C [ 152 ] . Rolling deformation at lower temperatures ( 800 -900 ° C ) can create a micro-nanocrystalline composite structure, which increases strength and hardness while altering the fracture modefromductile to brittle [ 167 ] . According to C Lei et al [ 168 ] , the actual activation energy for hot deformation of 2205 DSS is roughly 451 -452 kJ mol -1 . The /uniFB02 owbehaviour and microstructure evolution during hot deformation of 2205 DSS are strongly in /uniFB02 uenced by temperature and strain rate.\nWithayield strength of 585 -607 MPa, ultimate tensile strength of 796 -802 MPa, and fracture elongation of 28.4 -32.8%, the two-stage solution ( TSS ) heat treatment procedure successfully balanced strength and plasticity in 2205 duplex stainless steel [ 145 ] . The primary deformation mechanism was slip transfer between the austenite\nFigure 14. Slip behaviour of dislocations of DSS 2205 under different interfaces and strains after heat treatment: ( a ) -( c ) ε = 0.005, ( d ) ε = 0.02, ( e ) ε = 0.1, ( f ) ε = 0.2. Reproduced with permission from [ 145 ] .\nandferrite phases, and when the Luster-Morris value was greater than 0.81, dislocation slip may happen across the phase boundaries [ 169 ] . The 2205 DSS hot working process performs best at high temperatures and low strain rates, especially when the true strain is less than 0.3. Also, high ef /uniFB01 ciency can be attained at moderately high temperatures and high strain rates at strains of 0.5 and higher [ 170 ] . It was established by Shen et al [ 171 ] that pre-straining the 2205 duplex stainless steel boosted its microhardness by dislocation multiplication, straininduced martensite formation, and grain re /uniFB01 nement. The ferrite phase experiences strain partitioning and softening early, while the austenite phase experiences intricate and insuf /uniFB01 cient softening [ 172 ] . When distorted at 0.1 -10 s -1 at 950 ° C, the majority of ferrite undergoes continuous dynamic recrystallization and acquires a < 001 > // NDstructure; higher temperatures promote the merger of high-angle grain boundaries. This activity subjects ferrite to undergo a phase transition from δ to γ whenit is deformed at 0.01 s -1 / 850 ° C -950 ° C [ 111 ] . In the work of Mishra et al [ 173 ] , work hardening was seen in the early stages of deformation, followed by softening, which was more prominent at higher temperatures and lower strain rates. The processing map\nTable 1. Effect of strain rate and temperature on the mechanical properties of hot deformed DSS 2205.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "[ 178, 179 ], Strain rate range ( S - 1 ) = 0.005 to 0.5. [ 178, 179 ], Temperature = 1373 K. [ 178, 179 ], Effect onproperties = Increase the strain rate upto0.5 s - 1 ,andenhancedthehot ductility of the 2205 duplex stainless steel, as assessed by total elongation andarea reduc- tion, dueto microstructuralmodi /uniFB01 cations that reduced the hardness diff- erential between the ferrite andaustenite phases.. [ 93 ], Strain rate range ( S - 1 ) = 0.001, 10, and > 100. [ 93 ], Temperature = 20 ° C,100 ° C,300 ° C and500 ° C. [ 93 ], Effect onproperties = Areduction in the fracture strain wasobserved as the strain rate increased. Temperature tests showedadecrease in strain to fracture with increasing temperature.. [ 165 ], Strain rate range ( S - 1 ) = 0.01and30. [ 165 ], Temperature = 223 - 1473 K. [ 165 ], Effect onproperties = The /uniFB02 owstress rises with lower temperatures andhigher strain rates.The continuous dynamic recrystallization of ferrite was substantially activated in the /uniFB02 owstability region, but both continuous anddiscontinuous dynamic recrystallization in austenite were weak. This will reduce the yield strength andincrease toughness.. [ 180 ], Strain rate range ( S - 1 ) = 0.1, 1, 10 and50. [ 180 ], Temperature = 850, 900, 950, 1000, 1050 and1100 ° C. [ 180 ], Effect onproperties = Increasing temperature or strain rate causes the production of newgrains not just at grain borders but also within the interiors of deformed grains. During dynamic recrystallization, grain size andfraction rise with temp- erature but have a non-linear relationship with strain rate. This improves the yield strength of the material.. [ 163 ], Strain rate range ( S - 1 ) = 0.01 to30. [ 163 ], Temperature = 1223 to 1473 K. [ 163 ], Effect onproperties = Reducing the deformation temperature andincreasing the strain rate resulted in less dynamic recrystallization in the ferrite, weaker softening of the twophases, andmicrocrack creation.. [ 34 ], Strain rate range ( S - 1 ) = 0.001 to 5. [ 34 ], Temperature = 850 to 1050 ° C. [ 34 ], Effect onproperties = Highstrain rates ( > 5 s - 1 ) andlowtemperature ( < 972 ° C ) resulted in a moderate ef /uniFB01 ciency ( ≈ 35% ) despite an inhomogeneousmicrostructure andnon-uniformmechanical characteristics.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "revealed two instability zones at high strain rates: /uniFB02 owlocalization at low temperatures ( 900 -1050 ° C ) and cracking at high temperatures ( 1150 -1200 ° C ) . This found two stable deformation domains: one at 1065 -1150 ° Cand0.01 -0.3 s -1 , and the other at 1175 -1200 ° Cand0.3 -1 s -1 . The strain rate sensitivity and apparent activation energy of DSS 2205 differed between low and high deformation temperatures [ 159 ] . Furthermore, the previous work conducted [ 120 ] established that the strain rate in /uniFB02 uences the material ' s grain recrystallization. While the critical stress rises and gets closer to the peak stress at greater strain rates, the critical strain for the start of dynamic recrystallization ( DRX ) falls, depending on the applied strain rate, and the DRX softening mechanism starts at various strain values. The alloy can produce good hot workability by decreasing the stress exponent ( n ) andincreasing the stress multiplier ( α ) in the real strain range of 0.18 -0.55 [ 174 ] . Increasing the strain rate could improve the 2205 duplex stainless steel ' s hot ductility by increasing total elongation and reduced area. Increasing the strain rate beyond 0.5 s -1 resulted in a small reduction in hot ductility. The improved hot ductility at higher strain rates was attributed to enhanced dynamic recrystallization in the austenite, greater low-angle grain boundaries in the ferrite, and a smaller hardness differential between the twophases [ 175 ] . In recent work, it was established that the synergistic effects of grain re /uniFB01 nement, dislocation strengthening, and hetero-deformation-induced strengthening, along with the co-activation of cross-slip systems in ferrite and single-slip systems in austenite, contribute to the dual-heterostructured 2205 DSS ' s superior strength-ductility synergy [ 176 ] . However, when it is subjected to a harsh environment such as hydrogen, the embrittlement increases with increasing hydrogen gas pressure and concentration, with more pronounced effects on area reduction and elongation at break compared to ultimate tensile strength and with the transverse orientation slightly more susceptible to embrittlement than the longitudinal orientation [ 177 ] . Theeffect of stain rate on the mechanical properties can be seen in table 1.\nTheeffect of rolling and annealing processes was seen in producing a heterogeneous microstructure in 2205 duplex stainless steel, consisting of a recrystallized soft zone, a non-recrystallized hard zone, and a gradient structure with coarse and ultra /uniFB01 ne grains. This heterogeneous microstructure signi /uniFB01 cantly improved mechanical characteristics, raising yield strength from 488 MPa to 657 MPa and tensile strength from 704 MPa to 816 MPa [ 181 ] , which is applicable in building pressure vessels [ 182 ] . These analogies are evidenced in /uniFB01 gure 15.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Theeffect of heat deformation on the corrosion characteristics of DSS 2205 is complex and depends on a numberofvariables [ 76 ] . The authors established that the precipitation of secondary phases in DSS 2205 lowered its corrosion resistance, and variations in the ferrite-austenite ratio resulted in preferred ferrite\nFigure 15. EBSDimagesandgrainsizedistribution of deformed DSS 2205 at ( a ) Austenite and ferrite phase maps. ( b ) Ferrite grain size. ( c ) IPF colouring map. ( d ) Austenite grain size. Reproduced with permission from [ 181 ] .\ncorrosion. DSS 2205 ' s austenite phase is more corrosion-resistant than the ferrite phase due to its higher nickel content. Chromium is the key ingredient in the passive coating that prevents localized corrosion [ 171 ] . Bending deformation, both tensile and compressive, can cause metastable pitting corrosion, with compressive deformation having the greater impact [ 183 ] . The pitting corrosion mechanisms with hot-rolled 2205 experienced more severe pitting in Cr-depleted regions around the sigma phase of the material [ 42 ] . Hightemperature aging improves overall corrosion resistance while marginally reducing pitting corrosion resistance [ 61 ] . The residual stress analysis of hot and cold-rolled DSS 2205 demonstrates deformation in both the austenite and ferrite phases, with the austenite phase exhibiting higher tensile stress [ 184 ] . Because of its larger Niconcentration, the austenite phase generally outperforms the ferrite phase in terms of corrosion resistance, although Cr is critical for building resistance to localized corrosion and is mostly applicable in marine environments [ 185 ] . Hot deformation can considerably impact DSS 2205 ' s corrosion behaviour, microstructure, and phase composition. Corrosion resistance increased at 14% and 21% pre-strain of DSS 2205 but decreased at 7% pre-strain due to changes in surface energy, strain-induced martensite, and low-angle grain boundaries. Also, the change in pitting nucleation locations with increasing pre-strain was caused by increased dislocation density and the development of strain-induced martensite [ 186 ] . Corrosion resistance increased at 14%and21%pre-strain, but decreased at 7% pre-strain due to changes in surface energy, strain-induced martensite, and low-angle grain boundaries. The shift in pitting nucleation sites with increasing pre-strain was linked to increased dislocation density and strain-induced martensite production [ 186 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "In the same way, other work had concluded that the warm rolled samples had greater corrosion resistance, as evidenced by higher charge transfer resistance ( Rct ) values than the as-received sample, and the corrosion resistance improved with increasing warm rolling deformation from 60% to 80% [ 187 ] . During hot deformation, the grain re /uniFB01 ning process enhances the grain boundary area, which speeds up the production of a protective oxide /uniFB01 lmandimprovesits stability, resulting in increased corrosion resistance [ 188, 189 ] , which is applicable in paper and pulp industry. The corrosion resistance of the solution-annealed is increased. Pitting begins in the Cr-depleted region from the σ phase in the aged hot-rolled 2205 and becomes more severe over time. Pitting corrosion may begin at the phase boundary, /uniFB02 aws, and martensite in aged cold-rolled 2205. The electrochemical approach was used to selectively dissolve the σ phase and compare the microstructure and corrosion behaviour of hot-rolled and cold-rolled 2205 duplex stainless steels [ 42 ] . In the work of Xiao et al [ 190 ] , it was established that elastic tensile stress can improve the pitting corrosion resistance of 2205 DSS through decreased dislocation density. Also, it was exerted that the corrosion resistance reduces at a stress of morethan40%oftheyieldstrength; yet, even at 88% yield strength, corrosion resistance remains higher than\nwithout stress. Above all, the elastic stress in /uniFB02 uences the size and shape of corrosion pits, causing them to form at the pit bottom and perpendicular to the stress direction. When tested in saline solutions with H2S within pH 3.5 and4.5, the duplex stainless steel 2205 developed severe embrittlement and cracking, thereby experiencing stress corrosion. While at pH above 4.5, it combines intergranular cracking, cleavage, and micro-dimples [ 191 ] . Also, in a similar observation by Gonzaga et al [ 192 ] , secondary cracks propagated by preferentially dissolving the ferrite phase, and specimens tested at pH 4.5 exhibited deformation lines perpendicular to the rolling direction that were harder than the surrounding areas.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Several important conclusions have been drawn from recent studies on the optimization of duplex stainless steel ( DSS ) 2205 ' s composition and heat treatment. Heat treatment of hot-rolled 2205 DSS will increase the equiaxed grains in the morphology, which would translate to better microstructural properties and hot workability. The steel is usually more prone to cracking during hot rolling because of the high percentage of high-angle grain boundaries in the Widmanstätten morphology. However, the equiaxed morphology produced a more coherent interface and lower-angle grain boundaries, which could improve the hot workability of the 2205 DSS [ 179 ] . Optimizing the annealing temperature is essential for corrosion resistance; in acidic settings, the ideal temperature is determined by the pitting resistance equivalent number and Ni content [ 193 ] . Phase balance, σ -phase formation temperature, and chromium nitride formation onset are the main focuses of the thermodynamic criteria created for choosing advanced DSS chemical compositions [ 194 ] . Rapid cooling inhibits harmful brittle phases and encourages the development of ferrite in the selective laser melting of 2205 DSS [ 195 ] . A balanced dual-phase structure with enhanced elongation can be obtained with further heat treatment. Multiple regression equations from thermodynamic modelling can be used to optimize the chemical composition of DSS since they accurately estimate the amount of ferrite at various quenching temperatures [ 194 ] . These results help hot-deformed DSS 2205 reduce hazardous phases more successfully. With a yield strength of 585 -607 MPa, ultimate tensile strength of 796 -802 MPa, and fracture elongation of 28.4 -32.8%, the two-stage solution ( TSS ) heat treatment procedure successfully balanced strength and plasticity in 2205 duplex stainless steel. During heat treatment of DSS 2205 using the welding method, the sigma phase content could reach 13% at 850 ° C, and the sigma phase exhibited a higher voltaic potential than the matrix. Still, the chromium-depleted zone surrounding it had a lower potential. The passive layer on the material with the sigma phase possessed higher carrier densities, decreased chromium oxide concentration, and groove /uniFB02 aws that could serve as corrosion routes [ 196 ] . The precipitation of secondary phases in DSS 2205 during hot deformation lowers its corrosion resistance, and variations in the ferrite-austenite ratio result in preferred ferrite corrosion, which can be eliminated by heat treatment at approximately 1080 ° Cthroughmicrostructure optimization [ 197 ] , which makes it ideal for petrochemical and chemical applications [ 198 ] . In an attempt to improve the mechanical properties of hot-deformed DSS, the steel solution treated at 1050 ° Chadahigherpotential for the TRIP ( transformation-induced plasticity ) effect than those treated at 1150 ° Cbyproducingtensile strength and elongation after 5 min, reaching up to 58692 MPa, owing to the presence of a more unstable austenite phase that changed to martensite during deformation [ 199 ] . Cu-2205 DSS, aged at 850 ° Cfor30 min, results in microstructural changes such as increased γ phase proportion and production of new σ phase and copper-rich precipitates. The aged Cu-2205 DSS has much higher mechanical properties, including hardness, tensile strength, and yield strength [ 61 ] . The study found that annealing between 500 and 950 ° Cconsiderably improved the microstructure and mechanical properties by eliminating the textural variations and achieving uniform grain distribution while entirely eradicating residual stress from the ferritic and austenitic phases. The results revealed that the fatigue limit of",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "the annealed specimen was 11.1% greater than that of the as-deformed specimen, demonstrating increased durability [ 200 ] . However, in some other studies, heat treatments have further released more detrimental phases on hot-deformed DSS 2205. In one study, there was a formation of harmful sigma ( σ ) andchi ( χ ) phases in DSS 2205 deformation through welds after heat treatment at 850 ° Cand 900 ° Cfor 3 and 6 h. The amounts of these harmful phases varied throughout the various zones, which was attributable to changes in elemental partitioning and microstructural morphology [ 201 ] .",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    },
    {
        "content": "Thehotdeformation processes of Duplex Stainless Steel ( DSS ) 2205 signi /uniFB01 cantly in /uniFB02 uence its microstructure, which in turn affects the mechanical and corrosion properties. Hot deformation re /uniFB01 nes the ferrite and austenite grain structures, enabling dynamic recrystallization and recovery processes. Controlling deformation temperature, particularly between 800 ° Cand900 ° C, is critical for promoting the precipitation of secondary phases, such as sigma phase and carbides, which can affect material performance. However, excessive sigma\nphase precipitation should be avoided since it might reduce toughness and corrosion resistance. Grain boundary crystallization in DSS 2205 is closely related to the production of low-angle grain boundaries ( LAGBs ) andhighangle grain boundaries ( HAGBs ) . LAGBs, which are distinguished by periodic dislocations, contribute to subgrain structures and are essential for dislocation accommodation and energy reduction during deformation. Highstrain rates can limit the production of sigma phases at these boundaries, reducing embrittlement. The kind of grain boundary -tilt or twist -also in /uniFB02 uences dislocation behaviour and the deformation processes at work. The mechanical properties of DSS 2205, including strength, ductility, and toughness, are heavily in /uniFB02 uenced by its grain boundary features and phase distribution. Proper management of deformation and aging parameters improves the duplex structure, resulting in a better balance between the ferrite and austenite phases. Furthermore, knowing the secondary phases ' nucleation and development processes, such as sigma and chromiumnitrides, improves microstructural stability and long-term performance in challenging conditions.\nIn conclusion, heat deformation of DSS 2205 is a complicated yet crucial process that in /uniFB02 uences its structural and functional properties. Controlling the parameters of deformation and post-deformation treatments allows you to customize the material ' s grain boundary characteristics and phase composition, resulting in an appropriate balance of mechanical qualities and corrosion resistance. Future improvements in this discipline should concentrate on customizing microstructures using novel thermomechanical processing processes to ful /uniFB01 l the changing needs of industrial applications.",
        "source": "10.1088/2053-1591/adb2e2",
        "file_path": ""
    }
]