[
    {
        "content": "Structural stainless steel; austenitic stainless-\nDuplex and steel reinforcing rebar; Mechanical properties; High temperatures; Manufacturing process\nThe main two types of austenitic materials are 304 (designated by ASTM A240), sometimes referred to as UNS S30400 or 1.4301, and X5CrNi18-10 in Europe. The second classification is 316, designated by ASTM A240, known as UNS S31600 or 1.4401, and represented as X5CrNiMo17-12-2 [6].\nMarkeset [7] demonstrated that these varieties have specific benefits for reinforcing concrete because of their metallurgical composition and physical characteristics. Duplex stainless steels typically include 22-23% chromium and 4-5%  nickel,  resulting  in  a  two-phase  microstructure  that  comprises  both austenitic and ferritic phases [8]. The three main types of duplex stainless steel are UNS S32101-1.4162/X2CrMnNiN21-5-1, UNS S32304-1.4362/ X2CrNiN23-4 and UNS  S32205-1.4462/X2CrNi-MoN22-5-3. Austenitic steels exhibit lower mechanical strength compared to duplex steels whereas, the higher chromium content and lower nickel and molybdenum levels in duplex steels enhance their attractiveness, providing a favorable balance of corrosion resistance, cost-effectiveness, and stable pricing [9].\nDainezi et al. [10] determined that in DSS, limitations related to operational temperature could lead in the formation of hard, chromium-rich intermetallic phases, affecting both mechanical and corrosion properties. The adjustment of the  alloy  elements  such  as  (Cr,  Mo,  Ni,  Mn,  N,  C)  along  with  the  alloy processing enables the development of a two-phase microstructure characteristic  of  DSS.  This  homogeneous  microstructure  comprises  primary ferrite  and  austenite  phases,  which  can  be  altered  to  redissolve  undesirable substances through heat treatments, including dissolution and aging [10]. For instance,  Cronemberger  et  al.  [11],  and  Mohammed  et  al.  [12]  noted  that elevating the temperature and extending the solubilization process resulted in a microstructure  characterized  by  larger  grains.  However,  the  cooling  rate, especially  slow  cooling  in  a  furnace,  affects  the  formation  of  intermetallic phases (sigma, chi, and alpha line), which subsequently influences mechanical properties, including reduced strength, increased hardness, decreased toughness, and  increased  susceptibility  to  corrosion.  Therefore,  analyzing  the  effect  of secondary phase precipitation and various cooling methods on stainless steel reinforcing rebar after high-temperature exposure is important to understand its behavior in fire scenarios.\nThis paper provides a comprehensive analysis of prior research on the use of duplex and austenitic stainless steel reinforcement bars in reinforced concrete structures. It further explores the investigation of material properties that are influenced by extended exposure to elevated temperatures and various cooling methods. The objective is to improve understanding of how these conditions affect  the  mechanical  and  microstructural  behavior  of  duplex  and  austenitic stainless steel reinforcement bars. The following is the structure of this paper: section 2 reviews a general background of stainless-steel reinforcement with its material property. Section 3 expresses the behavior of stainless-steel",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "In recent times, there has been a rise in the utilization of structural stainless steel, largely due to its attractive aesthetic and architectural features as well as its durability. Santonen et al. [1] classified stainless steels as iron alloys with a minimum of  10.5%  chromium  by  weight  and  a  maximum  of  1.2%  carbon. Mustapha Karkarna et al. [2] clarified that chromium content is crucial for the formation of a self-repairing oxide layer, referred to as a passive layer, which ensures  the  alloy's  corrosion  resistance. The  metallurgical  composition  of stainless steel is significantly affected by various alloying elements, leading to the classification of stainless steels into four distinct categories, each possessing unique mechanical, chemical, and physical properties. The categories include martensitic,  ferritic,  duplex,  and  austenitic  stainless  steels  as  illustrated  in Fig.1[3].  Therefore,  the  presence  of  additional  alloying  elements,  such  as titanium,  molybdenum,  nitrogen,  and  niobium  can  influence  these  stainlesssteel  groups.  Two  grades  in  the  same  category  might  show  comparable mechanical strength, for instance, the presence of molybdenum improves the corrosion resistance of one stainless steel type compared to another that does not contain molybdenum [4].\nAustenitic  and  duplex  grades  are  the  most  used  for  structural  purposes. Austenitic  steels  typically  consist  of  a  minimum of  18%  chromium  and 8% nickel.  These varieties  offer  distinct  benefits  for  reinforcing  concrete  due  to their specific metallurgical composition and unique physical characteristics as illustrated by Muwila [5].\nFig. 1 Stainless steel types and their typical chemical compositions\nreinforcement under elevated temperatures, it gives a detailed scenario of post fire,  secondary  phase  precipitation  and  thermal  aging  impact  on  duplex  and austenitic  stainless  steel  reinforcing  bar.    Finally,  Section  4  expresses  the current challenges, conclusion and future expectations.",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "Stainless  steel  is  available  in  a  variety  of  forms,  including  structural components, plates, bars, and sheets. M. Rabi et al. [13] have made significant research  progress  in  recent  years,  as  stainless  steel  rebars  are  becoming increasingly  common  in  load-bearing  constructions  due  to  their  properties. Structural elements subjected to corrosive conditions can benefit from stainless steel reinforcing bars, which minimize the frequency and expense of required maintenance  [13]  and  compared  to  carbon  steel,  its  chloride  ion  corrosion resistance reduces their need for concrete alkalinity and increases their design life  beyond  100  years  and  they  also  reduce  concrete  cover,  deck,  and substructure weight [13].",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "Stainless steels are classified into four types: ferritic, martensitic, austenitic, and  duplex.  This  classification  is  defined  by  the  steel's  microstructure  and allows for an easy examination of the physical and mechanical properties within each group, as explained by Rosso et al. [14]. The characteristics of one group may significantly differ from those of another. Austenitic stainless steels are non-magnetic,  whereas  ferritic  and  duplex  stainless  steels  exhibit  magnetic properties [14]. The following grades of austenitic and duplex reinforcing bars are commonly used, as clarified by Outokumpu [15]: where EN1.4301, 1.4307, and 1.4311 for austenitic, and 1.4362, 1.4462, and 1.4162 for duplex:\n- 1According to M. M. Rabi [16], grade EN 1.4162 is a type of duplex stainless  steel  with  reinforcing  properties.  With  a  reduced  nickel concentration, this material is less expensive while still providing great  corrosion  resistance  and  being  nearly  twice  as  strong  as austenitic stainless steels.\n- 2Gardner  [17]  stated  that  EN  1.4362  is  a  duplex  stainless  steel, sometimes referred to as lean duplex, which has superior corrosion resistance  compared  to  austenitic grades.  The  comparatively  high nickel concentration and optimal metal composition make  it particularly effective against localized corrosion and stress corrosion cracking.\nTable 1\n\nOutlines the chemical composition of commonly utilized grades of stainless-steel reinforcement [22]",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "1.4162, Chemical composition (%)- Upper acceptable %limits for every component.C = 0.04. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.Si = 1.0. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.Mn = 4.0-6.0. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.S = 0.015. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.Cr = 21.0-22.0. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.Ni = 1.35-1.70. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.Mo = 0.10-0.80. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.Cu = 0.10-0.80. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.P = 0.040. 1.4162, Chemical composition (%)- Upper acceptable %limits for every component.N = 0.20-0.25. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.C = 0.03. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.Si = 1.0. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.Mn = 2.0. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.S = 0.015. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.Cr = 21.0-23.0. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.Ni = 4.5-6.5. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.Mo = 2.5-3.5. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.Cu = -. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.P = 0.035. 1.4462, Chemical composition (%)- Upper acceptable %limits for every component.N = 0.10-0.22. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.C = 0.03. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.Si = 1.0. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.Mn = 2.0. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.S = 0.030. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.Cr = 17.5-19.5. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.Ni = 8.5-11.5. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.Mo = -. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.Cu = -. 1.4311, Chemical composition (%)- Upper acceptable %limits for",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "every component.P = 0.045. 1.4311, Chemical composition (%)- Upper acceptable %limits for every component.N = 0.12-0.22. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.C = 0.03. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.Si = 1.0. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.Mn = 2.0. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.S = 0.030. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.Cr = 16.5-18.5. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.Ni = 10.0-13.0. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.Mo = 2.0-2.5. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.Cu = -. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.P = 0.045. 1.4404, Chemical composition (%)- Upper acceptable %limits for every component.N = ≤0.11. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.C = 0.03. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.Si = 1.0. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.Mn = 2.0. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.S = 0.015. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.Cr = 22-24.5. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.Ni = 3.5-5.5. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.Mo = 0.10-0.60. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.Cu = 0.10-0.60. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.P = 0.035. 1.4362, Chemical composition (%)- Upper acceptable %limits for every component.N = 0.05-0.20. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.C = 0.05. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.Si = 1.0. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.Mn = 2.0. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.S = 0.030. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.Cr = 16.5-18.5. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.Ni = 10.5-13.0. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.Mo = 2.5-3.0. 1.4436, Chemical composition (%)- Upper acceptable",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "%limits for every component.Cu = -. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.P = 0.045. 1.4436, Chemical composition (%)- Upper acceptable %limits for every component.N = ≤0.11",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "The mechanical properties of stainless-steel reinforcement bars relate to the physical characteristics that affect their strength, durability, and resistance to external forces. The properties include tensile strength, yield strength, elongation, toughness, and impact resistance. Stainless steel reinforcement bars offer significant tensile strength, allowing them to support loads and withstand deformation [23].",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "Stainless steel reinforcement has excellent mechanical properties, including high  strength  and  stiffness,  as  well  as  exceptional  ductility,  toughness,  and fatigue resistance. However, those properties may differ depending on the grade and production method. Duplex and austenitic stainless steels are  frequently utilized  in  concrete  construction  projects  due  to  their  exceptional  corrosion resistance, and widespread availability as demonstrated by Pardeshi et al. [24] and M. Rabi et al.[25].\nStainless steel grades of this nature generally provide enhanced strength, superior  strain  hardening,  and  greater  ductility  compared  to  carbon  steel reinforcement. Furthermore, they demonstrate a unique constitutive response in comparison to carbon steel [13]. Unlike carbon steel, stainless steel does not display a distinct yield point at  a typical room temperature. The stress-strain relationship is non-linear, exhibiting increased strength and reduced stiffness as demonstrated in Fig.2[25]. The yield strength is often assessed by measuring the 0.2% proof stress ( 𝑓 0.2p ). In contrast, carbon steel exhibits a behavior that is either elastic-plastic or elastic-linear hardening, defined by a distinct yield point and a moderate level of strain hardening [13]. Table 2 presents the mechanical properties of several widely used stainless steel reinforcements, providing the 0.2% proof  strength  (σ0.2),  ultimate  strength  (σ u ),  Young's  modulus  (E),  and ultimate strain (ε u ) as outlined by Medina et al. [26]. The ability of stainless steel to  deform  without  fracture  significantly  improves  its  structural  integrity, allowing  it  to  withstand  substantial  damage  and  distortion  under  loading conditions, such as seismic environments. Investigations conducted by Pardeshi et al. [24], Di Sarno et al. [27], and Xu et al. [28] have demonstrated that this\n- 3Grade EN 1.4462 has better mechanical strength and comparable corrosion resistance to grade EN 1.4362 [13].\n- 4The most used stainless steel in structural applications is grade EN 1.4301, which contains 18% chromium and 8% nickel. This grade is widely  used  in  a  variety  of  applications  due  to  its  exceptional corrosion resistance, as well as its excellent strength, formability, and weldability [13].\n- 5The 1.4311 austenitic stainless steel has high tensile strength and increased  toughness  at  low  temperatures  due  to  its  high  nickel, nitrogen content, and low carbon content [13].\n- 6Grade  EN  1.4307  can  be  substituted  for  grade  1.4301  due  to  its reduced carbon content, which leads to enhanced weldability and increased resistance to intergranular corrosion [13].",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "Stainless steel often contains iron as the primary metal, as well as chromium, nickel,  and  other  alloying  components.  Covert  et  al.  [18]  concluded  that  the chemical composition of stainless steel may vary depending on the exact grade or type. The elemental composition of the stainless-steel alloy primarily affects the mechanical properties and corrosion resistance of each grade for example:\n- ▪ Nickel  promotes  the  production  of  austenite  in  stainless  steel, preventing  corrosion.  Its  presence  enhances  the  alloy's  ductile characteristics and adds to its strength [13].\n- ▪ Chromium is known for its high corrosion resistance because of its self-repairing passive properties. This makes  it an important component in various stainless-steel compositions. According to F.U. Rehman [19], adding chromium increases the alloy's ductility and strength while also increasing the formation of a ferritic phase.\n- ▪ Manganese is a key ingredient in stainless steel manufacture, acting as a deoxidizing agent and improving crack resistance. It enhances the  production  of  a  ferrite  phase  at  higher  temperatures  and  an austenite phase at lower temperatures [19].\n- ▪ At temperatures as high as 500° C, molybdenum has fire-resistant properties and is a useful element for corrosion resistance. Similar to chromium, molybdenum greatly increases ferrite's strength [19].\n- ▪ The addition of nitrogen (N) significantly enhances the mechanical properties of stainless steel, including its strength and ductility, as demonstrated by [20] and Markeset et al. [21].\n- ▪ Stainless steel alloys frequently include additional elements such as phosphorus (P), copper (Cu), carbon (C), silicon (Si), and sulfur (S). Table  1  outlines  the  chemical  composition  of  commonly  utilized grades of stainless-steel reinforcement.\ncharacteristic aids in the redistribution of loads and stresses across the structure.\nFig. 2 An illustrative representation of stress-strain diagrams for Austenitic and Duplex stainless steel, alongside carbon steel. [25]\n\nTable 2 Mechanical properties of Stainless steel and carbon steel reinforcement [26]",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "Gard- ner et al. [29], Grade = 1.4162. Gard- ner et al. [29], Dia mm = 12. Gard- ner et al. [29], σ 0.2 (N/mm 2 ) = 682. Gard- ner et al. [29], σ u (N/mm 2 ) = 874. Gard- ner et al. [29], E (kN/mm 2 ) = 199.1. Gard- ner et al. [29], Ε u (%) = 32.4. , Grade = 1.4162. , Dia mm = 16. , σ 0.2 (N/mm 2 ) = 646. , σ u (N/mm 2 ) = 844. , E (kN/mm 2 ) = 195.2. , Ε u (%) = 32.9. , Grade = 1.4311. , Dia mm = 12. , σ 0.2 (N/mm 2 ) = 480. , σ u (N/mm 2 ) = 764. , E (kN/mm 2 ) = 202.6. , Ε u (%) = 48.3. , Grade = 1.4311. , Dia mm = 16. , σ 0.2 (N/mm 2 ) = 528. , σ u (N/mm 2 ) = 717. , E (kN/mm 2 ) = 199.9. , Ε u (%) = 47.9. , Grade = 1.4307. , Dia mm = 12. , σ 0.2 (N/mm 2 ) = 562. , σ u (N/mm 2 ) = 796. , E (kN/mm 2 ) = 210.2. , Ε u (%) = 39.9. , Grade = 1.4307. , Dia mm = 16. , σ 0.2 (N/mm 2 ) = 537. , σ u (N/mm 2 ) = 751. , E (kN/mm 2 ) = 211.1. , Ε u (%) = 42.4. , Grade = 1.4362. , Dia mm = 16. , σ 0.2 (N/mm 2 ) = 608. , σ u (N/mm 2 ) = 834. , E (kN/mm 2 ) = 171.4. , Ε u (%) = 35.1. M. Rabi et al. [30], Grade = Carbon steel. M. Rabi et al. [30], Dia mm = 10. M. Rabi et al. [30], σ 0.2 (N/mm 2 ) = 525. M. Rabi et al. [30], σ u (N/mm 2 ) = 627. M. Rabi et al. [30], E (kN/mm 2 ) = 196. M. Rabi et al. [30], Ε u (%) = 20.1. , Grade = 1.4301. , Dia mm = 8. , σ 0.2 (N/mm 2 ) = 720. , σ u (N/mm 2 ) = 888. , E (kN/mm 2 ) = 156. , Ε u (%) = 44.6. , Grade = 1.4301. , Dia mm = 10. , σ 0.2 (N/mm 2 ) = 668. , σ u (N/mm 2 ) = 799. , E (kN/mm 2 ) = 148.6. , Ε u (%) = 38.3. , Grade = 1.4301. , Dia mm = 12.",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": ", σ 0.2 (N/mm 2 ) = 670. , σ u (N/mm 2 ) = 795. , E (kN/mm 2 ) = 186.8. , Ε u (%) = 26.7. , Grade = 1.4436. , Dia mm = 8. , σ 0.2 (N/mm 2 ) = 614. , σ u (N/mm 2 ) = 823. , E (kN/mm 2 ) = 178.5. , Ε u (%) = 36.5. , Grade = 1.4436. , Dia mm = 10. , σ 0.2 (N/mm 2 ) = 661. , σ u (N/mm 2 ) = 793. , E (kN/mm 2 ) = 179.3. , Ε u (%) = 25.6. , Grade = 1.4436. , Dia mm = 12. , σ 0.2 (N/mm 2 ) = 645. , σ u (N/mm 2 ) = 803. , E (kN/mm 2 ) = 198.6. , Ε u (%) = 25.3. Q. Li et al. [31], Grade = Carbon steel. Q. Li et al. [31], Dia mm = 12. Q. Li et al. [31], σ 0.2 (N/mm 2 ) = 380. Q. Li et al. [31], σ u (N/mm 2 ) = 530. Q. Li et al. [31], E (kN/mm 2 ) = 230. Q. Li et al. [31], Ε u (%) = 31. , Grade = 1.4462. , Dia mm = 6.5. , σ 0.2 (N/mm 2 ) = 595. , σ u (N/mm 2 ) = 800. , E (kN/mm 2 ) = 141. , Ε u (%) = 32.5. , Grade = 1.4462. , Dia mm = 12. , σ 0.2 (N/mm 2 ) = 660. , σ u (N/mm 2 ) = 830. , E (kN/mm 2 ) = 141. , Ε u (%) = 37.8. , Grade = 1.4462. , Dia mm = 16. , σ 0.2 (N/mm 2 ) = 640. , σ u (N/mm 2 ) = 795. , E (kN/mm 2 ) = 151. , Ε u (%) = 33.9. Q. Li et al. [32], Grade = Carbon steel. Q. Li et al. [32], Dia mm = 16. Q. Li et al. [32], σ 0.2 (N/mm 2 ) = 477. Q. Li et al. [32], σ u (N/mm 2 ) = 654. Q. Li et al. [32], E (kN/mm 2 ) = 202. Q. Li et al. [32], Ε u (%) = 26.8. , Grade = 1.4362. , Dia mm = 12. , σ 0.2 (N/mm 2 ) = 637. , σ u (N/mm 2 ) = 872. , E (kN/mm 2 ) = 156. , Ε u (%) = 33. , Grade = 1.4362. , Dia mm = 16. , σ 0.2 (N/mm 2 ) = 532. , σ u (N/mm 2 ) = 768. , E (kN/mm 2 ) = 156. , Ε u (%)",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "= 36.4. , Grade = 1.4362. , Dia mm = 25. , σ 0.2 (N/mm 2 ) = 543. , σ u (N/mm 2 ) = 761. , E (kN/mm 2 ) = 202. , Ε u (%) = 31.1. , Grade = 1.4362. , Dia mm = 32. , σ 0.2 (N/mm 2 ) = 527. , σ u (N/mm 2 ) = 748. , E (kN/mm 2 ) = 139. , Ε u (%) = 36.9. , Grade = Carbon steel. , Dia mm = 10. , σ 0.2 (N/mm 2 ) = 589. , σ u (N/mm 2 ) = 661. , E (kN/mm 2 ) = 201.4. , Ε u (%) = 12.49. M. Rabi et al. [25], Grade = Carbon steel. M. Rabi et al. [25], Dia mm = 12. M. Rabi et al. [25], σ 0.2 (N/mm 2 ) = 554. M. Rabi et al. [25], σ u (N/mm 2 ) = 635. M. Rabi et al. [25], E (kN/mm 2 ) = 211.8. M. Rabi et al. [25], Ε u (%) = 9.21. , Grade = 1.4301. , Dia mm = 10. , σ 0.2 (N/mm 2 ) = 515. , σ u (N/mm 2 ) = 790. , E (kN/mm 2 ) = 200.9. , Ε u (%) = 32.4. , Grade = 1.4301[grip- rib]. , Dia mm = 12. , σ 0.2 (N/mm 2 ) = 715. , σ u (N/mm 2 ) = 868. , E (kN/mm 2 ) = 184.0. , Ε u (%) = 21.1",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "Rehman et al. [33] recommended to select a Young's modulus in the range of 190-200 kN/mm 2  for various grades of stainless steel. Eurocode 2 specifies that  the  Young's  modulus  of  carbon  steel  is  around  200  kN/mm 2 [34].  The complex constitutive behavior of stainless-steel reinforcement requires further investigation,  particularly  related  to  evaluation  of  reliability  in  future  uses. Recent  academic  literature  indicated  that  a  reduced  value  for  the  Young's modulus  of  stainless-steel  reinforcement  could  be  more  suitable  in  design considerations as concluded by Medina et al. [26], M. Rabi et al. [30], and Rabi et  al.  [13]. The  stress-strain  characteristics  of  carbon  steel  are  precisely represented using a simple bilinear model. The material behavior of stainless steel is characterized by the modified Ramberg-Osgood model, which defines a continuous and nonlinear relationship.  The initial version of this model was introduced in 1943 by Giardina Jr et al. [35] to represent the elastic phase, and to include the inelastic phase which was subsequently revised by Jr et al. [36] and Mirambell et al. [37]. The modified Ramberg-Osgood material model is extensively utilized to characterize the behavior of stainless steel in design and simulation scenarios, with its parameters obtained from Equations 1 and 2.\n<!-- formula-not-decoded -->\n<!-- formula-not-decoded -->\nThe equations contain variables for engineering strain (ε) and stress (σ), including a tangent modulus (E2) at 0.2% proof stress, ultimate stress (σu), its associated  strain  (ε u ),  and  the  strain  at  a  0.2%  increase  in  stress  (ε 0.2 ).  The constants  n  and  m  relate  to  material  hardening  in  response  to  strain.  These parameters are generally obtained from tensile tests, as outlined in Eurocode 3 Part 1-4, which provides recommended values for structural stainless steel and their applicability may differ when used for stainless steel reinforcement.",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "The post-fire scenario regarding stainless steel reinforcing bars involves the properties and condition of these bars after exposure to fire conditions. Gardner et al. [29] determined that the fire intensity, heat exposure, and duration can affect  the  mechanical  properties  of  stainless-steel  reinforcing  bars.  F.  U. Rehman et al. [33] identified that elements such as strength, malleability, and corrosion  resistance  are  crucial  and  assessing  the  condition  of  stainless-steel reinforcing bars post-fire exposure is vital for verifying their structural integrity and functional performance for future uses [33]. Stainless steel reinforcement bars, commonly referred to as rebar, are utilized in construction to enhance the durability of concrete structures.\nStainless steel reinforcement bars exhibit exceptional resistance to corrosion,  heat,  and  oxidation.  This  characteristic  significantly  reduces  the effect of fire on its mechanical properties. A crucial element in creating fireresistant structures is the material's ability to preserve its stiffness and strength even  under  elevated  temperatures.  Badoo  [39]  clarified  that  stainless  steel maintains  considerable  strength  and  stiffness  under  elevated  temperatures. Extensive research has been conducted on the behavior of structural stainless steel in fire conditions, as demonstrated in Table 3. For example, Tao et al. [40] found  that  EN  1.4462,  1.4362,  1.4307,  1.4404,  and  1.4003  stainless  steels, heated from 300 to 1200 ° C for 20 minutes, exhibited negligible influence of thermal conditions on the stress-strain (σ-ε) characteristics at temperatures of 500 ° C or below. However, the strength significantly decreases at temperatures above 600  ° C.  Austenitic  alloys  typically  perform  well,  with  mild  steel  and duplex alloys having similar efficacy. Ferritic alloys, on the other hand, have superior strength when  compared  to  high-strength steels, but they are susceptible to embrittlement at temperatures above 800 ° C.\nGao et al. [41] investigated both EN 1.4401 and 1.4301, which were heated from 200 to 1100 ° C for durations of 30 and 180 minutes. The study concluded that  initial  findings  indicate  a  modest  decline  in  the  post-fire  mechanical characteristics  of  stainless  steels  S30408  and  S31608  when  exposed  to temperatures below 1000 ° C. Furthermore, the modulus of elasticity increases following fire exposure, peaking at a temperature of 800° C, with an approximate rise in the coefficient of 50%. On the other hand, exposure to fire results in a notable reduction in nominal yield strength, with decreases of around 30% for S30408 and 20% for S31608 at temperatures of 1100° C.\nA further investigation conducted by Fan et al. [42] on EN 1.4301 involved heating the material at temperatures ranging from 100 to 900 ° C for durations of  5  and  15  minutes.  The  analysis  revealed  significant  discrepancies  in  the\nstress-strain  curves  of  stainless  steel  at  elevated  temperatures,  specifically between 600 and 800 ° C, when contrasting steady-state and transient testing\n\nTable 3 Notable Results from Prior Research",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "EN 1.4462 1.4362 1.4307 1.4404, heating rate = 20° C/min. EN 1.4462 1.4362 1.4307 1.4404, Target Temperature (° C) &aging time = Heated from 300 to 1200° C for 20 min. EN 1.4462 1.4362 1.4307 1.4404, Cooling mode = Slow cooling in air. EN 1.4462 1.4362 1.4307 1.4404, Findings = Up to 500 ° C, stainless steel exhibits stable stress-strain characteristics; however, above 600 ° C, it begins to deteriorate. At high temperatures, different steel types behave differently in terms of strength and brittleness.. EN 1.4462 1.4362 1.4307 1.4404, Reference = Z.Tao et al. [40 ]. &1.4003 EN 1.4401 &1.4301, heating rate = 20°C/ min. &1.4003 EN 1.4401 &1.4301, Target Temperature (° C) &aging time = Heated from 200 to 1100° C for 30 and 180 min. &1.4003 EN 1.4401 &1.4301, Cooling mode = Rapid quenching in water and gradual ambient air cooling. &1.4003 EN 1.4401 &1.4301, Findings = The research indicated a reduction in the strength of stainless steels S30408 and S31608 at temperatures below 1000° C. Furthermore, exposure to fire led to notable decreases in yield strength, approximately 30% for S30408 and 20% for S31608, at temperatures reaching 1100° C... &1.4003 EN 1.4401 &1.4301, Reference = Gao et al. [41]. EN 1.4301, heating rate = 10 &20°C/ min. EN 1.4301, Target Temperature (° C) &aging time = Heated between 100 and 900° C for 5 and 15 min. EN 1.4301, Cooling mode = n/a. EN 1.4301, Findings = Significant differences in the stress-strain curves of stainless steel were observed at elevated temperatures ranging from 600 to 800 ° C when comparing steady-state and transient testing methods. The variances were lower within the temperature range of 100-500 ° C.. EN 1.4301, Reference = Fan et al. [42]. EN 1.4301, 1.4436, B500B& 1.4401, heating rate = 10°C/ min. EN 1.4301, 1.4436, B500B& 1.4401, Target Temperature (° C) &aging time = Heated from 100 &900° C for 1 hour. EN 1.4301, 1.4436, B500B& 1.4401, Cooling mode = Rapid quenching in water, gradual cooling in ambient air, and within a furnace. EN 1.4301, 1.4436, B500B& 1.4401, Findings = Stainless steel reinforcement bars preserved their mechanical properties after exposure to elevated temperatures, with the cooling rate exerting minimal influence. Notable alterations in behavior were observed at moderate temperature levels.. EN 1.4301, 1.4436, B500B& 1.4401, Reference = F.U. Rehman et al. [33]. EN 1.4301, heating rate = 10°C/ min. EN 1.4301, Target Temperature (° C) &aging time = Heated from 300, 400 to 1000 ° C for 20 min.",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "EN 1.4301, Cooling mode = Gradual air cooling. EN 1.4301, Findings = The material properties of austenitic stainless steel remain stable at elevated temperatures, with notable alterations occurring beyond 600 ° C to 800 ° C.. EN 1.4301, Reference = (A. He et al. [43]. EN 1.4162 &1.4462, heating rate = 20°C/ min. EN 1.4162 &1.4462, Target Temperature (° C) &aging time = Heated from 1 &10 hours heated from 600 to 800 ° C. EN 1.4162 &1.4462, Cooling mode = Slow cooling in the furnace and fast cooling in water. EN 1.4162 &1.4462, Findings = The materials retain their strength and flexibility post-exposure to fire, demonstrating their capacity to withstand high pressures without affecting safety.. EN 1.4162 &1.4462, Reference = Maslak et al. [44]. EN 1.4462, heating rate = n/a. EN 1.4462, Target Temperature (° C) &aging time = For 30 min, heated at 1050° C. EN 1.4462, Cooling mode = Rapid quenching within water, gradual cooling in ambient air, and internal furnace cooling.. EN 1.4462, Findings = The addition of particular components decreased the material's strength; however, high-temperature treatment followed by quenching improved its toughness without causing further phase formation.. EN 1.4462, Reference = Chaudhari et al. [45]. EN 1.4162, heating rate = 20°C/ min. EN 1.4162, Target Temperature (° C) &aging time = For 0,60, 180 mins,heated from 200 till 1000° C. EN 1.4162, Cooling mode = The material is heated in the furnace until 150° C and then cooled to room temperature.. EN 1.4162, Findings = The mechanical properties of lean duplex stainless steel specimens remained stable at elevated temperatures and across different exposure durations.. EN 1.4162, Reference = Y.et al. [46]. EN 1.4406, heating rate = n/a. EN 1.4406, Target Temperature (° C) &aging time = Within the temperature range of 250 to 850° C, uti- lizing increments of 50° C.. EN 1.4406, Cooling mode = Rapid quenching in aqueous solu- tion. EN 1.4406, Findings = The research investigated the influence of temperature and strain rate on the tensile characteristics of nitrogen-alloyed low carbon grade 316L(N) austenitic stainless steel. Increased temperatures led to enhanced ductility and reduced flow stress and work hardening rate due to dynamic recovery phenomena.. EN 1.4406, Reference = Choudhary [47]. EN 1.4372 &1.4404, heating rate = n/a. EN 1.4372 &1.4404, Target Temperature (° C) &aging time = For one hour heated at 1050 ° C. EN 1.4372 &1.4404, Cooling mode = Rapid quenching in aqueous solution. EN 1.4372 &1.4404, Findings = The reduction in heat input enhanced tensile strength and microhardness. The morphology of ferrite was influenced by the level of heat applied, where low heat yielded both skeletal and lathy ferrites, while high heat resulted exclusively to the formation of skeletal ferrite.. EN",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "1.4372 &1.4404, Reference = Tandon et al. [48]. EN 1.4162, 1.4571& 1.4301, heating rate = 40-60° C/ min. EN 1.4162, 1.4571& 1.4301, Target Temperature (° C) &aging time = For 5-10 mins heated at 350, 650 &950° C. EN 1.4162, 1.4571& 1.4301, Cooling mode = Gradual temperature reduction in an atmospheric environment. EN 1.4162, 1.4571& 1.4301, Findings = The research indicated that samples cooled at distinct temperatures exhibited differing impacts on ultimate strengths. Samples cooled at 350 and 650 ° C demonstrated increased strength, whereas those cooled at 950 ° C showed reduced strength. The failure mechanisms in stainless steel connections following fire exposure were similar to those seen in specimens. EN 1.4162, 1.4571& 1.4301, Reference = Cai [49]. EN 1.4462&RS, heating rate = n/a. EN 1.4462&RS, Target Temperature (° C) &aging time = For 30,60,120,180,300 & 10080 min, heated for 500 ° C. EN 1.4462&RS, Cooling mode = Rapid quenching within water. EN 1.4462&RS, Findings = The research indicates that spinodal decomposition enhances the tensile strength while diminishing the ductility of 2205 Duplex Stainless Steel. It also preserves mechanical properties superior to rebar steel at temperatures below 500° C for short durations.. EN 1.4462&RS, Reference = X. Li et al. [ 50]\nmethodologies.  The  observed  variances  were  notably  reduced  within  the temperature range of 100-500 ° C.",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "4.2. Precipitation of secondary phases and thermal aging conditions in stainless steel reinforcement bars\n\nEN 1.4410[LN], 10°C/ min = n/a. EN 1.4410[LN], For 15 mins, heated from 100 till 950 ° C = For 1 hour, heated at 1100,1150 &1200 ° C. EN 1.4410[LN], n/a = Rapid quenching within water. EN 1.4410[LN], The mechanical integrity of SC bimetallic steel can get weakened at elevated temperatures, and current predictive models for car- bon-manganese or stainless steel are considered not sufficient. = Additive manufacturing can produce type 25Cr duplex stainless steel with enhanced mechanical properties, including strength and ductility. This makes it applicable to various applications.. EN 1.4410[LN], Ban et al . [51] = J. He et al. [52]. EN 1.4959, 2.4663, 1.4841, 1.4404& 1.4990, 10°C/ min = 10, 15 &20° C/ min. EN 1.4959, 2.4663, 1.4841, 1.4404& 1.4990, For 15 mins, heated from 100 till 950 ° C = For 30 &180 min,heated between 400 till 700 ° C. EN 1.4959, 2.4663, 1.4841, 1.4404& 1.4990, n/a = n/a. EN 1.4959, 2.4663, 1.4841, 1.4404& 1.4990, The mechanical integrity of SC bimetallic steel can get weakened at elevated temperatures, and current predictive models for car- bon-manganese or stainless steel are considered not sufficient. = The materials demonstrated improved ductility at higher temperatures, correlated with an increase in nickel content.. EN 1.4959, 2.4663, 1.4841, 1.4404& 1.4990, Ban et al . [51] = Calmunger et al. [53]. EN 1.4301, 10°C/ min = 20°C/ min. EN 1.4301, For 15 mins, heated from 100 till 950 ° C = For 30 min heated at 200 &300 ° C, for 800 ° C is heated for 45,90 &135 min. EN 1.4301, n/a = Gradual temperature reduction within a furnace. EN 1.4301, The mechanical integrity of SC bimetallic steel can get weakened at elevated temperatures, and current predictive models for car- bon-manganese or stainless steel are considered not sufficient. = The effect of duration of exposure to high temperatures on the mechanical characteristics of stainless steel after combustion seems limited. Nonetheless, a significant decrease in yield strength is noted for both flat and curved specimens when subjected to temperatures above 500 ° C. When compared to carbon steel, stainless steel exhibits better durability and maintains superior strength after exposure to fire events.. EN 1.4301, Ban et al . [51] = Wang et al. [54]",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "Sathirachinda  [55]  clarified  that  the  emergence  of  secondary  phases  requires  the  development of  supplementary  chemical compounds or structures within a stainless-steel substrate. This may occur as a result of thermal aging or exposure to specific environmental conditions. X. Li et al. [56] concluded that thermal aging may induce secondary phase precipitation in stainless steel reinforcing bars, potentially affecting their mechanical properties and overall performance. J. Li et al. [57] indicated that the existence of secondary phases can induce modifications in the material's microstructure, as illustrated by the formation  of  chromium  carbides.  This  phenomenon  may  reduce  corrosion  resistance and increase brittleness in stainless steel. Moreover, the conditions of thermal aging significantly influence the formation of these secondary phases which are determined by factors such as temperature duration and the metal composition of the alloy as clarified by Byun et al. [58]. Table 4 summarizes the notable results from prior research for the secondary phases precipitations and thermal aging conditions.\nAustenitic stainless steels are made up only of the austenitic phase, whereas duplex steels typically include both austenite and ferrite as their main phases, as illustrated in Fig. 3 which was done by Raha [59].  Li [60] noted that the microstructure of duplex steels typically displays a predominance of a ferritic matrix scattered with austenitic islands, which is due to initial precipitation and higher ferrite content. The ratios of ferrite to austenite significantly affect the corrosion resistance and mechanical properties of duplex Stainless Steels. Chromium, molybdenum, and nitrogen are all known for their important functions in reducing pitting corrosion, with higher concentrations linking to enhanced resistance [60]. Variations in properties arise from differences in chemical composition, which depend on the enrichment of ferrite or austenite with stabilizing elements like chromium and molybdenum for ferrite, and nitrogen (N) for austenite [60]. The temperature used in heat treatment can alter the ratio of ferrite to austenite, as well as its composition as shown in Fig. 4 which was done by Tan et al. [61].\nFig. 3 Microstructure of Duplex stainless steel\nFig. 4 Fractional volume of the ferrite phase after undergoing thermal treatment across different temperatures for a duration of 2 hours\nThermal aging involves exposing stainless steel rebars to high temperatures for an extended duration. H. Y. Huang et al. [62] concluded that prolonged exposure to elevated temperatures can result in additional microstructural alterations, including grain growth and the formation of new phases. Thus, variations in phase ratios and changes from thermal aging due to different heat treatments may lead to modifications in mechanical properties which are influenced by the amount of ferrite phase and its initial morphology at temperatures above 1000° C [63]. Furthermore, the increased concentration of alloying elements leads to the formation  of  various  intermetallic  phases,  nitrides,  and  carbides,  including sigma phase, chi phase, and M23C6, during heat treatment processes conducted at  temperatures  below  1000  ° C  [60].  For  example,  DSS  undergoes  phase changes via spinodal decomposition at temperatures lower than 525° C, with reactions  occurring  more  rapidly  around  475° C.  This  mechanism  enables  the transformation of the initial phase, x, into a chromium-deficient X phase and a chromium-enriched (x') phase, as explained by Chan et al. [64] and Tavares et al. [65] and the following points explain those phases:",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "σ (Sigma) phase: Shamanth et al.[66] found out a precipitate enriched with chromium and molybdenum, exhibits hardness and brittleness, typically forming in the temperature range of 650 to 1000° C. This formation is frequently linked to a decrease in both impact toughness and corrosion resistance. Ferrite has higher mobility and concentrations of molybdenum and chromium than austenite, so the σ -phase precipitates primarily in the ferritic phase. It can also develop in the heat affected zone during welding processes. This substance has a tetragonal crystal structure, with 32 atoms per unit cell and five distinct crystallographic sites for atom placement. The morphological characteristics of the σ -phase change with temperature. At 750° C, it has a structure similar to coral, however, at 950° C, its shape becomes larger and more densely packed.\nThe decrease in Mo content is significantly larger compared to that of Cr, indicating that Mo primarily influences the precipitation of the σ -phase. The σphase develops quickly, requiring a very rapid cooling rate to prevent its development during the quenching process from solutionizing temperatures. For EN 1.4462 duplex stainless steel, it is crucial to maintain a cooling rate of 0.23 Kelvin per second to ensure that the formation of σ -phase remains below 1% [67]. The addition of significant amounts of alloying elements into DSS results in the formation of various carbides, intermetallic compounds, and secondary phases. These constituents precipitate at varying kinetics within specific temperature ranges, as illustrated in Fig. 5[68].\nFig. 5 Isothermal cooling curve for the ternary Fe-Cr-Ni system illustrating the impact of alloying additions on the precipitation of secondary phases during cooling",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "The addition of ferrite with elements that can form intermetallic  compounds during extended thermal exposure around 700° C allows the precipitation of the Chi (χ) phase. It generally begins at the δ/γ interface and extends into the δ matrix, and evaluating its influence on corrosion and toughness is difficult due to the common coexistence with the σ phase. An increase in aging duration leads to a higher concentration of Mo and a decrease of Fe in the χ-phase. During isothermal aging, the precipitation of the χ-phase consistently precedes that of the σ -phase, however, under continuous cooling conditions, the formation of the χ-phase occurs only at decreased cooling rates, as concluded by Redjaï mia [67].\nTable 4\nSummarizes the notable results from prior research for the secondary phases precipitations and thermal aging conditions",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "EN1.4462, Target Temperature (° C) ,aging time &cooling mode = Within the temperature range of 600 to 1000 ° C for a duration of 2600 minutes, followed by rapid quenching in water.. EN1.4462, Findings = The effects of aging temperature on the corrosion resistance of duplex stainless steel were not significant; however, aging at temperatures ranging from 700 to 900° C results in a reduction in pitting corrosion resistance. W-substituted steel showed bet- ter pitting corrosion resistance compared to its Mo-only coun- terpart. EN1.4462, Reference = Ahn et al. [71]. EN 1.4501, Target Temperature (° C) ,aging time &cooling mode = Within the temperature range of 900 to 1100 ° C for a duration of 120 minutes, followed by rapid quenching in water. EN 1.4501, Findings = Sigma phase particles develop at the interfaces of ferrite and austenite grains, with the soaking temperature determining their dissolution and the ferrite-to-austenite ratio. Higher heat treat- ment temperatures increase ferrite content, preventing sigma phase formation above 1060° C for a balanced distribution of approximately 50% each - affecting material hardness inversely with heating temperature.. EN 1.4501, Reference = Martins et al. [72]. EN 1.4662, Target Temperature (° C) ,aging time &cooling mode = Subjected to heating at a temperature of 475° C for durations of 100, 300, 600, 1100, and 2000 hours followed by quenching in water.. EN 1.4662, Findings = After 1100 hours, chromium stabilizes at 5%, decreasing corro- sion resistance and significantly influencing mechanical prop- erties. Low Duplex Stainless Steel 2404 has lower corrosion re- sistance than Duplex Stainless Steel 2205 due to the division of α and αʹ phases during spinodal decomposition.. EN 1.4662, Reference = Silva et al. [73]. EN 1.4462, Target Temperature (° C) ,aging time &cooling mode = The samples were subjected to heating at temperatures of 450° C, 475° C, 800° C, and up to 850° C for durations of 1 hour, 3 hours, and 12 hours followed by quenching in water. EN 1.4462, Findings = Exposure to high temperatures leads to phase precipitation in the ferrite matrix, reducing steel hardness and corrosion re- sistance. Prolonged aging reduced corrosion resistance and in- creased sensitization due to phase precipitates at higher temper- atures.. EN 1.4462, Reference = Dainezi et al. [10]. EN 1.4162, Target Temperature (° C) ,aging time &cooling mode = Subjected to heating at 700 ° C for dura- tions of 3, 10, 30, 120, and 240 minutes followed by rapid quenching in water. EN 1.4162, Findings = After aging lean Duplex Stainless Steel 2101 at 700° C, interme- tallic precipitates with higher chromium concentration formed between the α/γ and α/α boundaries. A secondary phase of aus- tenite with lower chromium content was found near these pre- cipitate regions.. EN 1.4162, Reference = L. Zhang et al. [74]",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "The BCC crystal structure in this phase corresponds with the α phase, consisting of approximately 62-83 % of chromium. Within the temperature range of 300 to 550 ° C, alpha prime mainly develops as the principal precipitation phase due to spinodal decomposition. This phenomenon is commonly referred to as 475 ° C embrittlement, characterized by increased hardness, yield strength, and tensile strength, accompanied by reduced elongation and impact resistance [60]. For more than fifty years, researchers have systematically investigated the phenomenon of spinodal decomposition in stainless steels.",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "A study by Shamanth et al. [66] found that in duplex alloys containing copper, reduced solubility at lower temperatures leads to the super-saturation of ferrite. This condition leads to the precipitation of very fine Cu-rich epsilon (ε) phase particles within the ferrite grains after 100 hours of exposure at 500° C. This significantly  expands  the  lower  temperature  strengthening  range  for  duplex stainless steels. ε-phase is often incorrectly identified as γ2 due to similar formation temperatures.",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "The isothermal treatment of duplex stainless steels at temperatures between 550 and 650° C results in a consistent and finely dispersed distribution of the R-phase within δ grains [67]. The R-phase, characterized by its enrichment in molybdenum, exhibits a trigonal crystal structure and its emergence reduces both the toughness and the critical pitting temperature in duplex stainless steels. Nilsson [69] clarified that R-phase precipitations can occur as either intergranular or intragranular, with the former potentially presenting a higher risk for pitting corrosion due to their capacity to contain up to 40% Mo. The extension of the aging process results in the conversion of R-phase into σ-phase, which is due to the diffusion of Mo from the former phase to the latter. As a result, there is a decrease in the volume fraction of R-phase, as concluded by S. Zhang et al. [70].",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "The G-phase forms at α/α′ interfaces within a temperature range of 300 to 400° C following extended exposure, due to the accumulation of Ni and Si at these particular locations [66]. The π-nitride precipitate, which has a cubic crystal structure  and  is enriched  in  chromium and  molybdenum, appears at intergranular locations within duplex stainless-steel welds after undergoing isothermal treatment at 600° C for a prolonged duration [66]. The η-phase is a precipitate defined by significant faulting and needle-like morphology, formed as a result of heat treatment at temperatures between 550 and 650° C. This phase exhibits an orthorhombic crystal structure [67].",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "EN 1.4462, Subjected to a temperature of 300 ° C for durations of 3,000, 6,000, and 12,000 hours. = Heated from 700 to 1050 ° C for inter- vals of 5, 30, 60, and 120 minutes. EN 1.4462, Variations in Chromium concentration during aging affect the hardness of the ferrite phase and result in a reduction of impact toughness. Aging causes a change in fracture behavior from ductile to cleavage, with crack propagation mainly occurring through the ferrite phase along deformation twin interfaces, while delamination between austenite and ferrite phases be- comes visible. = The alpha phase becomes more noticeable in 2205 Duplex Stainless Steel when the levels of nitrogen and carbon are low. It forms inside or on the edges of ferrite grains. After being aged at 850°C, it's most common. At first, the π-phase is seen, but between 700° C and 750° C, the χ-phase mostly forms because of stronger thermodynamic forces. This was proven with Thermo-Calc software, which also showed that sigma expands more quickly. But ϲ-phase concentrations have a bigger effect on steel's impact toughness than χ-phase concentrations because π-phase does not occur as frequently.. EN 1.4462, Pettersson et al.[75] = Y. L. He et al. [76]. EN 1.4462, Subjected to a temperature of 300 ° C for durations of 3,000, 6,000, and 12,000 hours. = Subjected to heating at a temperature of 850 ° C for durations of 6, 40, and 600 minutes followed by rapid quenching in water. EN 1.4462, Variations in Chromium concentration during aging affect the hardness of the ferrite phase and result in a reduction of impact toughness. Aging causes a change in fracture behavior from ductile to cleavage, with crack propagation mainly occurring through the ferrite phase along deformation twin interfaces, while delamination between austenite and ferrite phases be- comes visible. = The different phases of microstructure development in stainless steel, such as the formation of chromium nitrides and carbides and the evolution of the sigma phase, were examined using a variety of etching techniques. Sigma phase development and embrittlement from the precipitation of chromium carbides and nitrides were caused by aging heat treatments that were per- formed at temperatures higher than 850° C for longer than six minutes. Sigma phase emergence was not detected by the Charpy impact test.. EN 1.4462, Pettersson et al.[75] = Zucato et al. [77]. EN 1.4162, Subjected to a temperature of 300 ° C for durations of 3,000, 6,000, and 12,000 hours. = Heated to a temperature of 750° C for a duration of 3 and subsequently 480 hours, followed by quenching in water.. EN 1.4162, Variations in Chromium concentration during aging affect the hardness of the ferrite phase and result in a reduction of impact toughness. Aging causes a change in fracture behavior from ductile to cleavage, with crack propagation mainly occurring through the ferrite phase along deformation twin interfaces, while delamination between austenite and ferrite phases be- comes visible. = The study on EN 1.4162 lean duplex stainless steel shows that exposure to 750° C for a duration of up to 480 hours leads to the formation of precipitates at the phase boundaries and intersec- tions of ferrite grains. Nitride formation was initially observed, whereas extended",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "durations resulted in σ phase precipitation. The aging process affected mechanical properties, resulting in a decrease in ductility while improving yield strength and ulti- mate tensile strength.. EN 1.4162, Pettersson et al.[75] = Dandekar et al. [78]. EN 1.4462, Subjected to a temperature of 300 ° C for durations of 3,000, 6,000, and 12,000 hours. = Within a temperature spectrum of 450 to 1000 ° C, for a duration of 10 minutes followed by rapid quenching in water.. EN 1.4462, Variations in Chromium concentration during aging affect the hardness of the ferrite phase and result in a reduction of impact toughness. Aging causes a change in fracture behavior from ductile to cleavage, with crack propagation mainly occurring through the ferrite phase along deformation twin interfaces, while delamination between austenite and ferrite phases be- comes visible. = Aging at temperatures ranging from 600 to 950° C results in the formation of new phases, including Cr2N, σ, and χ. The most significant decrease in pitting corrosion resistance and impact energy occurs at 850 ° C. Temperatures reaching 600 ° C leads to a change of the pitting initiation site from austenite to an al- tered ferritic phase because of precipitation incidents.. EN 1.4462, Pettersson et al.[75] = Deng et al. [79]. EN 1.4462, Subjected to a temperature of 300 ° C for durations of 3,000, 6,000, and 12,000 hours. = Subjected to heating at 300 and 400° C for durations of 3,000; 5,000; and 7,000 hours.. EN 1.4462, Variations in Chromium concentration during aging affect the hardness of the ferrite phase and result in a reduction of impact toughness. Aging causes a change in fracture behavior from ductile to cleavage, with crack propagation mainly occurring through the ferrite phase along deformation twin interfaces, while delamination between austenite and ferrite phases be- comes visible. = When heating to 400 º C, the ferrite phase in 2205 DSS steel exhibits an increase in hardness due to the formation of new phases. However, this does not occur when heated up to 300 º C for up to 7000 hours. Furthermore, extended heating at 400 ° C results in increased chromium loss in the material, with no no- ticeable self-repairing occurring despite prolonged exposure.. EN 1.4462, Pettersson et al.[75] = Rovere et al.[80]. EN 1.4410, Subjected to a temperature of 300 ° C for durations of 3,000, 6,000, and 12,000 hours. = Heated at 700-900 ° C for varying dura- tions with rapid water quenching.. EN 1.4410, Variations in Chromium concentration during aging affect the hardness of the ferrite phase and result in a reduction of impact toughness. Aging causes a change in fracture behavior from ductile to cleavage, with crack propagation mainly occurring through the ferrite phase along deformation twin interfaces, while delamination between austenite and ferrite phases be- comes visible. = The aging of the samples led to sigma-phase precipitation in both ferrite and austenite regions, resulting in decreased stabil- ity and resistance to pitting corrosion. Exposure to chloride-con- taining aggressive environments caused localized damage to previously ferritic regions that had transformed due to aging at temperatures above 700 º C for more than 1 hour.. EN 1.4410, Pettersson et al.[75] = Angelini et",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "al. [81]",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    },
    {
        "content": "Both duplex and austenitic stainless steel reinforcement bars have excellent strength and corrosion resistance which making them an ideal option for reinforced concrete structure. However, the absence of standardized practices and recommendations for employing duplex stainless-steel rebar may raise concerns about its effectiveness and long-term durability in concrete constructions. When evaluating duplex grade rebars, it is essential to understand the manufacturing process to avoid the development of highly brittle phases, such as sigma phases, within the microstructure. Additionally, duplex stainless steel rebars exhibit a less stable microstructure in comparison to austenitic rebars, making them more susceptible to changes under similar conditions. Consequently, this paper provides a comprehensive review of research on reinforcing bars made of duplex and  austenitic  stainless  steel  used  in  reinforced  concrete  structures.  Furthermore, it examines the effects of prolonged high-temperature exposure on material characteristics, as well as various cooling methods. Sufficient information has been provided in the current literature to enable engineers to make wellinformed decisions on the structural integrity of duplex and austenitic stainless steel reinforced concrete structures after being exposed to fire. A detailed analysis of various temperature exposure levels was conducted, covering a wide range of potential behaviors to maximize informative value. The examined cooling  methods  were  analyzed  to  replicate  real-world  conditions  that  the  rebar could experience.\nIn conclusion, the engineering research community has recognized the significant benefits that stainless steel reinforced concrete offers to the construction industry, especially when a durable, low-maintenance life cycle is required. In addition, this paper summarized the mechanical behavior of duplex and austenitic reinforcement rebars when subjected to static loads. Potential future investigations could include an assessment of material strength and resistance to fracture, alongside an examination of their behavior during repeated loading cycles.",
        "source": "10.18057/IJASC.20",
        "file_path": ""
    }
]