[
    {
        "content": "The low-temperature embrittlement limits the service temperature of ferritic and duplex stainless steels. The effects of alloying elements added to Fe-Cr binary system on the low-temperature embrittlement have been reviewed critically. Prior literature on the underlying phase transformation, i.e . , phase separation (PS) and changes of mechanical properties, is surveyed. The available literature indicates that the rate of PS is accelerated by Ni or Co in Fe-Cr binary system. The increased kinetics of PS also lead to an enhanced hardening rate during aging for Ni and Co alloyed Fe-Cr alloys. In low Cr ( \\ 17 wt.%) ferritic alloys, the additions of Al or Co can reduce embrittlement because these elements contribute to lowering the driving force for PS. The influence of other alloying elements such as Mo, Cu, Mn, Nb, and Ti is inconclusive but also discussed here. Thermodynamic and kinetic calculations were performed to evaluate current CALPHAD databases and to further investigate the thermodynamic and kinetic reasons for the effect of the additional alloying elements added to Fe-Cr alloy on PS. Some indications were provided for improving physically-based predictions of low-temperature embrittlement as well as opportunities to mitigate the phenomenon by alloying.\nKeywords Fe-Cr-X alloy /C1 Phase separation /C1 Thermodynamics /C1 Kinetics /C1 Mechanics /C1 Embrittlement\nStainless steel",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The niche material group stainless steel is known for its corrosion resistance and range of mechanical properties that depend on its diverse microstructures [1, 2]. They are traditionally classified into four categories based on their microstructure: ferritic (body-centered cubic, bcc), austenitic (face-centered cubic, fcc), martensitic (body-centered cubic/body-centered tetragonal, bcc/bct) and duplex\n& Jian-ling Liu jianling.liu@csu.edu.cn\n- & Peter Hedstro ¨m pheds@kth.se\n- 1 State Key Laboratory of Powder Metallurgy, Central South University, Changsha 410083, Hunan, China\n- 2 Department of Materials Science and Engineering, KTH Royal Institute of Technology, Stockholm 10044, Sweden\n- 3 Engineering Materials, Department of Engineering Science and Mathematics, Lulea ˚ University of Technology, Lulea ˚ 97187, Sweden\n/C1\n(bcc ? fcc) stainless steels [2]. Precipitation-hardening (PH) stainless steel is the fifth category making use of precipitation strengthening [3]. One issue limiting the use of bcc/bct phase containing stainless steel (martensitic, ferritic or duplex steels) is low-temperature embrittlement or ''475 /C176 C embrittlement'' [4, 5], which was first observed in 1941 by Reidrich and Loib [6]. As an example, this phenomenon limits the service temperature of duplex stainless steels (DSSs), which are strategically important in e.g., offshore, nuclear and paper and pulp industry, to about 250 /C14 C [7]. A serious decrease of toughness occurs above this temperature which can induce premature fracture in load-bearing applications [1]. The low-temperature embrittlement is encountered in alloys containing 15-75 at.% Cr, and the underlying mechanism is phase separation (PS) occurring in bcc/bct phase, which decomposes into highly coherent regions rich in Cr ( a 0 ) or Fe ( a ) [8]. The PS occurs during holding at elevated temperatures inside the miscibility gap where there is a tendency for Fe and Cr to separate. PS also causes hardness to increase and corrosion resistance to decrease [2, 7, 9]. It should also be\n(0123456789().,-volV\n(0123456789().,-volV\nnoted, that PS is not only important in Fe-Cr based alloys, but also in some alloys, e.g., Al-Ag [10], Al-Zn [11], AuNi [12], Au-Pt [13], (Ti, Zr)C [14, 15], (Ti, Al)N [16] and high-entropy alloys [17].",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Significant efforts have been devoted to the investigation of low-temperature embrittlement in Fe-Cr alloys [18-21], and, the effect of alloying elements [19-21], processing route [22-25] and external field [26-29] on kinetics of PS has been studied. These efforts have been reviewed, e.g. a comprehensive review of the Fe-Cr binary system was presented in Ref. [30], a review of mechanical property evolution at low temperatures in DSSs in Ref. [31], and a summary of atom probe studies of PS in ternary systems (Fe-Cr-Ni/Al/Co) was reported in Ref. [32]. However, there is no recent comprehensive review of the state of knowledge regarding the underlying thermodynamics, kinetics, and mechanics governing low-temperature embrittlement in Fe-Cr-X ternary alloys. Since it is important to have a fundamental understanding of the influence of various parameters to be able to design the next generation of stainless steel more resilient to lowtemperature embrittlement, we survey the effect of adding an additional element to Fe-Cr system here, i.e., the available literature for Fe-Cr-X ternary systems is reviewed. We aim to critically evaluate the effect of individual alloying elements on PS and low-temperature embrittlement. The assessment of the governing factors of PS also includes calculations of thermodynamic and kinetic parameters to support the interpretation of the experimental literature and to assess the accuracy of current CALPHAD (CALculation of PHAse Diagram) databases. It should finally also be noted that other mechanisms than PS could cause embrittlement of multicomponent stainless steels; for example, interstitial element segregation [20], substitutional solute clustering [33-35] and G-phase formation [36, 37] have also been reported to occur in this temperature range, but still, the main mechanism behind embrittlement in this temperature range is generally accepted to be PS.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The de-mixing of Fe and Cr atoms, i.e., phase separation that occurs in Fe-Cr alloys during low- or intermediatetemperature aging is due to the immiscibility of Fe and Cr at temperatures below * 580 /C14 C in the binary Fe0.5 Cr0.5 system. The miscibility gap (MG) for Fe-Cr system calculated by Thermo-Calc using the Steels/Fe-alloys Database (version 9.0)-TCFE9 [38] is presented in Fig. 1a.\nHowever, it should be noted that recent research [23, 39-41] shows that the critical temperature of MG should be lower than that predicted by the calculations using the CALPHAD description adopted in TCFE9 [42] and much lower than the thermodynamic description in Ref. [43]. From thermodynamics, it follows that PS occurs when the Gibbs energy ( G ) of the system is lowered by the process ( G \\ 0) and the sign of the second derivative of the molar Gibbs energy ( G m) distinguishes regions where PS occurs by either spinodal decomposition (SD) (d 2 G m = d X 2 \\ 0, X is the composition of solute) and nucleation and growth (NG) (d 2 G m = d X 2 [ 0). The inflection points where d 2 G m = d X 2 ¼ 0 are defined as the chemical spinodal line [44]. Thermal fluctuations are sufficient to initiate SD, which occurs through the build-up of sinusoidal compositional wave functions in the material, whereas nucleation of nuclei with a composition different from the matrix initiates PS through NG. The progress of PS occurs either through down-hill diffusion (NG) or uphill diffusion (SD), as shown in Fig. 1b. As described above, NG is governed by both nucleation and subsequent diffusional growth and coarsening, whereas SD is purely diffusion-controlled.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Phase separation in Fe-Cr alloys has been investigated for decades. Early investigations by Becket [46] and Reidrich and Loib [6] on embrittlement of Fe-Cr alloys showed an increase in hardness together with a decrease in impact toughness when aged at about 475 /C14 C. Motivated by these results, Fisher et al. [47] first proposed that the decomposition of ferrite was responsible for ' '475 /C176 C embrittlement''. They investigated the age hardening behaviour and characteristics of the precipitates in the Fe-(14-28) wt.% Cr alloys aged at 475 /C14 C for up to 4 years by X-ray diffraction (XRD). bcc precipitates were found in the ferrite matrix, the lattice parameter of which was between that of pure a -Fe (2.866 A ˚ ) and pure Cr (2.885 A ˚ ). Moreover, the Cr content of the precipitate could reach 82 wt.% [47]. Thereafter, further studies on the PS mechanism and Fe-Cr binary phase diagram were performed. Williams and Paxton [48] and Williams [49] proposed that it is the a 0 that causes embrittlement and they were the first to plot MG in the Fe-Cr binary system, indicating the immiscibility range for Fe and Cr. Afterwards, the theory of SD was developed by Hillert [50, 51], Cahn and Hilliard [52] and Cahn [44], which was regarded as a new type of PS mechanism in addition to NG. Since then, extensive experimental and computational works have contributed to the understanding and prediction of PS in Fe-Cr alloys [40-43, 53-56]. FeCr system has drawn significant attention from researchers\nFig. 1 Fe-Cr bcc miscibility gap, chemical spinodal, as calculated by TCFE9 database ( a ) [38] and schematic illustration of two mechanisms of phase separation from Ref. [45] ( b )\nowing to the applications of Fe-Cr in stainless steels [31], and also due to its suitability as a model system with energy, e.g., minimal strain energy and PS occurring in an accessible temperature range. It can be noted that even though the literature on binary Fe-Cr is vast, even basic information, such as the critical temperature of MG, is still discussed [22, 23, 30, 39-41].",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The challenges in modelling and characterization of PS in Fe-Cr have hampered theoretical and technical understanding of the system to some extent. For instance, the Cahn-Hilliard (CH) model [52] that has frequently been used to simulate the system is limited to the treatment of SD, which may not be the active mechanism in technically relevant alloys, e.g., decomposition in maraging 15-5 PH stainless steel should be NG. These mean-field and computational studies are complemented by kinetic MonteCarlo simulations, and over the last decade, ab initio calculations coupled with the CALPHAD method [26, 37, 52] have assisted the improvement of thermodynamic descriptions. On the experimental side, characterization of the nanoscale concentration fluctuation during the initial stage of PS is challenging due to the very fine scale and minor compositional variations between a and a 0 in the early stage of PS. The refinement of characterization methods over the years means that a number of methods have been and can be used to characterize the decomposition, for example, Mo ¨ssbauer spectroscopy (MS) [57-60], transmission electron microscopy (TEM) [61-64], atom probe field-ion microscopy (APFIM) [32, 65-67], atom probe tomography (APT) [28, 33, 68-76], and small-angle neutron scattering (SANS) [8, 22-24, 27, 74, 77-82]. There are pros and cons with the methods, e.g., SANS, APT, and TEM, for characterization of PS in Fe-Cr system, which are compared in Ref. [83].",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The effect of Ni on ' '475 /C14 C embrittlement'' was first discussed by Bandel and Tofaute [84]. Thereafter, TEM [85, 86] and APT [86-90] studies have been performed to investigate PS in Fe-Cr-Ni alloys. Table 1 summarizes the previous work focusing on the effects of aging conditions, i.e., temperature and time, and alloy composition in Fe-CrNi ternary alloys.\nThe most obvious effect found in the literature is that Ni accelerates the kinetics of PS in Fe-Cr alloys [87-90, 92, 93]. This accelerating effect could be observed in the micro-hardness tests presented by Ishikawa et al. [88], as shown in Fig. 2a. After aging at 450 /C14 C, an Fe28Cr-5Ni alloy showed a higher hardness increase than an Fe-28Cr alloy; however, it dropped to be lower than the hardness of Fe-28Cr alloy after aging of 10,000 h. This indicates that PS of Fe-28Cr alloy is accelerated by 5% Ni addition. In Fig. 2a, however, the accelerating effect is less clear when comparing additional works on the hardness change ( D HV) of Fe-Cr-Ni model alloys by Trindade and Vilar [92]. Fe-20Cr-3Ni alloy (aging at 450 /C14 C) in Hedstro ¨m et al. [90] showed an apparent higher hardening rate until 100 h of aging than the non-Ni containing alloy, as shown in Fig. 2a. Moreover, the data from Miller and Russell [89] is also included in Fig. 2b. From the plot, the hardness changes at 20, 100, 500 and 2000 h, are calculated to be around 169, 203, 240 and 232 HV, respectively. Although the hardness increase is accelerated from 20 to 500 h, the lack of hardness data for Fe-45Cr-5Ni alloy\n\nTable 1 Summary of previous experimental studies on PS in Fe-Cr-Ni system",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Nakano et al. [91], 1978, Solutioning history.T / /C176 C = 1250. Nakano et al. [91], 1978, Solutioning history.Time/h = 4. Nakano et al. [91], 1978, Composition/wt.%.Composition/wt.% = Fe-26Cr- x Ni ( x = 0, 0.5, 1, 2, 4, 6). Nakano et al. [91], 1978, Aging history.T / /C176 C = 400-700. Nakano et al. [91], 1978, Aging history.Time = 0-1000 h. Nakano et al. [91], 1978, Method.Method = Tensile, HV20, Charpy V. Nakano et al. [91], 1978, Comment.Comment = Ni promotes PS and increases toughness. Solomon and Levinson [85], 1978, Solutioning history.T / /C176 C = 1150. Solomon and Levinson [85], 1978, Solutioning history.Time/h = 2. Solomon and Levinson [85], 1978, Composition/wt.%.Composition/wt.% = Fe-28Cr, Fe-28Cr-5Ni. Solomon and Levinson [85], 1978, Aging history.T / /C176 C = 475. Solomon and Levinson [85], 1978, Aging history.Time = 0 h, 118 h, 575 h. Solomon and Levinson [85], 1978, Method.Method = MS, TEM. Solomon and Levinson [85], 1978, Comment.Comment = Ni promotes formation of a 0 and SD. Kuwano et al. [58], 1992, Solutioning history.T / /C176 C = 1200. Kuwano et al. [58], 1992, Solutioning history.Time/h = . Kuwano et al. [58], 1992, Composition/wt.%.Composition/wt.% = Fe-28Cr, Fe-28Cr-5Ni. Kuwano et al. [58], 1992, Aging history.T / /C176 C = 475. Kuwano et al. [58], 1992, Aging history.Time = 0-10 min. Kuwano et al. [58], 1992, Method.Method = MS. Kuwano et al. [58], 1992, Comment.Comment = Ni widens MG. Brown and Smith [87], 1991, Solutioning history.T / /C176 C = 1250. Brown and Smith [87], 1991, Solutioning history.Time/h = . Brown and Smith [87], 1991, Composition/wt.%.Composition/wt.% = Fe-26Cr- x Ni ( x = 3,5). Brown and Smith [87], 1991, Aging history.T / /C176 C = 300, 400, 450. Brown and Smith [87], 1991, Aging history.Time = 100, 1000, 5000 h. Brown and Smith [87], 1991, Method.Method = APFIM, HV30. Brown and Smith [87], 1991, Comment.Comment = Ni increases rate of PS in early stage; Ni decreases final amplitude of SD. Trindale and Vilar [92], 1991, Solutioning history.T / /C176 C = 1100. Trindale and Vilar [92], 1991, Solutioning history.Time/h = . Trindale and Vilar [92], 1991, Composition/wt.%.Composition/wt.% = Fe-25Cr-",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "x Ni ( x = 0, 2, 4), Fe-45Cr- x Ni ( x = 0, 2, 4). Trindale and Vilar [92], 1991, Aging history.T / /C176 C = 475. Trindale and Vilar [92], 1991, Aging history.Time = 500 h. Trindale and Vilar [92], 1991, Method.Method = MS, HV0.05. Trindale and Vilar [92], 1991, Comment.Comment = Ni accelerates PS and increases hardness. Ishikawa et al. [88], 1995, Solutioning history.T / /C176 C = . Ishikawa et al. [88], 1995, Solutioning history.Time/h = . Ishikawa et al. [88], 1995, Composition/wt.%.Composition/wt.% = Fe-28Cr, Fe-28Cr-5Ni. Ishikawa et al. [88], 1995, Aging history.T / /C176 C = 400-475. Ishikawa et al. [88], 1995, Aging history.Time = 5000 h. Ishikawa et al. [88], 1995, Method.Method = HV, APFIM, MS. Ishikawa et al. [88], 1995, Comment.Comment = Ni promotes SD by decreasing activation energy for PS. Miller et al. [86], 1996, Solutioning history.T / /C176 C = 1000. Miller et al. [86], 1996, Solutioning history.Time/h = 2. Miller et al. [86], 1996, Composition/wt.%.Composition/wt.% = Fe-45Cr-5Ni. Miller et al. [86], 1996, Aging history.T / /C176 C = 400 500. Miller et al. [86], 1996, Aging history.Time = 4750 h 500 h. Miller et al. [86], 1996, Method.Method = TEM, APFIM. Miller et al. [86], 1996, Comment.Comment = Ni raises critical temperature of MG and skews it to a higher Cr concentration. Miller et al. [86], 1996, Solutioning history.T / /C176 C = . Miller et al. [86], 1996, Solutioning history.Time/h = . Miller et al. [86], 1996, Composition/wt.%.Composition/wt.% = . Miller et al. [86], 1996, Aging history.T / /C176 C = 550. Miller et al. [86], 1996, Aging history.Time = 192 h. Miller et al. [86], 1996, Method.Method = . Miller et al. [86], 1996, Comment.Comment = . Miller et al. [86], 1996, Solutioning history.T / /C176 C = . Miller et al. [86], 1996, Solutioning history.Time/h = . Miller et al. [86], 1996, Composition/wt.%.Composition/wt.% = . Miller et al. [86], 1996, Aging history.T / /C176 C = 575. Miller et al. [86], 1996, Aging history.Time = 24 h. Miller et al. [86], 1996, Method.Method = . Miller et al. [86], 1996, Comment.Comment = . Miller et al. [86], 1996, Solutioning history.T / /C176 C = . Miller et al. [86], 1996, Solutioning",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "history.Time/h = . Miller et al. [86], 1996, Composition/wt.%.Composition/wt.% = . Miller et al. [86], 1996, Aging history.T / /C176 C = 600. Miller et al. [86], 1996, Aging history.Time = 192 h. Miller et al. [86], 1996, Method.Method = . Miller et al. [86], 1996, Comment.Comment = . Miller et al. [86], 1996, Solutioning history.T / /C176 C = . Miller et al. [86], 1996, Solutioning history.Time/h = . Miller et al. [86], 1996, Composition/wt.%.Composition/wt.% = . Miller et al. [86], 1996, Aging history.T / /C176 C = 650. Miller et al. [86], 1996, Aging history.Time = 192 h. Miller et al. [86], 1996, Method.Method = . Miller et al. [86], 1996, Comment.Comment = . Miller and Russell [89], 1996, Solutioning history.T / /C176 C = 1000. Miller and Russell [89], 1996, Solutioning history.Time/h = 2. Miller and Russell [89], 1996, Composition/wt.%.Composition/wt.% = Fe-45Cr, Fe-45Cr-5Ni, Fe-28Cr-5Ni. Miller and Russell [89], 1996, Aging history.T / /C176 C = 400. Miller and Russell [89], 1996, Aging history.Time = 5000 h. Miller and Russell [89], 1996, Method.Method = HV, APFIM. Miller and Russell [89], 1996, Comment.Comment = Ni increases hardness and rate of SD. Hedstro ¨m et al. [90], 2013, Solutioning history.T / /C176 C = 710. Hedstro ¨m et al. [90], 2013, Solutioning history.Time/h = 72. Hedstro ¨m et al. [90], 2013, Composition/wt.%.Composition/wt.% = Fe-20Cr, Fe-20Cr-3Ni. Hedstro ¨m et al. [90], 2013, Aging history.T / /C176 C = 450, 500. Hedstro ¨m et al. [90], 2013, Aging history.Time = 1-2000 h. Hedstro ¨m et al. [90], 2013, Method.Method = HV0.1, Charpy V, SEM, APT. Hedstro ¨m et al. [90], 2013, Comment.Comment = Ni accelerates PS and increases hardness; Ni increases toughness. Li et al. [93], 2015, Solutioning history.T / /C176 C = 1100. Li et al. [93], 2015, Solutioning history.Time/h = 20. Li et al. [93], 2015, Composition/wt.%.Composition/wt.% = Fe-20Cr, Fe-20Cr-5Ni. Li et al. [93], 2015, Aging history.T / /C176 C = 400. Li et al. [93], 2015, Aging history.Time = 3000 h. Li et al. [93], 2015, Method.Method = Nano-indentation, Charpy V, SEM, EBSD. Li et al. [93], 2015, Comment.Comment = Ni changes microstructure, mechanical properties",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "and thermal aging behaviours\nFig. 2 Effect of Ni addition on hardness change [88, 90, 92] ( a ) and hardness evolution [89] ( b ) in Fe-Cr alloys during aging\nafter 1 and 10,000 h aging prevents a careful analysis of the change of hardening rate due to 5 wt.% Ni addition to Fe-45Cr. Though the effect of Ni on the hardness evolution is not clear, the acceleration of PS by the addition of Ni has been determined conclusively by MS [88, 92] and APT in multicomponent alloys [87-90]. Ishikawa et al. [88] performed MS measurements on Fe-28Cr and Fe-28Cr-5Ni alloys. By studying the hyperfine field to estimate the aging time ( t ) required for attaining a certain degree of decomposition, they determined the activation energy ( Q ) by fitting Eq. (1) [94]: /C18 /C19 /C18 /C19\n<!-- formula-not-decoded -->\nwhere R is Boltzman's constant, 1.380649 9 10 -23 J K -1 ; T is the temperature, K; and A is a constant. Q for PS in Fe-28Cr and Fe-28Cr-5Ni was found to be 220 /C6 10 kJ/mol and 177 /C6 3 kJ/mol, respectively [88]. The lowered activation energy was used to explain the accelerating effect of Ni in [24], whereas Brown and Smith [87] reported that Ni addition affects the pre-exponential term ( D 0) in the expression for the Arrhenius kinetics (Eq. (2)) instead of Q .\n/C18\n/C19\n<!-- formula-not-decoded -->\nwhere D Cr is the diffusivity of Cr, m 2 /s. However, Brown and Smith [87] used hardness measurements to evaluate the activation energy and this most likely gives a larger uncertainty in the evaluation as compared to MS measurements.\nSome further mechanical test data of Fe-Cr-Ni alloys in aged conditions are presented in Fig. 3. In Fig. 3a, it supports the view that Ni increases hardness after aging, despite their different solution treatment histories (Table 1)\n[87, 89-93]. Meanwhile, the toughness [90, 93] of Fe-Cr alloys has been observed to increase with higher Ni content (Fig. 3b). Ni addition was found to retard the decrease the impact toughness as compared to Fe-Cr binary alloys. Combined with SEM observations of the fracture surface [90, 93], those Fe-Cr-Ni alloys show a more ductile fracture behaviour and it is believed that Ni addition increases the toughness and decreases the ductile to brittle transition temperature (DBTT) with about 10 /C14 C for each 1 wt.% Ni [90, 95]. This would render Ni-containing alloys less susceptible to low-temperature embrittlement, though they suffer from more severe PS.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "There are some previous reports discussing the effect of Al in Fe-Cr based alloys, including ternary Fe-Cr-Al alloys regarding ''475 /C14 C embrittlement''. Danoix and Auger [32] presented a brief summary on APT investigations of FeCr-Al. Table 2 collects the experimental work on PS in Fe-Cr-Al system.\nLagneborg [96] was the first to point out that Al could be beneficial to mitigate the embrittlement of Fe-Cr based alloys. He claimed in his patent that 0.5-4 wt.% Al and/or Co addition to ferritic steel with 15-17.5 wt.% Cr content can delay or completely prevent the deleterious ''475 /C14 C embrittlement''. Al-added samples showed a ductile fracture with a considerable plasticity even after aging at 475 /C14 C for 1000 h. A contrasting effect of Al on the hardness of Fe-Cr based alloys has been observed by Nana and Cortie [98]. After aging at 475 /C14 C for 168 h, the hardness of Fe-29Cr-4Mo-1.5Ni based alloys (Fig. 4a) was found to increase with increasing Al content up to about 2 wt.%, subsequently the hardness decreased when the Al contents increased to 5 wt.%. This effect was found\nFig. 3 Effect of Ni addition to Fe-Cr alloys on hardness after aging at 450 /C176 C for 100 h [87, 90-92] ( a ) and Charpy impact energy after aging at 500 /C176 C for up to 100 h [90] ( b )\n\nTable 2 Summary of experimental studies on PS in Fe-Cr-Al system",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Lagneborg [96], 1970, Solutioning history.T / /C176 C = . Lagneborg [96], 1970, Solutioning history.Time = . Lagneborg [96], 1970, Composition/wt.%.Composition/wt.% = Fe-(15-17.5)Cr- (0.5-4)Al. Lagneborg [96], 1970, Aging history.T / /C176 C = 440-500. Lagneborg [96], 1970, Aging history.Time/h = 1000. Lagneborg [96], 1970, Method.Method = Tensile test. Lagneborg [96], 1970, Comment.Comment = Small addition of Al ( \\ 4 wt.%) prevents embrittlement at 400-550 /C176 C. Spear and Polonis [97], 1994, Solutioning history.T / /C176 C = 1100. Spear and Polonis [97], 1994, Solutioning history.Time = 15 min. Spear and Polonis [97], 1994, Composition/wt.%.Composition/wt.% = Fe-18Cr-(0,3,5)Al. Spear and Polonis [97], 1994, Aging history.T / /C176 C = 400-575. Spear and Polonis [97], 1994, Aging history.Time/h = 1000. Spear and Polonis [97], 1994, Method.Method = TEM. Spear and Polonis [97], 1994, Comment.Comment = Al addition shifts MG. Nana and Cortie [98], 1996, Solutioning history.T / /C176 C = 1050. Nana and Cortie [98], 1996, Solutioning history.Time = 45 min. Nana and Cortie [98], 1996, Composition/wt.%.Composition/wt.% = Fe-29Cr-4Mo- 1.5Ni-(2-3)Al. Nana and Cortie [98], 1996, Aging history.T / /C176 C = 400-950. Nana and Cortie [98], 1996, Aging history.Time/h = 51, 168. Nana and Cortie [98], 1996, Method.Method = HV15. Nana and Cortie [98], 1996, Comment.Comment = 2-3 wt.% Al addition increases hardness; more than 3 wt.% of Al addition decreases hardness. Kobayashi and Takasugi [99], 2010, Solutioning history.T / /C176 C = 1200. Kobayashi and Takasugi [99], 2010, Solutioning history.Time = 20 h. Kobayashi and Takasugi [99], 2010, Composition/wt.%.Composition/wt.% = Fe-(10-30)Cr- (0-10)Al. Kobayashi and Takasugi [99], 2010, Aging history.T / /C176 C = 475. Kobayashi and Takasugi [99], 2010, Aging history.Time/h = 1000. Kobayashi and Takasugi [99], 2010, Method.Method = HV0.05, TEM. Kobayashi and Takasugi [99], 2010, Comment.Comment = A large amounts of Al ( [ 2 wt.%) suppress 475 /C176 C embrittlement, while a small amount of Al promotes it. Read and Murakami [100], 1996, Solutioning history.T / /C176 C = 1300. Read and Murakami [100], 1996, Solutioning history.Time =",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "24 h. Read and Murakami [100], 1996, Composition/wt.%.Composition/wt.% = MA956 (Fe-20Cr- 4.5Al-0.5Ti- 0.5Y 2 O 3 -0.01C). Read and Murakami [100], 1996, Aging history.T / /C176 C = 475. Read and Murakami [100], 1996, Aging history.Time/h = 1-588. Read and Murakami [100], 1996, Method.Method = HV20, APFIM. Read and Murakami [100], 1996, Comment.Comment = No Al partitions to a after 588 h. Read et al. [101], 1997, Solutioning history.T / /C176 C = . Read et al. [101], 1997, Solutioning history.Time = . Read et al. [101], 1997, Composition/wt.%.Composition/wt.% = . Read et al. [101], 1997, Aging history.T / /C176 C = . Read et al. [101], 1997, Aging history.Time/h = 1-2900. Read et al. [101], 1997, Method.Method = . Read et al. [101], 1997, Comment.Comment = Al was observed to partition to Fe-rich phase after 2900 h. Capdevila et al. [102], 2007, Solutioning history.T / /C176 C = 1360. Capdevila et al. [102], 2007, Solutioning history.Time = 3 h. Capdevila et al. [102], 2007, Composition/wt.%.Composition/wt.% = PM2000 TM (Fe- 18.6Cr-5.2Al- 0.54Ti-0.39Y- 0.04C). Capdevila et al. [102], 2007, Aging history.T / /C176 C = 435, 475. Capdevila et al. [102], 2007, Aging history.Time/h = 10-3600. Capdevila et al. [102], 2007, Method.Method = APT. Capdevila et al. [102], 2007, Comment.Comment = Al partitions to a and occurs more rapidly at 475 /C176 C aging than 435 /C176 C. Capdevila et al. [103], 2008, Solutioning history.T / /C176 C = 1360. Capdevila et al. [103], 2008, Solutioning history.Time = 3 h. Capdevila et al. [103], 2008, Composition/wt.%.Composition/wt.% = PM2000 TM (Fe- 18.6Cr-5.2Al- 0.54Ti-0.39Y- 0.04C). Capdevila et al. [103], 2008, Aging history.T / /C176 C = 435, 475. Capdevila et al. [103], 2008, Aging history.Time/h = 2-3600. Capdevila et al. [103], 2008, Method.Method = HV1, SEM, TEM, APT. Capdevila et al. [103], 2008, Comment.Comment = Al partitions to a. Capdevila et al. [104], 2010, Solutioning history.T / /C176 C = 1100. Capdevila et al. [104], 2010, Solutioning history.Time = 100 h. Capdevila et al.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "[104], 2010, Composition/wt.%.Composition/wt.% = PM2000 TM (Fe- 18.6Cr-5.2Al- 0.54Ti-0.39Y- 0.04C). Capdevila et al. [104], 2010, Aging history.T / /C176 C = 475. Capdevila et al. [104], 2010, Aging history.Time/h = 0-3600. Capdevila et al. [104], 2010, Method.Method = HV1, tensile test, SEM, APT. Capdevila et al. [104], 2010, Comment.Comment = Al partitioning starts during early stages of a - a 0 PS. Al is rejected from a 0. Capdevila et al. [105], 2011, Solutioning history.T / /C176 C = . Capdevila et al. [105], 2011, Solutioning history.Time = . Capdevila et al. [105], 2011, Composition/wt.%.Composition/wt.% = PM2000 TM (Fe- 18.6Cr-5.2Al- 0.54Ti-0.39Y- 0.04C). Capdevila et al. [105], 2011, Aging history.T / /C176 C = 475. Capdevila et al. [105], 2011, Aging history.Time/h = 0-3600. Capdevila et al. [105], 2011, Method.Method = HV, APT. Capdevila et al. [105], 2011, Comment.Comment = Al partitions to a ; partitioning factor increases with aging time. Capdevila et al. [106], 2012, Solutioning history.T / /C176 C = 1360. Capdevila et al. [106], 2012, Solutioning history.Time = 3 h. Capdevila et al. [106], 2012, Composition/wt.%.Composition/wt.% = PM2000 TM (Fe- 18.6Cr-5.2Al- 0.54Ti-0.39Y- 0.04C). Capdevila et al. [106], 2012, Aging history.T / /C176 C = 400, 435, 475. Capdevila et al. [106], 2012, Aging history.Time/h = 10,000. Capdevila et al. [106], 2012, Method.Method = APT, TEM. Capdevila et al. [106], 2012, Comment.Comment = Al partitions to a . Concentration amplitude of a 0 increases with aging time. Ejenstam et al. [107], 2015, Solutioning history.T / /C176 C = 1100. Ejenstam et al. [107], 2015, Solutioning history.Time = 5 min. Ejenstam et al. [107], 2015, Composition/wt.%.Composition/wt.% = Fe-10Cr-(4, 8)Al. Ejenstam et al. [107], 2015, Aging history.T / /C176 C = 450, 500, 550. Ejenstam et al. [107], 2015, Aging history.Time/h = 10,000. Ejenstam et al. [107], 2015, Method.Method = HV0.5, SEM, APT. Ejenstam et al. [107], 2015, Comment.Comment = These alloys are stable during aging, which should be outside MG",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "regardless of the aging temperature and it became pronounced at high temperatures, where the hardening rates were higher. Another study was presented by Kobayashi and Takasugi [99], where they measured micro-hardness before and after aging at 475 /C14 C for 1000 h. They found a similar trend of hardness change as Nana and Cortie [98] in their Fe-Cr-Al system, as shown in Fig. 4b. They observed that for all Cr contents, a small addition ( \\ 2 wt.%) of Al promoted the hardening, and, with further addition of Al, hardening, decreased again.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The Fe-Cr-Co ternary alloys have been frequently studied since they have interesting magnetic properties, including high Curie temperature and coercive force combined with corrosion resistance, ductility, and toughness [108]. An attempt to study the Fe-Cr-Co ternary phase diagram was first performed in Ref. [100], and then Ko ¨ster and Hofmann [109] presented the isothermal sections of the phase diagrams. Since they did not consider the existence of a MG in\nFig. 4 Effect of Al addition on hardness change with different temperatures aging for 168 h ( a ) [98] and with Cr contents aged at 475 /C176 C for 1000 h ( b ) [99]\nthe Fe-Cr binary system proposed by Williams [49], the ternary diagram at low temperature was incomplete. Lagneborg [96] stated that Co could limit the ' '475 /C14 C embrittlement'' in Fe-(15-17.5) wt.% Cr alloys. However, there is no comprehensive investigation focusing on the effect of Co on low-temperature embrittlement when added to Fe-Cr. Table 3 shows the experimental work on PS in the Fe-Cr-Co system.\nThe Fe-Cr-Co alloys are permanent ductile magnets that were designed by referring to the MG of the\n\nTable 3 Summary of previous experimental studies on PS in Fe-Cr-Co system (all at.% were transferred to wt.%)",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Lagneborg [96], 1970, Solutioning history.T / /C176 C = . Lagneborg [96], 1970, Solutioning history.Time/h = . Lagneborg [96], 1970, Composition/ wt.%.Composition/ wt.% = Fe- (15-17.5)Cr- (0.5-4)Co. Lagneborg [96], 1970, Aging history.T / /C176 C = 440-500. Lagneborg [96], 1970, Aging history.Time = 1000 h. Lagneborg [96], 1970, Method.Method = Tensile test. Lagneborg [96], 1970, Comment.Comment = Small addition of Co ( \\ 4%) prevents embrittlement at 400-550 /C176 C. Kaneko et al. [110], 1972, Solutioning history.T / /C176 C = 1300. Kaneko et al. [110], 1972, Solutioning history.Time/h = 1. Kaneko et al. [110], 1972, Composition/ wt.%.Composition/ wt.% = Fe- (30-50)Cr-. Kaneko et al. [110], 1972, Aging history.T / /C176 C = 600 580. Kaneko et al. [110], 1972, Aging history.Time = 2 h 4 h. Kaneko et al. [110], 1972, Method.Method = HV1, TEM. Kaneko et al. [110], 1972, Comment.Comment = SD occurs in Fe-Cr-Co alloy. Kaneko et al. [111], 1977, Solutioning history.T / /C176 C = . Kaneko et al. [111], 1977, Solutioning history.Time/h = . Kaneko et al. [111], 1977, Composition/ wt.%.Composition/ wt.% = (10-30)Co. Kaneko et al. [111], 1977, Aging history.T / /C176 C = Step aging. Kaneko et al. [111], 1977, Aging history.Time = Step aging. Kaneko et al. [111], 1977, Method.Method = . Kaneko et al. [111], 1977, Comment.Comment = Co raises MG and skews it towards lower Cr concentrations. Miyazaki et al. [112], 1974, Solutioning history.T / /C176 C = 1000. Miyazaki et al. [112], 1974, Solutioning history.Time/h = 1. Miyazaki et al. [112], 1974, Composition/ wt.%.Composition/ wt.% = Fe-45Cr, Fe- 45Cr-5Co. Miyazaki et al. [112], 1974, Aging history.T / /C176 C = 450-500. Miyazaki et al. [112], 1974, Aging history.Time = 10-100,000 h. Miyazaki et al. [112], 1974, Method.Method = HV0.5, TEM. Miyazaki et al. [112], 1974, Comment.Comment = Co increases hardening rate during aging. Okada et al. [113], 1978, Solutioning history.T / /C176 C = 1300. Okada et al. [113], 1978, Solutioning history.Time/h = 0.5. Okada et al. [113], 1978, Composition/ wt.%.Composition/ wt.% = Fe-31Cr- 23Co. Okada et al.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "[113], 1978, Aging history.T / /C176 C = 600. Okada et al. [113], 1978, Aging history.Time = 20 min, 2 h, 100 h, 500 h. Okada et al. [113], 1978, Method.Method = TEM. Okada et al. [113], 1978, Comment.Comment = Critical temperature of MG for this composition is below 670 /C176 C. Jin et al. [114], 1980, Solutioning history.T / /C176 C = 1200 1300. Jin et al. [114], 1980, Solutioning history.Time/h = 4 1. Jin et al. [114], 1980, Composition/ wt.%.Composition/ wt.% = Fe-Cr- (9-11%)Co. Jin et al. [114], 1980, Aging history.T / /C176 C = 540-620. Jin et al. [114], 1980, Aging history.Time = . Jin et al. [114], 1980, Method.Method = TEM, HRC, tensile. Jin et al. [114], 1980, Comment.Comment = Co content influences degree of SD. Minowa et al. [115], 1980, Solutioning history.T / /C176 C = 1200-1300. Minowa et al. [115], 1980, Solutioning history.Time/h = 1. Minowa et al. [115], 1980, Composition/ wt.%.Composition/ wt.% = Fe- (20-35)Cr- (6-20)Co. Minowa et al. [115], 1980, Aging history.T / /C176 C = 620-690. Minowa et al. [115], 1980, Aging history.Time = 1 h. Minowa et al. [115], 1980, Method.Method = TEM. Minowa et al. [115], 1980, Comment.Comment = MG was skewed to higher temperatures at lower Cr concentration. Zhu et al. [116], 1986, Solutioning history.T / /C176 C = 950. Zhu et al. [116], 1986, Solutioning history.Time/h = 1. Zhu et al. [116], 1986, Composition/ wt.%.Composition/ wt.% = Fe-26Cr- 16Co. Zhu et al. [116], 1986, Aging history.T / /C176 C = 525 600. Zhu et al. [116], 1986, Aging history.Time = 1-10,000 h. Zhu et al. [116], 1986, Method.Method = APFIM. Zhu et al. [116], 1986, Comment.Comment = Co addition shifts the MG towards both higher temperatures and lower Cr content. , Solutioning history.T / /C176 C = . , Solutioning history.Time/h = . , Composition/ wt.%.Composition/ wt.% = Fe-27Cr- 25Co. , Aging history.T / /C176 C = 640. , Aging history.Time = . , Method.Method = . , Comment.Comment = . Alleg et al. [117], 1999, Solutioning history.T / /C176 C = . Alleg et al. [117], 1999, Solutioning history.Time/h = . Alleg et al. [117], 1999, Composition/ wt.%.Composition/ wt.% = Fe-29Cr- 13Co. Alleg et al. [117], 1999, Aging history.T / /C176 C = 520,",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "560, 600. Alleg et al. [117], 1999, Aging history.Time = 1-18,000 h. Alleg et al. [117], 1999, Method.Method = XRD, MS. Alleg et al. [117], 1999, Comment.Comment = Co accelerates PS and lower activation energy\nFe-Cr-Co system assessed in previous research [110, 111, 113, 115, 118]. Co was found to raise and expand the MG and skew it towards lower Cr concentrations [111, 115]. The critical temperature of the MG was described to be below 670 /C14 C [111, 113]. There was a peculiar ' 'ridge' ' [113, 115] in the MG in the Fe-Cr-Co system, which is believed to be due to the enlarged magnetic effect by Co addition [118]. Co addition was observed to increase the age-hardening rate [112] during 100 to 3000 min when comparing Fe-45Cr and Fe-45Cr-5Co at 500 /C14 C, see Fig. 5. To better understand the reason for the accelerated kinetics, Alleg et al. [117] evaluated the activation energy for PS of Fe-30.8Cr-12.2Co alloy to be 17 kJ mol -1 , which is considerably low compared to that of Fe-Cr binary alloys that have been assessed to be 204 [119] or 193 /C6 3 kJ/mol [120]. However, these larger values were obtained under NG conditions. The mechanical properties of Fe-Cr-Co alloys have also been presented in previous works [96, 114, 121]. The Co content is believed to increase the strength and reduce the ductility by influencing the amplitude of SD in the aged conditions [114].",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Apart from the above-mentioned elements, effects of other alloying elements such as Cu, Mo, Nb, Ti, V, N, Mn, and Sn on the low-temperature embrittlement have been investigated previously [85, 90, 122-127]. Table 4 summarizes the previous work focusing on the effect of these elements on PS.\nFig. 5 Effect of Co addition on hardness evolution of Fe-45Cr alloy aging at 500 /C176 C [112]",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The rate of PS was found to increase by the addition of Cu when Solomon and Levinson [85] investigated the multicomponent model alloys Fe-25Cr-6Ni-3Mo-Cu and Fe25Cr-6Ni-3Mo after aging at 475 /C176 C. In their Mo ¨ssbauer spectra, Cu-containing alloy showed a more prominent paramagnetic peak than the non-Cu-containing alloy after aging for 118 h. Since Cu is diamagnetic, they suggested that this was evident that Cu promotes the formation of the paramagnetic a 0 . Hedstro ¨m et al . [90] found that there is no obvious PS in Fe-20Cr alloys after aging 10 h at 500 /C176 C. There was an effect on hardening and the effect was more apparent for 1.5 wt.% Cu addition to Fe-20Cr alloy when aging at 500 /C14 C for 10 h compared to aging at 450 /C14 C, as shown in Fig. 6. The frequency diagrams of APT analysis showed that there was no obvious difference of PS with or without Cu, but it is possible that the effect of promoting PS would be clear if longer aging would have been conducted, comparing aging time of 10-118 h in Ref. [85]. Cu clustering was observed in Fe-20Cr-1.5Cu alloy after aging at 500 /C176 C for 10 h. Since the same Cu clustering effect has been reported previously in a 9Ni-12Cr-2Cu maraging steel [131] and a 25Cr-7Ni super DSS [34], it was proposed that Cu clustering could take the main responsibility for the difference in micro-hardness increase and embrittlement between the alloys with and without Cu. It could also be mentioned that Cu clusters could serve as heterogeneous nucleation sites for Ni-rich precipitates [131] and/or a 0 phase [90] in multicomponent alloys. Therefore, the clustering of Cu could be a reason for the enhanced embrittlement found by Solomon and Levinson [85].",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Mo addition was observed to decrease the hardening rate of Fe-Cr alloys [123, 126] as shown in Fig. 7a. It was suggested that the embrittlement was caused by the precipitation of a 0 on dislocations and the toughness decrease is due to the precipitation of carbonitrides rather than the immobilization of dislocations by a 0 [123, 125]. Meanwhile, a minor interplay between Cr and Mo, which do not form a compound, is attributed to the effect of Mo. This alloying element is also very effective in increasing the intensity of the age hardening due to the coherency strains [126]. In addition, Costa et al. [129] found by MS that the addition of Sn could suppress the rate of PS as well. Although no available paper has discussed the reasons, it could possibly be that both Mo and Sn have relatively larger atomic sizes than either Fe or Cr, which can induce a relatively strong elastic energy.\n\nTable 4 Summary of previous experimental studies on PS in Fe-Cr-X system (all compositions given in at.% were transformed to wt.%)",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Grobner [123], 1973, Solutioning history.T / /C176 C = 816. Grobner [123], 1973, Solutioning history.Time = 1 h. Grobner [123], 1973, Composition/wt.%.Composition/wt.% = Fe-14Cr-(0, 2)Mo Fe-18Cr-(0, 2)Mo. Grobner [123], 1973, Aging history.T / /C176 C = 427, 482, 538. Grobner [123], 1973, Aging history.Time/h = 4800. Grobner [123], 1973, Method. = TEM, Charpy V, HRA. Grobner [123], 1973, Comment. = Mo can suppress increasing trend of hardness. Courtnall and Pickering [126], 1976, Solutioning history.T / /C176 C = 1000. Courtnall and Pickering [126], 1976, Solutioning history.Time = 15 min. Courtnall and Pickering [126], 1976, Composition/wt.%.Composition/wt.% = Fe-25Cr-Mo Fe-25Cr-0.19Ti Fe-25Cr-0.3Nb Fe-18Cr. Courtnall and Pickering [126], 1976, Aging history.T / /C176 C = 500. Courtnall and Pickering [126], 1976, Aging history.Time/h = 1000. Courtnall and Pickering [126], 1976, Method. = TEM, HV, tensile test. Courtnall and Pickering [126], 1976, Comment. = Rate of age hardening was increased by high C and N, and also with addition of Mo, Ti and Nb. Solomon and Levinson [85], 1978, Solutioning history.T / /C176 C = 1150. Solomon and Levinson [85], 1978, Solutioning history.Time = 2 h. Solomon and Levinson [85], 1978, Composition/wt.%.Composition/wt.% = Fe-25Cr-6Ni-3Mo-Cu; Fe- 25Cr-6Ni-3Mo. Solomon and Levinson [85], 1978, Aging history.T / /C176 C = 475. Solomon and Levinson [85], 1978, Aging history.Time/h = 118. Solomon and Levinson [85], 1978, Method. = MS, TEM. Solomon and Levinson [85], 1978, Comment. = Cu appears to influence formation of paramagnetic a 0. Hedstro ¨m et al. [90], 2013, Solutioning history.T / /C176 C = 710. Hedstro ¨m et al. [90], 2013, Solutioning history.Time = 72 h. Hedstro ¨m et al. [90], 2013, Composition/wt.%.Composition/wt.% = Fe-20Cr-1.5Cu; Fe-20Cr; Fe-20Cr-4.5Mn. Hedstro ¨m et al. [90], 2013, Aging history.T / /C176 C = 450, 500. Hedstro ¨m et al. [90], 2013, Aging history.Time/h = 10. Hedstro ¨m et al. [90], 2013, Method. = HV0.1, Charpy V, SEM, APT. Hedstro ¨m et al. [90], 2013, Comment. = Cu has no obvious effect on PS; Cu clustering was observed; Mn",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "accelerates PS. Mima et al. [128], 1967, Solutioning history.T / /C176 C = 1150. Mima et al. [128], 1967, Solutioning history.Time = 5 h. Mima et al. [128], 1967, Composition/wt.%.Composition/wt.% = Fe-24Cr, Fe-16Cr-6V, Fe- 11Cr-11V, Fe-40Cr, Fe- 33Cr-5V, Fe-29Cr-9V. Mima et al. [128], 1967, Aging history.T / /C176 C = 480, 510. Mima et al. [128], 1967, Aging history.Time/h = 10-10,0000. Mima et al. [128], 1967, Method. = HV 0.5, MS,. Mima et al. [128], 1967, Comment. = Small amount ( \\ 2 wt.%) of V raises MGwhile large amount ( [ 2 wt.%). Mima and Yamaguchi [122], 1970, Solutioning history.T / /C176 C = . Mima and Yamaguchi [122], 1970, Solutioning history.Time = . Mima and Yamaguchi [122], 1970, Composition/wt.%.Composition/wt.% = . Mima and Yamaguchi [122], 1970, Aging history.T / /C176 C = . Mima and Yamaguchi [122], 1970, Aging history.Time/h = . Mima and Yamaguchi [122], 1970, Method. = TEM. Mima and Yamaguchi [122], 1970, Comment. = of V lowers it. Koutaniemi et al. [124], 1974, Solutioning history.T / /C176 C = 1000. Koutaniemi et al. [124], 1974, Solutioning history.Time = 20 min. Koutaniemi et al. [124], 1974, Composition/wt.%.Composition/wt.% = Fe-17Cr-V. Koutaniemi et al. [124], 1974, Aging history.T / /C176 C = 400-650. Koutaniemi et al. [124], 1974, Aging history.Time/h = Up to 1000. Koutaniemi et al. [124], 1974, Method. = HV, TEM. Koutaniemi et al. [124], 1974, Comment. = 1 wt.% V could increase hardness and slightly retards rate of age- hardening. Costa et al. [129], 2003, Solutioning history.T / /C176 C = 1000 900. Costa et al. [129], 2003, Solutioning history.Time = 1 h 30 h. Costa et al. [129], 2003, Composition/wt.%.Composition/wt.% = Fe-43Cr, Fe-43Cr-7Sn, Fe- 43Cr-14Sn. Costa et al. [129], 2003, Aging history.T / /C176 C = 475. Costa et al. [129], 2003, Aging history.Time/h = 0, 1000, 1500. Costa et al. [129], 2003, Method. = MS. Costa et al. [129], 2003, Comment. = Sn addition suppresses rate of PS. Hendry et al. [130], 1979, Solutioning history.T / /C176 C =",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "1100. Hendry et al. [130], 1979, Solutioning history.Time = 20 h. Hendry et al. [130], 1979, Composition/wt.%.Composition/wt.% = Fe-22Cr-(0, 0.02, 0.04, 0.08)N. Hendry et al. [130], 1979, Aging history.T / /C176 C = 500. Hendry et al. [130], 1979, Aging history.Time/h = 540. Hendry et al. [130], 1979, Method. = HV 50, XRD, TEM. Hendry et al. [130], 1979, Comment. = N promotes hardening and enhances tendency of high-Cr alloys to cluster\nFig. 6 Effect of Cu addition on hardness evolution of Fe-20Cr alloys [90]\nApart from Mo, minor addition amounts of Nb and Ti were observed to increase the hardening rate of Fe-24.5Cr alloys at 500 /C176 C for up to 1000 h [126] as shown in Fig. 7b. The accelerating effects of minor contents of Ti and Nb may be associated with the tendency to form a compound with Cr [126]. On the contrary, Lagneborg [132] studied the materials of Fe-17Cr, Fe-17Cr-2Ti, and Fe17Cr-2Mo alloys aged at 475 /C176 C for up to 1000 h and found that both Ti and Mo could suppress PS in the ternary alloys, respectively, after aging at 475 /C176 C for 1000 h. The contrasting effects of Nb and Ti depend on their contents, which has a similar trend as Al [98, 99].",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The effect of 0-2 wt.% V on PS in Fe-17Cr alloys aged at 475 /C176 C is shown in Fig. 8 [124]. It is found that V addition increases the hardness and slightly retards the rate of age\nFig. 7 Effect of Mo addition on hardness evolution of Fe-Cr alloys aging at 482 /C176 C ( a ) [123] and Nb and Ti addition on hardening rate of Fe24.5Cr alloys aging at 500 /C176 C ( b ) [126]\nFig. 8 Effect of V addition on hardness change of Fe-17Cr alloys aging at 475 /C176 C [124]\nhardening. The hardness increases with the aging time curves at 475 /C14 C, indicating that V has the strongest effect at a content of around 1 wt.%, but it seems to decrease when the content is larger. Even though Mima and Yamaguchi [122] claimed that MG was first raised by a smallamount addition of V and then lowered by a large-amount V addition, the hardness results are probably more than due to PS because there seem to be other precipitates rather than interconnected structure observed from the dark-field transmission electron micrograph [124]. This suggests that vanadium carbide (VC) could take the main responsibility for the increase in hardness. Moreover, it is not convincing to draw a conclusion according to their experimental details because there are other elements in the investigated steels by Koutaniemi et al. [124], such as Si, Mn, Ti, and\nFig. 9 Effect of N on micro-hardness evolution of Fe-22Cr alloys at 500 /C176 C [130]\nAl. For instance, the change of Si content in their work is even better in agreement with the hardness evolution than V. More experiments should be performed to determine the effect of V on PS.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The effect of N has been investigated by Hendry et al. [130] by varying N content in Fe-22Cr alloys (wt.%) aged at 500 /C176 C for up to 540 h. As demonstrated in Fig. 9, the increasing rate of micro-hardness at the early stage of aging increases with N content, which indicates that the kinetics of PS is enhanced by the addition of N. Furthermore, they claimed the reason for the increasing rate of micro-hardness is that N can enhance the tendency of the high-Cr\nalloys to cluster and that the consequent Cr-N bonding and associated strain are the cause of the embrittlement [130].\nFor instance, the increasing hardness in Fig. 9 with N addition could be attributed to the formation of nitrides. Apart from N, alloying elements such as Ti, Nb and V were found to increase the hardness [126, 127]. However, the hardening effects in those Fe-Cr alloys are believed to be more related to the formation of carbides, nitride or carbonitrides rather than PS. Further investigation is needed to separate the effects of these mechanisms on the hardness change.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Thermo-Calc 2020b with TCFE9 database [38] was used to calculate MGs, driving forces (DFs) of a 0 formation and the composition of the separated phases ( a and a 0 ) for Fe20Cr-(1-5)X (X = Ni, Al, Co) (wt.%) at 475 /C14 C and 101.325 kPa. Cr mobility and diffusivity in bcc phase have been calculated by using Thermo-Calc 2020b with the MOBFE4 database [133]. D (bcc, Cr, Cr, Fe) means Cr diffusivity in a gradient of Cr for a bcc Fe matrix.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The effects of 1-5 wt.% Ni, Al and Co additions on MGs are shown in Fig. 10. From Fig. 10a, it is observed when Cr content is higher than 29.9 wt.%, Ni addition raises MG and skews the critical temperature to higher Cr content, which is in agreement with the results in Miller et al. [86]. However, for Cr region with less than 29.9 wt.%, the effect of Ni addition is the opposite: the increasing content of Ni lowers MG. Meanwhile, Al addition is observed to lower and shrink MG for all Cr additions, as shown in Fig. 10b. As for the addition of Co (Fig. 10c), it is shown to raise and expand MG for the whole Cr range, but the predictions do not shift the critical temperature to lower Cr content as indicated in prior research [111, 115]. Furthermore, the ' 'ridge'' of MG can be seen at Cr range of 30-35 wt.%, when Co addition is higher than 4 wt.%, which is consistent with Refs. [113, 115].",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Figure 11 shows that when the content of alloying elements increases, Ni addition lowers DF with * 0.01 for each 1 wt.% Ni while Co raises it with * 0.02 for each 1 wt.% Co. As for Al, there is a hump at around 1.5-2 wt.% Al addition and then it drops to near 0 at 5 wt.% Al, which fits the hardness evolution tendency in Fig. 4. The tendencies of DF are corresponding with MGs change. With the increase in Ni content, DF decreases as well as critical temperature increases and skews to a higher Cr range, as shown in Fig. 10a. Meanwhile, the increasing Co content can increase DF, and the critical temperature shifts to a lower Cr range. It has been reported that PS is accelerated due to the shift of MG towards high temperature with increasing Ni content. This behaviour is consistent with the higher Cr content but for lower Cr content it is opposite, as shown in Fig. 10a.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Figure 12a shows that Cr mobility in bcc of these three alloys decreases from 2.0 /C2 10 -31 to 1.0 /C2 10 -31 m 2 /s when the alloying contents increase. However, Al addition is shown to have the most apparent influence on Cr mobility. It drops to 6.1 /C2 10 -32 m 2 /s when Al content grows to 3.5 wt.% and then increases to 1.0 /C2 10 -31 m 2 /s at 5 wt.% Al. Compared to Al, the additions of Ni and Co are shown to decrease Cr mobility linearly. As for diffusivity, the same decreasing trends of these three alloys were observed when Ni (Fig. 12b), Al (Fig. 12c), and Co (Fig. 12d) contents increased. Similarly, Al addition alloy has the largest magnitude decrease in diffusivity, from 0 to -1.57 /C2 10 -20 , as shown in Fig. 12c. The evolutions of mobility and diffusivity match the hardness evolution of Al-added alloys to some extent [100, 101]. 1-5 wt.% Ni addition decreases Cr diffusivity from approximately 1.65 /C2 10 -28 to approximately 1.05 /C2 10 -28 m 2 /s. However, Ni was observed to accelerate PS by enhancing the inter-diffusion coefficient [85, 92] but the diffusivity in Fig. 12b shows the opposite tendency.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Figure 13 shows the partitioning factor kx ( kx ¼ c a = c a 0 , where c a is the concentration of a , c a 0 is the concentration of a 0 ) of Ni, Al and Co additions to Fe-20Cr alloys at 475 /C14 C aging. This is the ratio of elements (Ni, Al, Co) in a divided by that in a 0 . The positive k values of Ni, Al and Co indicate that all these three elements partition to a , which are consistent with the previous experimental findings [86, 100, 101, 103, 105]. It is clear that 1-5 wt.% Al addition decreases k value significantly from 53.3 to 5.0. However, Capdevila et al. [103] showed that Al partitioning coefficient is almost constant for Cr content less than 40 at.%, and it increases almost exponentially for a higher Cr content with the increase in aging time [106]. A slight increase can be observed in Co-added alloys, in which k value remains * 53. Ni addition is shown to increase k value slightly, but it has a relatively higher k value than others, nearly 100. Al does not show a clear preferential partitioning at the early stage of PS, but after long-time aging, the partitioning of Al to a appears [29, 35].\nFig. 10 Miscibility gaps of Fe-20Cr-(1-5)X (X = Ni ( a ), Al ( b ), Co ( c )) (wt.%) alloys at 475 /C176 C\nFig. 11 Driving forces of Fe-20Cr-(1-5)X (X = Ni, Al, Co) (wt.%) alloys at 475 /C176 C\nFig. 13 Evolution of partitioning factor with contents of alloying elements in Fe-20Cr alloys aging at 475 /C176 C\nFig. 12 Mobility ( a ) and diffusivity ( b -d ) with addition of Ni, Al and Co in Fe-20Cr at 475 /C176 C\nHowever, Ni and Co show contrasting behaviours [86, 116, 134]. Significant Ni partitioning was observed in Fe-45Cr-5Ni alloys after aging for 500 h at 500 /C14 C [86] while Co was observed to partition to a in Fe-Cr-Co alloys aged up to 8 h at 600 /C14 C [116, 134] due to sufficiently high DF for partitioning.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Ni can increase the rate of PS when it is added to the binary Fe-Cr system according to the experimental observations. The most probable reason is that Ni enhances the inter-\ndiffusion coefficient [85, 92]. Ni has also been found to partition to a in both ternary and multi-component stainless steel [33, 86, 89, 135, 136]. With the addition of Ni, the chemical potential of Cr increases, and thus DF for the diffusion of Cr will increase. As a consequence, Ni partitions to Fe-rich regions which gives a lower total Gibbs energy for the system. Also the activation energy for PS of Fe-28Cr-5Ni alloy is observed to be lower than that of Fe28Cr alloy [88]. However, it is difficult to conclude that Ni accelerates PS by lowering the activation energy since the latent nucleation event would influence it. Moreover, Ni addition is believed to widen [58, 86-88] and raise [86] MG. For instance, 3 wt.% Ni addition is believed to expand the spinodal region of Fe-20Cr binary at 475 /C176 C [90], in that case the mechanism of PS changes gradually from NG to SD. It is noted that the calculated Ni addition shows a reverse influence on DF of PS (Fig. 11d) as well as diffusivity (Fig. 12b), in comparison with the reported experimental results [85, 87-92]. Likewise, the reductions of kinetics and diffusivity have been obtained by Hayes et al. [136] and Barkar [137] in their simulation work. From the theoretical perspective, Barkar [137] believed that Ni may either accelerate or inhibit the decomposition depending on the specific circumstance, e.g., Cr content and/or temperature. For instance, Barkar [137] evaluated that when x Cr \\ 0 : 4 ( x Cr is the mole fraction of Cr), MG is shifted to lower temperatures by Ni addition and to higher temperatures for x Cr [ 0 : 4, which is similar to the critical Cr concentration ( /C24 30 wt.%) in Fig. 10a. It should be kept in mind that the mobility database of Fe-Cr-Ni is obtained in the high temperature range (1000-1800 /C14 C) and then extrapolated to low temperature conditions (400-1000 /C14 C) [138, 139].",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The interesting effect of Al on Fe-Cr PS has been reported by many researchers [96, 98, 99], i.e., that Al addition promotes embrittlement at a small amount ( \\ 2 wt.%), while a large amount ( [ 2 wt.%) of Al suppresses it. These contrasting results have been widely discussed, but there is no consensus. It could be due to the larger strain energy or lattice misfit when adding Al, which lowers the coherent binodal and spinodal when Al becomes more concentrated [104]. Another explanation is that Al destabilizes a 0 and allows for increased Cr solubility [99] or retards the formation of a 0 [97]. Looking at the calculated DF in Fig. 10d, there is a small hump at about 2-3 wt.% Al for DF of a 0 , which could be responsible for the more rapid hardness evolution with low additions of Al. Additionally, Fig. 10b shows that Al addition lowers MG and makes it more narrow for Fe-Cr, especially for the range of x Cr [ 0.18. However, it is hard to compare MGs here due to the lack of experimental measurements for the determination of FeCr-Al phase diagram. Furthermore, Al was observed to partition to a phase in Fig. 13 and Refs. [101, 103, 105, 140], which may generate stresses (Al can dilate Fe and Cr [141]) within the phases and, consequently, affects its inter-diffusion and thus restricts its mobility [100, 101]. However, since the inter-diffusion coefficient of Cr was found weakly dependent on Al concentration less than 20 at.% [142], it is more reasonable to ascribe the suppression of a 0 formation or retarding coarsening of a 0 phase by adding Al to thermodynamics reason rather than kinetics [143]. To sum up, it is of great interest to investigate the effect of adding more than 2 wt.% Al in stainless steels on the low-temperature embrittlement.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "The addition of Co has been suggested to increase the critical temperature and produce an asymmetric dual-phase region [113]. Since the atomic misfit of the ternary system is similar to Fe-Cr binary [110, 111, 113], the effect of Co is believed to be more due to the ferromagnetic properties of Co. Nishizawa et al. [118] pointed out that Co has the opposite effect on the magnetic properties of Fe as compared to other elements. Co addition is shown to raise and widen MG in Fig. 10c but it seems to not shift MG to lower Cr content as previous works suggest [111, 115]. Co addition has also been found to accelerate PS [114, 117], which is believed to lower the required activation energy [117]. However, in those above-mentioned studies, Co contents are relatively high ( [ 5 wt.%, Table 3). When Co addition is small ( \\ 4 wt.%), similar to Al addition, Lagneborg [96] proposed that it suppressed ' '475 /C176 C embrittlement'' at the certain amount of Cr concentration (13-18 wt.%). The most probable reason is that Co addition lowers DF of PS at this Co content range ( \\ 4 wt.%), as shown in Fig. 11. More investigations on the small Co addition to Fe-Cr based alloys should be pursued.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "Cu addition seems to promote PS in multicomponent alloys Fe-25Cr-6Ni-3Mo-Cu after 118 h aging [85] but the recent APT investigation [90] on Fe-20Cr-1.5Cu model alloy for aging 10 h did not support it. However, it may be due to the much shorter aging time in Ref. [90] or the effect from other elements (Ni and/or Mo) in the multicomponent alloys in Ref. [85]. Moreover, the observed hardening effect and embrittlement by adding Cu to Fe-Cr based alloy [85, 90] is believed to be more related to Cu clustering observed in Refs. [34, 131]. Mo [123, 126] and Sn [129] additions were observed to suppress the rate of PS,\nmost probably due to their relatively larger atomic sizes than Fe and Cr. Additionally, Nb, Ti and V have shown a contrasting effect on hardness change, depending on their contents, which is similar to Al effect. However, it is difficult to separate the effect of precipitation hardening and PS for those Fe-Cr alloys containing Nb, Ti, V and N. According to the materials, C and/or N are always in the raw materials for alloy preparation, so that they will form some carbides and/or nitrides, which contribute more than PS to the hardness increase. Usually, C is investigated together with N as interstitial elements. Courtnall and Pickering [126] found that stainless steels with high contents of C and N show higher hardening rates. Apart from the above mentioned, there are also many elements, such as Mn and Si, that have very important effects on PS in stainless steels. For instance, a study by Hedstro ¨m et al. [90] suggest that 4.4 wt.% Mn can accelerate PS in ferrite of Fe-Cr alloys.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    },
    {
        "content": "- 1. Ni addition can accelerate the kinetics of PS in Fe-Cr alloys, most probably by enhancing the inter-diffusion coefficient. MG was raised and widened by Ni additions. The calculation results are supporting the literature only for lower Cr conditions ( \\ 29.9 wt.%), whilst for the higher Cr content ( [ 29.9 wt.%), more experiments are needed.\n- 2. Al can prevent low temperature embrittlement depending on its content in Fe-Cr-Al alloy. Small Al addition ( \\ 2 wt.%) can increase hardness while large Al addition ( [ 2 wt.%) decreases it. The suppression effect by large amount of Al is unclear. So far, there is no direct investigation to compare the effect of Al addition on the kinetics of PS.\n- 3. Co addition accelerates PS by lowering the activation energy required for PS. Co raises and widens MG. No comprehensive mechanical tests have been done to show its effects on mechanical properties.\n- 4. Mo, Nb, Ti and Mn additions can enhance the kinetics of PS while Sn addition can suppress it. Cu has no obvious effect on the rate of PS but it is observed to enhance embrittlement. Alloying elements such as Mo, Nb, Ti and V can increase the hardness of Fe-Cr alloys but it is needed to separate the effect of PS and precipitation hardening.\nAcknowledgements The authors acknowledge Dr. Jing Zhou for collecting references and initiating this work. Jian-ling Liu thanks Dr. Zi-yong Hou from KTH for valuable discussions. Jian-ling Liu acknowledges the support from the China Scholarship Council (CSC No. 201700260207) and Swedish Iron and Steel Research Office\n(Jernkontoret). The EIT RawMaterials Upscaling project EndureIT (No. 18317) is acknowledged by PH and WM for financial support.\nFunding Open access funding provided by Royal Institute of Technology.",
        "source": "10.1007/s42243-025-01528-y",
        "file_path": ""
    }
]