[
    {
        "content": "Laser powder bed fusion (LPBF) is a commonly used additive manufacturing (AM) method for efficiently producing intricate geometric components. This investigation examines factors such as pores, cellular structure, grain size, and inclusions from the manufacturing process that contribute to the corrosion resistance of LPBF DSS. Furthermore, the as-built LPBF duplex stainless steel (DSS) is primarily ferrite due to the rapid cooling process. Therefore, the transformation of ferrite to austenite after various heat treatments in LPBF DSS and its corresponding corrosion resistance are presented. Additionally, a new mixed powder method is proposed to increase the austenite content in the as-built LPBF DSS. This review also focuses on the passivation capability and pitting corrosion performance in LPBF and conventional DSS. This article summarizes the variations in microstructure between as-built and heat-treated LPBF DSS, with their impacts on corrosion resistance, offering insights for manufacturing highly corrosion-resistant LPBF DSS.\nKeywords Laser powder bed fusion · Duplex stainless steel · Microstructure · Heat treatment · Passivation · Pitting corrosion",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "Stainless steel is extensively utilized in the industry due to its outstanding corrosion resistance and mechanical properties. It consists of five main phases: austenitic, martensitic, ferritic, precipitation hardening, and duplex stainless steel (DSS) [1-7]. DSS is composed of two phases: austenite and ferrite, with differing chemical compositions. The ferritic phase contains more Cr, Mo, and Si, whereas the austenitic phase contains more W, Ni, Mn, and N [8, 9]. In China, corrosion costs $310 billion, with a global cost of more than $4 trillion per year [10, 11], which means that controlling\nAvailable online at http://  link.  sprin  ger.  com/  journ  al/  40195.\n* Yiqi Zhou ustbyiqizhou@ustb.edu.cn\n1 Beijing Advanced Innovation Center for Materials Genome Engineering, Institute for Advanced Materials and Technology, University of Science and Technology Beijing, Beijing 100083, China\n2 Shanghai Key Laboratory of Advanced High-Temperature Materials and Precision Forming, School of Materials Science and Engineering, Shanghai Jiao Tong University, Shanghai 200240, China\nthe corrosion rate is an effective method to reduce the cost. DSS offers excellent localized corrosion resistance and mechanical properties through its austenitic phase, while the ferritic phase provides high-strength performance and good stress corrosion cracking (SCC) resistance [12, 13]. Optimal corrosion and mechanical performance in DSS are achieved at a balanced ferrite-to-austenite ratio without any harmful secondary precipitates, and post heat-treatment is an option for obtaining this balanced ratio [14-17]. DSS can be classified into four main groups, depending on the compositions: lean DSS (2101 and 2304), standard DSS (2205), super DSS (2507), and hyper DSS (2707 and 3207) [18-24].\nAdditive manufacturing (AM), also known as 3D printing,  is  an  innovative  technique  for  producing near-netshaped components in a layer-by-layer process using a high-energy laser or electron beam [25, 26]. Various types of stainless steel have been successfully fabricated using AM techniques [27-35]. AM products have been utilized in corrosive environments within the automotive, aerospace, medical, food, oil, and gas industries [36-41]. The primary advantages of AM technology include minimal waste materials, a short manufacturing lead time, high flexibility, products with complex geometries, and a short product development period [42-45]. The quality and composition of the",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "starting powder, volumetric energy density (VED) of the laser, and cooling rate impact the final microstructure of AM components [46-51]. Laser powder bed fusion (LPBF), also known as selective laser melting (SLM), is an AM technique. The key advantages of LPBF components include precise geometry, surfaces with low waviness, high relative densities, thin structures, and low oxide impurities [52-58]. The schematic in Fig. 1 depicts the several steps in a typical LPBF manufacturing process. First of all, computer-aided design (CAD) files are required. Subsequently, a thin layer of powder is deposited on the previously processed layers or base plate using a recoater, followed by selective melting of the powder using a high-energy laser beam. Subsequently, the base plate is lowered by one layer thickness, followed by a new powder layer is deposited. Finally, production is completed by melting the final layer [59, 60]. The microstructure of LPBF products is controlled by the printing parameters, such as the laser power, hatch spacing, scanning speed, layer thickness, and building direction [61-65]. The non-equilibrium phase in LPBF products comprises dendritic and interdendritic structures, refined grains, dislocation cells, nanosized precipitates, and large residual stress that are generated through the complex thermal cycles, extra-high local heating (> 2500 ℃ ), ultra-fast cooling rates   (10 5 -10 7 K/s), and re-heating  from  melting  the  subsequent  powder  layers [66-71]. Un-melted powder, pores, the balling phenomenon, and microcracks are the main factors that degrade the mechanical and corrosion properties of LPBF parts [72-75]. In addition to the LPBF manufacturing method, wire arc additive manufacturing (WAAM) and direct energy deposition (DED) are also common 3D printing methods used to produce stainless steel [76, 77].\nTo date, multiple research studies have been published regarding the corrosion performance of AM stainless steel\nFig. 1 Schematic of LPBF printing process (adapted with permission from Ref. [42], copyright Corrosion 2022)\n[42, 46, 66, 78]. Sander et al. [42] and Kong et al. [66] examined the factors contributing to corrosion peformance in LPBF metallic alloys. Laleh et al. [46] and Ettefagh et al. [78] provided an overview of the corrosion resistance of austenite, precipitation hardening, and DSS specimens produced by direct laser deposition (DLD). Meanwhile, Zhang and co-authors [17] conducted a review on the mechanical properties and corrosion performance of AM DSS. Interestingly, there has been a lack of focus on summarizing the corrosion behavior of LPBF DSS. This manuscript aims to cover various factors affecting the corrosion performance of LPBF DSS. It will initially investigate the distinct microstructure resulting from the LPBF process, including pores, cellular structure, grain size, and inclusions, with their impact on corrosion performance. Subsequently, it will explore the correlation between phases and post-heat treatment in wrought and LPBF DSS, as well as an innovative approach-the mixed powder strategy-designed to enhance austenite content in as-built LPBF DSS. Furthermore, it will address microstructural considerations from the LPBF process that could influence corrosion performance, comparing the passivation behavior and pitting corrosion resistance of wrought and LPBF DSS. Finally, it will propose future research directions for LPBF DSS before summarizing the findings.",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "The microstructural features of stainless steels produced by LPBF, such as porosity, cellular structure, grain size, and inclusions, significantly affect corrosion behavior, especially the pores [17, 48, 67, 78-81]. Additionally, during the rapid cooling process in LPBF, the as-built DSS consists mainly of ferrite, requiring post-heat treatment to adjust the ratio of austenite and ferrite phase [82-84]. Therefore, research is focused on optimizing post-heat treatment conditions for phase equilibrium without the formation of harmful precipitates. One approach to avoid post-heat treatments is the incorporation of austenite stabilizers such as nickel and austenitic stainless steel powder into the DSS powder, which increases the austenite content in the as-built LPBF DSS.",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "The pores present in LPBF stainless steel have a significant impact on the corrosion resistance [85-87]. These pores vary in size from micro to macro and are formed from un-melted powder particles, trapped gas in the powder, and the formation of melt-pools during LPBF processing [88]. Figure 2a, b depicts spherical pores in\nthe LPBF stainless steel, while Fig. 2c, d shows irregular pores/lack of fusion (LOF). The spherical pores are a result of trapped gas [89]. Irregular pores, on the other hand, are formed from the un-melted powder particles, hindering repassivation process and accelerating corrosion propagation [90-92]. It has been observed that spherical pores are smaller than irregular pores, indicating lower susceptibility to corrosion [90, 93]. The porosity and pore sizes of LPBF products can be adjusted by controlling powder quality, scanning speed, hatch style, laser diameter, and laser power energy, however, complete removal of pores is not possible [94-97]. Very high scanning speeds and/or extremely low laser powers lead to the formation of irregular pores [88, 90, 93, 98]. During the potentio-dynamic polarization test of LPBF stainless steel, the passive zone disappeared when the pore size increased from 10 to 50 μm [99]. Although smaller pores (< 10 μm) did not affect the pit nucleation potential during the potentio-dynamic polarization test, they might lead to pitting corrosion after a longer exposure time (potentio-static polarization test) [100].",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "In LPBF stainless steel, elemental segregation and highdensity dislocations are observed at the boundaries of the cellular structure, significantly influencing corrosion behavior and mechanical properties [101-103]. The size of these cellular structures is strongly controlled by the additive manufacturing parameters [104, 105]. In the case of smaller cells, the higher density of cellular boundaries increases the activity and accelerates the diffusion of electrons, thereby promoting the formation of a passive film as the number of nucleation sites increases [105, 106]. Higher concentrations of Cr and Mo were observed at the cell boundaries [107, 108]. Some publications support the idea that the cellular structure benefits the corrosion behavior. The Volta potential at the boundary was found to be 5 mV higher than that inside the cell, which is caused by the concentration of Cr and Mo. This small Volta potential difference promotes the formation of a thicker passive film, resulting in better corrosion resistance [109]. The cell boundary offers nucleation sites for the passive film, thus accelerating film formation [104, 110, 111]. Better corrosion resistance has been demonstrated due to the lower passive current density and wider passive potential range for LPBF stainless steel, suggesting that the cellular structure improves corrosion resistance [112-115].\nFig. 2 SEM images of different types of pores in LPBF 316L stainless steel: a , b spherical  pores  and c , d irregular-shaped/LOF pores [90]. (Adapted with permission from Ref. [90], copyright Elsevier 2022)\nHowever, not all published works agree that the cellular structure has a positive effect on the corrosion resistance. For instance, Snitzer et al. [116] found that the cellular structure has little effect on the intergranular corrosion in LPBF stainless steel. Liu et al. [117] mentioned that the cellular structure degrades the pitting corrosion resistance, as the boundary of the cellular cell offers the site for pit nucleation and increases the corrosion rate.",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "The rapid cooling rate in the LPBF manufacturing process led to non-uniform elongated grains perpendicular to the scanning direction, with a wide range of grain sizes, which is different from the regular polygonal grains with a narrow grain size range in traditional stainless steel. Manufacturing parameters such as the laser VED and scanning strategy impact the average grain size and subgrain structure [111, 118-120]. The laser power and scanning speed result in significant microstructural variations [121, 122]. The grain size contributes to corrosion performance in two ways. First of all, sub-grain boundaries in LPBF stainless steel can lead to intergranular corrosion due to concentrated Mo and a high dislocation density [93, 110, 123, 124]. The planar defects from high energy and stored energy in the grain boundaries will reduce corrosion performance [125]. On the other hand, grain size critically affects the formation and growth of passive films, with the stability of the passive film in LPBF stainless steel increased with smaller grain sizes. A better passive film forms with grain refinement treatment in acidic media, as nano- or ultrafine grains reduce the diffusion path length of Cr to the sample surface [126-132].",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "In stainless steel, the hazardous level of corrosion depends on the density, composition, and size of MnS [133, 134]. The Cr-depleted region near MnS, and MnS with a lower Cr content reduces the pit nucleation resistance [133, 135, 136]. Once the formation of pit is initiated, ionic sulfur species (S,   S -,   HS -, and   S2O3 -) from the dissolution of MnS stabilize pit growth [118]. If the oxygen level in the powder and printing environment is not well controlled, many tiny oxide inclusions (~ 100 nm) will be generated [137, 138]. The oxygen concentration in stainless steel powder increased after reuse for 16 cycles, thereby degrading the mechanical strength and corrosion resistance in the LPBF parts [139]. Figure 3 presents a comparison of the inclusions in wrought (Fig. 3a) and LPBF (Fig. 3b) stainless steels. The inclusions in wrought and LPBF stainless steels had similar elemental compositions and were enriched in Si, Al, Mn, and O. Whereas, the diameter of the inclusions in the wrought component was larger than that in the counterpart produced\nby LPBF [140]. Nano-scale (5-200 nm) inclusions in the LPBF components and micro-scale (2-4 μm) inclusions in wrought stainless steel were also observed in other studies [124, 141-143]. The size of the MnS particles depends on the cooling rate; therefore, the MnS particles in LPBF stainless steel are small [144, 145]. Thus far, the effect of nanoscale MnS on pitting corrosion in LPBF stainless steel remains unclear [88, 91, 93, 142].",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "Table 1 illustrates the phase ratios of various DSS grades produced using traditional methods with different heat treatment conditions. The heat treatment duration ranged from 30 to 60 min, and the austenite to ferrite ratio is nearly 50:50 after heat treatment at around 1060 ℃ for all DSS grades, despite  differences  in  lean,  standard,  super,  and  hyper DSS. Typically, electron backscatter diffraction (EBSD), X-ray diffraction (XRD), and optical microscopy (OM) are employed to measure the austenite to ferrite ratio. The discrepancies in phase ratios determined by these different methods were minimal.\nCurrently, DSS 2205, SDSS 2507, and HDSS 2707 have been successfully manufactured by LPBF. By using the following two equations for the PREN (wt%Cr + 3.3 × wt%M o + 16 × wt%N) and critical pitting temperature (CPT ( ℃ ) = (2.5 × wt%Cr) + (7.6 × wt%Mo) + (31.9 × wt%N) - 41 [146]. The PREN and CPT of LPBF DSS were determined to be >  38 and 45 ℃ , respectively, indicating good corrosion resistance. The final microstructure of LPBF stainless steel relies on the composition of starting powders and printing parameters [147-150]. One of the current challenges is the absence of a specific DSS powder for LPBF manufacturing, as all LPBF powders are derived from the gas atomization of wrought DSS. The extremely high temperature and rapid cooling rate during the LPBF manufacturing process result in LPBF DSS products with predominant ferrite and minimal austenite. The ratio of ferrite and austenite in the as-built LPBF DSS is similar to conventional DSS 2205 after heat treatment at 1300 ℃ , as DSS 2205 achieved full ferritization at this temperature, which the volume fraction of ferrite was over 80% [15]. Therefore, post-heat treatment is essential for LPBF DSS to get a balanced ratio of ferrite and austenite [22, 151-155].\nHeat treatment to LPBF stainless steel not only influence the phase ratio of austenite and ferrite, it also changes the corrosion performance [46, 156]. For instance, in LPBF austenitic stainless steel, heat treatment at temperatures below 1000 ℃ increases the corrosion resistance due to the movement of the dislocation wall to sub-grain boundaries while maintaining the sub-grain boundaries [113, 157, 158]. Then, post-heat treatment over 1000 ℃ reduces the corrosion resistance due to the removal of the sub-grain boundaries,\nFig. 3 EDX mapping of inclusions in a wrought stainless steel and b LPBF stainless steel [96, 140]. ( a adapted with permission from Ref. [96], copyright Elsevier 2022; b adapted with permission from Ref. [140], copyright Elsevier 2022)\nwhich play an essential role in nucleation and growth of the passive film [106, 109, 159, 160]. Also, unsuitable heat treatments result in larger MnS sizes, lower low-angle grain boundary densities, larger Cr-depletion regions, higher segregation, and more re-precipitation, reducing the corrosion resistance of LPBF stainless steel [161-164].",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "Table 2 summarizes the ratio of the ferrite and austenite phases in the as-built and heat-treated LPBF-DSS. The austenite content in the as-built LPBF DSS determined by EBSD is less than 2%. The heating temperature should be carefully chosen for LPBF DSS, the special microstructure makes it easier to form secondary phases, which can compromise the corrosion and mechanical properties [165-169]. For example, sigma and chi phases in heat-treated LPBF SDSS 2507 and HDSS 2707 [152, 170, 171] was measured. Under the same heat treatment conditions, no harmful phases were nucleated in conventional DSS.\nHot isostatic pressing (HIP) may offer an option for the post-treatment of LPBF DSS. The high temperature can balance the ratio of the two phases, while high pressure\n\nTable 1 Summary of the phase ratio of austenite and ferrite for conventional DSS grades after heat treatment",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "2101, Heat treatment condition.Temperature ( ℃ ) = 1000. 2101, Heat treatment condition.Time (min) = 30. 2101, After heat treatment.Austenite (%) = 52. 2101, After heat treatment.Ferrite (%) = 48 a. 2101, References.References = [231]. , Heat treatment condition.Temperature ( ℃ ) = 1050. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 49. , After heat treatment.Ferrite (%) = 51. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1080. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 47. , After heat treatment.Ferrite (%) = 53. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1100. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 42. , After heat treatment.Ferrite (%) = 58. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1150. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 37. , After heat treatment.Ferrite (%) = 63. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1200. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 33. , After heat treatment.Ferrite (%) = 67. , References.References = . 22Cr, Heat treatment condition.Temperature ( ℃ ) = 1200. 22Cr, Heat treatment condition.Time (min) = 4320. 22Cr, After heat treatment.Austenite (%) = 42. 22Cr, After heat treatment.Ferrite (%) = 58 b. 22Cr, References.References = [19]. 2304, Heat treatment condition.Temperature ( ℃ ) = 1030. 2304, Heat treatment condition.Time (min) = 60. 2304, After heat treatment.Austenite (%) = 55. 2304, After heat treatment.Ferrite (%) = 45 a. 2304, References.References = [231]. , Heat treatment condition.Temperature ( ℃ ) = 1050. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 53. , After heat treatment.Ferrite (%) = 47. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1080. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 51. , After heat treatment.Ferrite (%) = 49. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1100. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 49. , After heat treatment.Ferrite (%) = 51. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1150. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 47. , After heat treatment.Ferrite (%) = 53. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1180. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 42. , After heat treatment.Ferrite (%) = 58. , References.References = . , Heat treatment condition.Temperature ( ℃ ) =",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "1200. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 37. , After heat treatment.Ferrite (%) = 63. , References.References = . 25Cr, Heat treatment condition.Temperature ( ℃ ) = 1020. 25Cr, Heat treatment condition.Time (min) = 120. 25Cr, After heat treatment.Austenite (%) = 53. 25Cr, After heat treatment.Ferrite (%) = 47 a. 25Cr, References.References = [244]. , Heat treatment condition.Temperature ( ℃ ) = 1060. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 49. , After heat treatment.Ferrite (%) = 51. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1100. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 40. , After heat treatment.Ferrite (%) = 60. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1140. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 36. , After heat treatment.Ferrite (%) = 64. , References.References = . 2205, Heat treatment condition.Temperature ( ℃ ) = 1050. 2205, Heat treatment condition.Time (min) = 45. 2205, After heat treatment.Austenite (%) = 53. 2205, After heat treatment.Ferrite (%) = 47 a. 2205, References.References = [245]. , Heat treatment condition.Temperature ( ℃ ) = 1150. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 48. , After heat treatment.Ferrite (%) = 52. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1250. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 31. , After heat treatment.Ferrite (%) = 69. , References.References = . 2205, Heat treatment condition.Temperature ( ℃ ) = 1000. 2205, Heat treatment condition.Time (min) = 60. 2205, After heat treatment.Austenite (%) = 46. 2205, After heat treatment.Ferrite (%) = 54 b. 2205, References.References = [15]. , Heat treatment condition.Temperature ( ℃ ) = 1150. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 40. , After heat treatment.Ferrite (%) = 60. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1250. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 25. , After heat treatment.Ferrite (%) = 75. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1300. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 20. , After heat treatment.Ferrite (%) = 80. , References.References = . 2205, Heat treatment condition.Temperature ( ℃ ) = 1050. 2205, Heat treatment condition.Time (min) = . 2205, After heat treatment.Austenite (%) = 50. 2205, After heat treatment.Ferrite (%) = 50. 2205, References.References = [246]. 2507, Heat treatment condition.Temperature",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "( ℃ ) = 1030. 2507, Heat treatment condition.Time (min) = 120. 2507, After heat treatment.Austenite (%) = 56. 2507, After heat treatment.Ferrite (%) = 44 a. 2507, References.References = [151]. , Heat treatment condition.Temperature ( ℃ ) = 1050. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 53. , After heat treatment.Ferrite (%) = 47. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1080. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 51. , After heat treatment.Ferrite (%) = 49. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1100. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 52. , After heat treatment.Ferrite (%) = 48. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1150. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 55. , After heat treatment.Ferrite (%) = 45. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1180. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 57. , After heat treatment.Ferrite (%) = 43. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1200. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 62. , After heat treatment.Ferrite (%) = 38. , References.References = . 2707, Heat treatment condition.Temperature ( ℃ ) = 1020. 2707, Heat treatment condition.Time (min) = -. 2707, After heat treatment.Austenite (%) = 55. 2707, After heat treatment.Ferrite (%) = 34. 2707, References.References = [22]. , Heat treatment condition.Temperature ( ℃ ) = 1050. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 53. , After heat treatment.Ferrite (%) = 41. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1080. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 52. , After heat treatment.Ferrite (%) = 48. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1100. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 51. , After heat treatment.Ferrite (%) = 49. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1150. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 47. , After heat treatment.Ferrite (%) = 53. , References.References = . , Heat treatment condition.Temperature ( ℃ ) = 1200. , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 45. , After heat treatment.Ferrite (%) = 55. , References.References = \na Determined using OM\nb Determined using EBSD",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "can reduce pore size and porosity [172]. In LPBF DSS, HIP increases the overall austenite content, however, it also reduces the fine austenite inside the ferrite and causes coarsening of the austenite at the boundaries. Following HIP (1150 ℃ ,  110 MPa, and 3 h) + solution annealing (1050 ℃ for 3 h), the densification of LPBF DSS 2205 increased from 99.6 to 99.97%, indicating an improvement\nin both porosity and phase ratio in LPBF DSS 2205 due to HIP [173]. The density of LPBF SDSS 2507 after HIP was 0.39% higher than that of the as-built material, with a balanced ratio of austenite and ferrite [173]. However, the coarsening of the grain after the HIP process is an issue that needs to be considered.\n\nTable 2 Summary of the phase ratio of austenite and ferrite for different LPBF DSSs in the as-built and heat-treated samples from literature",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "22Cr, Before heat treatment.Austenite (%) = 1. 22Cr, Before heat treatment.Ferrite = 99% a. 22Cr, Heat treatment condition.Temperature ( ℃ ) = 1100. 22Cr, Heat treatment condition.Time (min) = 5. 22Cr, After heat treatment.Austenite (%) = 45. 22Cr, After heat treatment.Ferrite = 55%. 22Cr, References.References = [211]. 25Cr, Before heat treatment.Austenite (%) = 2. 25Cr, Before heat treatment.Ferrite = 98% a. 25Cr, Heat treatment condition.Temperature ( ℃ ) = 1170. 25Cr, Heat treatment condition.Time (min) = 5. 25Cr, After heat treatment.Austenite (%) = 52. 25Cr, After heat treatment.Ferrite = 48%. 25Cr, References.References = . 2205, Before heat treatment.Austenite (%) = 1. 2205, Before heat treatment.Ferrite = 99% a. 2205, Heat treatment condition.Temperature ( ℃ ) = 900. 2205, Heat treatment condition.Time (min) = 5. 2205, After heat treatment.Austenite (%) = 24. 2205, After heat treatment.Ferrite = 76%. 2205, References.References = [154]. , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 950. , Heat treatment condition.Time (min) = 5. , After heat treatment.Austenite (%) = 31. , After heat treatment.Ferrite = 69%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1000. , Heat treatment condition.Time (min) = 5. , After heat treatment.Austenite (%) = 34. , After heat treatment.Ferrite = 66%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1050. , Heat treatment condition.Time (min) = 5. , After heat treatment.Austenite (%) = 27. , After heat treatment.Ferrite = 73%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1100. , Heat treatment condition.Time (min) = 5. , After heat treatment.Austenite (%) = 26. , After heat treatment.Ferrite = 74%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1150. , Heat treatment condition.Time (min) = 5. , After heat treatment.Austenite (%) = 26. , After heat treatment.Ferrite = 74%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1200. , Heat treatment condition.Time (min) = 5. , After heat treatment.Austenite (%) = 21. , After heat treatment.Ferrite = 79%. , References.References = . 2205, Before heat treatment.Austenite (%) = . 2205, Before heat treatment.Ferrite = . 2205, Heat treatment condition.Temperature ( ℃ )",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "= 1050. 2205, Heat treatment condition.Time (min) = 180. 2205, After heat treatment.Austenite (%) = 39. 2205, After heat treatment.Ferrite = 61% b. 2205, References.References = [173]. 2205, Before heat treatment.Austenite (%) = 1. 2205, Before heat treatment.Ferrite = 99%. 2205, Heat treatment condition.Temperature ( ℃ ) = 1080. 2205, Heat treatment condition.Time (min) = 60. 2205, After heat treatment.Austenite (%) = 40. 2205, After heat treatment.Ferrite = 60%. 2205, References.References = [247]. 2205, Before heat treatment.Austenite (%) = . 2205, Before heat treatment.Ferrite = . 2205, Heat treatment condition.Temperature ( ℃ ) = 1100. 2205, Heat treatment condition.Time (min) = 5. 2205, After heat treatment.Austenite (%) = 56. 2205, After heat treatment.Ferrite = 44%. 2205, References.References = [248]. 2507, Before heat treatment.Austenite (%) = . 2507, Before heat treatment.Ferrite = . 2507, Heat treatment condition.Temperature ( ℃ ) = 1050. 2507, Heat treatment condition.Time (min) = 180. 2507, After heat treatment.Austenite (%) = 43. 2507, After heat treatment.Ferrite = 57%. 2507, References.References = . 2205, Before heat treatment.Austenite (%) = . 2205, Before heat treatment.Ferrite = Predominantly. 2205, Heat treatment condition.Temperature ( ℃ ) = 1100. 2205, Heat treatment condition.Time (min) = 60. 2205, After heat treatment.Austenite (%) = 43. 2205, After heat treatment.Ferrite = 57% b. 2205, References.References = [192]. 2507, Before heat treatment.Austenite (%) = 1. 2507, Before heat treatment.Ferrite = 99% a. 2507, Heat treatment condition.Temperature ( ℃ ) = 1100. 2507, Heat treatment condition.Time (min) = 60. 2507, After heat treatment.Austenite (%) = 48. 2507, After heat treatment.Ferrite = 52%. 2507, References.References = [249]. 2205, Before heat treatment.Austenite (%) = 2. 2205, Before heat treatment.Ferrite = 98% a. 2205, Heat treatment condition.Temperature ( ℃ ) = 1000. 2205, Heat treatment condition.Time (min) = 10. 2205, After heat treatment.Austenite (%) = 45. 2205, After heat treatment.Ferrite = 55%. 2205, References.References = [180]. 2205, Before heat treatment.Austenite (%) = 1. 2205, Before heat treatment.Ferrite = 99% a. 2205, Heat treatment condition.Temperature ( ℃ ) = 950. 2205, Heat treatment condition.Time (min) = 5. 2205, After heat treatment.Austenite (%) = 40. 2205, After heat treatment.Ferrite = 60%. 2205, References.References = [174]. , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1000. , Heat treatment condition.Time (min) = 50. , After heat treatment.Austenite (%) = 43. ,",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "After heat treatment.Ferrite = 57%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1000. , Heat treatment condition.Time (min) = 60. , After heat treatment.Austenite (%) = 46. , After heat treatment.Ferrite = 54%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1050. , Heat treatment condition.Time (min) = 5. , After heat treatment.Austenite (%) = 43. , After heat treatment.Ferrite = 57%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1050. , Heat treatment condition.Time (min) = 60. , After heat treatment.Austenite (%) = 45. , After heat treatment.Ferrite = 55%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1100. , Heat treatment condition.Time (min) = 50. , After heat treatment.Austenite (%) = 43. , After heat treatment.Ferrite = 57%. , References.References = . 2507, Before heat treatment.Austenite (%) = 2. 2507, Before heat treatment.Ferrite = 98% b. 2507, Heat treatment condition.Temperature ( ℃ ) = . 2507, Heat treatment condition.Time (min) = . 2507, After heat treatment.Austenite (%) = . 2507, After heat treatment.Ferrite = . 2507, References.References = [170]. 2507, Before heat treatment.Austenite (%) = 1. 2507, Before heat treatment.Ferrite = 99% a. 2507, Heat treatment condition.Temperature ( ℃ ) = 1100. 2507, Heat treatment condition.Time (min) = . 2507, After heat treatment.Austenite (%) = 48. 2507, After heat treatment.Ferrite = 52. 2507, References.References = . 2507, Before heat treatment.Austenite (%) = . 2507, Before heat treatment.Ferrite = Predominantly. 2507, Heat treatment condition.Temperature ( ℃ ) = 1200. 2507, Heat treatment condition.Time (min) = 5. 2507, After heat treatment.Austenite (%) = 71. 2507, After heat treatment.Ferrite = 13% (+16% sigma and Chi). 2507, References.References = [152]. 2507, Before heat treatment.Austenite (%) = 11-1. 2507, Before heat treatment.Ferrite = 89-99% b. 2507, Heat treatment condition.Temperature ( ℃ ) = . 2507, Heat treatment condition.Time (min) = . 2507, After heat treatment.Austenite (%) = . 2507, After heat treatment.Ferrite = . 2507, References.References = [250]. 2507, Before heat treatment.Austenite (%) = 11-1. 2507, Before heat treatment.Ferrite = 89-99% b. 2507, Heat treatment condition.Temperature ( ℃ ) = 1150. 2507, Heat treatment condition.Time (min) = 120. 2507, After heat treatment.Austenite (%) = 20-11.",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "2507, After heat treatment.Ferrite = 80-89%. 2507, References.References = [251]. , Before heat treatment.Austenite (%) = 12-1. , Before heat treatment.Ferrite = 88-99% c. , Heat treatment condition.Temperature ( ℃ ) = . , Heat treatment condition.Time (min) = . , After heat treatment.Austenite (%) = 24-11. , After heat treatment.Ferrite = 76-88%. , References.References = . 2507, Before heat treatment.Austenite (%) = . 2507, Before heat treatment.Ferrite = predominantly. 2507, Heat treatment condition.Temperature ( ℃ ) = 1040. 2507, Heat treatment condition.Time (min) = 60. 2507, After heat treatment.Austenite (%) = 55. 2507, After heat treatment.Ferrite = 45% a. 2507, References.References = [153]. 2707, Before heat treatment.Austenite (%) = 1. 2707, Before heat treatment.Ferrite = 99% a. 2707, Heat treatment condition.Temperature ( ℃ ) = 1050. 2707, Heat treatment condition.Time (min) = 60. 2707, After heat treatment.Austenite (%) = 88. 2707, After heat treatment.Ferrite = 2% (+10% sigma). 2707, References.References = [171, 252]. , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1100. , Heat treatment condition.Time (min) = 60. , After heat treatment.Austenite (%) = 60. , After heat treatment.Ferrite = 40%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1150. , Heat treatment condition.Time (min) = 60. , After heat treatment.Austenite (%) = 61. , After heat treatment.Ferrite = 39%. , References.References = . , Before heat treatment.Austenite (%) = . , Before heat treatment.Ferrite = . , Heat treatment condition.Temperature ( ℃ ) = 1250. , Heat treatment condition.Time (min) = 60. , After heat treatment.Austenite (%) = 63. , After heat treatment.Ferrite = 37%. , References.References = \na Determined using OM\nb Determined using EBSD",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "The optimized heat treatment conditions are similar for all types of traditional DSS, whereas the best temperature for LPBF DSS varies. In Table 1, the optimized heat treatment temperature for all wrought DSS grades is around 1060 ℃ , whereas, for LPBF DSS, the optimized temperature varied, even for the same grade DSS. For LPBF DSS 2205, after heat-treated at 1050 ℃ , the austenite/ferrite ratio was 39:61 after 3 h of exposure [173], and in some studies, it was found that the phase ratio was 45:55 after 1 h of soaking [174]. Under the same heat-treatment conditions, the concentration of austenite in LPBF DSS was lower than that in traditional DSS [154, 173]. The most effective heat treatment to reach the balanced austenite and ferrite phase for LPBF DSS varies, even for the same grade of LPBF DSS, due to the special microstructure controlled by both powder and manufacturing conditions. The high energy storage and ferrite composition in LPBF DSS influence austenite formation during heat treatment. For example, a high dislocation density is the driving force for recrystallization, resulting in the formation of new grains that retard austenite nucleation [154, 170, 173, 175]. In LPBF DSS, the composition between ferrite and austenite is similar. However, in conventional DSS, the composition between ferrite and austenite varies, with ferrite having higher Cr and Mo, and austenite having more Ni\nand N [176]. Similar compositions of ferrite and austenite were only found in wrought DSS after high-temperature heat treatment (> 1300 ℃ ) and rapid cooling (water quenching) [15]. For these reasons, researchers did not find an optimal temperature in the range of 950-1200 ℃ for all LPBF DSS [154, 177]. Additionally, the high energy storage and special ferrite composition may also explain why harmful precipitates are easily formed on LPBF DSS after heat treatment.\nThe composition of LPBF DSS powder is displayed in Table 3. However, the composition of DSS powder of the same grade varies, and this variation has an impact on pitting corrosion. For instance, the addition of Cr promotes the formation of a protective film and enhances the repassivation abilities of the passive film [178]. The addition of N improves the pitting corrosion performance by reducing the chromium depletion area (improving the pit nucleation parameter) and forming   NH 4 + (reducing the pit growth rate) [179]. Furthermore, increasing Mo and Ni also significantly improves pitting performance by increasing the pitting corrosion potential and reducing the pit growth kinetics [100].",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "Figure 4 illustrates the inverse pole figure (IPF) with the EBSD images of LPBF DSS 2205 in both the as-built (Fig. 4a, b) and heat-treated (Fig. 4c, d) materials. The texture of LPBF DSS is dependent on the scanning direction between each layer [173, 180]. In the as-built LPBF DSS 2205, the phase ratio of ferrite to austenite was 98:2, with the austenite phase limited to the ferrite-ferrite grain boundaries, similar to the austenite phase formed in the welded DSS [181]. Additionally, a rod-like   Cr 2 N precipitate with dimensions of 100 nm × 20 nm was detected at the ferrite/ ferrite interface. After heat treatment, the ratio of ferrite to austenite changed to 45:55, and the austenite nucleated within and at the ferrite-ferrite grain boundaries [180]. The\nTable 3 Summary of Composition of LPBF DSS powder\naustenite was aligned in the favoured orientation, while the ferrite texture was maintained after heat treatment [173].\nTo address the issues with post heat treatment of LPBF DSS, a strategy involving mixed powder is utilized. This strategy involves combining DSS powder with a strong austenite-stabilizing powder, such as Ni metal, Ni alloys, or austenitic stainless steel. By using this raw powder combination, the percentage of austenite in the as-built LPBF DSS is increased. Several studies have demonstrated the effectiveness of this approach. Gargalis et al. [182] selected 316L stainless steel as the austenitic stabilizer powder, resulting in an austenitic phase of 22% in the as-built LPBF 22Cr DSS and 5% for as-built LPBF 25Cr DSS. Cui et al. [183] achieved a phase balanced as-build DSS by using a mixed powder of 316L (55%) austenitic stainless steel and 2205 (45%) duplex stainless steel. Kohler et al. [184] also utilized a mixture powder of 2205 duplex and 316L austenitic stainless steel as the LPBF powder with different ratios, leading to an increase in austenite in the as-built LPBF. However, it is worth noting that the pitting corrosion resistance of the mixed LPBF DSS (70% 316L + 30% 2205) is lower than that of wrought DSS 2205, with E pit  for the mixed LPBF DSS being + 0.7   V SCE . In the study by Li et al. [185], a combination of DSS 2205 and 6% pure Ni was compared with a combination of DSS 2205 and 13% Ni-based Inconel 625 alloys. Both mixed powders resulted in a balanced ferrite and austenite in the as-built LPBF DSS, with high densification (> 99.9%). EBSD images of the two mixed powder LPBF DSS samples are shown in Fig. 5, revealing uniformly distributed austenite with particle sizes of 50-300 μm in the matrix. The ferrite-to-austenite phase ratios for LPBF 22Cr-6Ni DSS and LPBF DSS 22Cr-13INC625 were 55:45 and 54:46, respectively. The average melt pool diameters",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "22Cr, Cr = 22.5. 22Cr, Ni = 5.5. 22Cr, Mo = 3.5. 22Cr, C = 0.03. 22Cr, Si = 1.0. 22Cr, Mn = 2.1. 22Cr, P = 0.03. 22Cr, S = 0.02. 22Cr, N = 0.2. 22Cr, References = [211]. 25Cr, Cr = 25.7. 25Cr, Ni = 7.3. 25Cr, Mo = 4.4. 25Cr, C = 0.03. 25Cr, Si = 1.1. 25Cr, Mn = 2.3. 25Cr, P = 0.03. 25Cr, S = 0.02. 25Cr, N = 0.3. 25Cr, References = . 2205, Cr = 22.8. 2205, Ni = 5.5. 2205, Mo = 2.8. 2205, C = 0.02. 2205, Si = 0.4. 2205, Mn = 1.6. 2205, P = 0.02. 2205, S = -. 2205, N = 0.2. 2205, References = [154]. 2205, Cr = 23.0. 2205, Ni = 5.7. 2205, Mo = 3.2. 2205, C = 0.02. 2205, Si = 0.7. 2205, Mn = 0.8. 2205, P = -. 2205, S = -. 2205, N = 0.1. 2205, References = [173]. 2507, Cr = 26.2. 2507, Ni = 6.7. 2507, Mo = 3.1. 2507, C = 0.02. 2507, Si = 0.5. 2507, Mn = 0.5. 2507, P = -. 2507, S = -. 2507, N = 0.3. 2507, References = . 2205, Cr = 21.3. 2205, Ni = 5. 2205, Mo = 2.5. 2205, C = 0.02. 2205, Si = 0.7. 2205, Mn = 1.1. 2205, P = 0.01. 2205, S = 0.01. 2205, N = 0.2. 2205, References = [247]. 2205, Cr = 22.6. 2205, Ni = 5.8. 2205, Mo = 3.2. 2205, C = 0.02. 2205, Si = 0.6. 2205, Mn = 1.1. 2205, P = 0.02. 2205, S = 0.01. 2205, N = 0.2. 2205, References = [248]. 2205, Cr = 22.2. 2205, Ni = 5.4. 2205, Mo = 3.0. 2205, C = 0.02. 2205, Si = 0.7. 2205, Mn = 1.1. 2205, P = 0.02. 2205, S = -. 2205, N = 0.2. 2205, References = [192]. 2507, Cr = 25.6. 2507, Ni = 6.5. 2507, Mo = 3.8. 2507, C = 0.01. 2507, Si = 0.4. 2507, Mn = 0.4. 2507, P = 0.02. 2507, S = -. 2507, N = -. 2507, References = [249]. 2205, Cr =",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "23.2. 2205, Ni = 5.6. 2205, Mo = 2.9. 2205, C = 0.04. 2205, Si = 0.3. 2205, Mn = 1.0. 2205, P = 0.01. 2205, S = -. 2205, N = 0.2. 2205, References = [180]. 2507, Cr = 25.0. 2507, Ni = 7.0. 2507, Mo = -. 2507, C = 0.03. 2507, Si = 0.8. 2507, Mn = 1.2. 2507, P = -. 2507, S = -. 2507, N = 0.3. 2507, References = [170]. 2507, Cr = 25.0. 2507, Ni = 7.0. 2507, Mo = 4.0. 2507, C = 0.03. 2507, Si = 0.8. 2507, Mn = 1.2. 2507, P = -. 2507, S = -. 2507, N = 0.3. 2507, References = [152]. 2507, Cr = 25.0. 2507, Ni = 7.0. 2507, Mo = 4.0. 2507, C = 0.03. 2507, Si = 0.4. 2507, Mn = 0.9. 2507, P = 0.04. 2507, S = 0.03. 2507, N = -. 2507, References = [250]. 2507, Cr = 25.0. 2507, Ni = 7.0. 2507, Mo = 4.0. 2507, C = 0.03. 2507, Si = 0.4. 2507, Mn = 0.9. 2507, P = 0.04. 2507, S = 0.03. 2507, N = -. 2507, References = [251]. 2507, Cr = 24.6. 2507, Ni = 6.9. 2507, Mo = 3.9. 2507, C = 0.02. 2507, Si = 0.5. 2507, Mn = 0.9. 2507, P = 0.01. 2507, S = 0.01. 2507, N = 0.3. 2507, References = [153]. 2707, Cr = 27.2. 2707, Ni = 6.5. 2707, Mo = 5.0. 2707, C = 0.02. 2707, Si = 0.6. 2707, Mn = 1.5. 2707, P = -. 2707, S = -. 2707, N = 0.4. 2707, References = [171, 252]\nFig. 4 a Grain orientation IPF and b phase EBSD maps for as-built LPBF DSS 2205, indicating grain orientation IPF c and phase EBSD d after heat-treatment at 1000 °C for 10 min followed by water quenching [180]. (Adapted with permission from Ref. [180], copyright Elsevier 2022)",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "in  LPBF  DSS  22Cr-6Ni  and  22Cr-13IN625  were  160 and 200 μm, respectively. Potentio-dynamic polarization curves of the as-built LPBF DSS 22Cr-6Ni and DSS 22Cr13INC625 were obtained using 0.6 M NaCl and compared to those of wrought DSS 22Cr and LPBF DSS 22Cr heattreated at 1100 ℃ for 15 min. The E corr , i corr , and E b values of wrought, as-built LPBF DSS 22Cr-6Ni, as-built LPBF DSS 22Cr-13INC625, and heat-treated LPBF 22Cr DSS were similar. Metastable pits were found on LPBF DSS 22Cr6Ni, potentially due to the lower corrosion resistance of the austenite phase. Increasing the concentration of Ni in the austenite phase from 10% (LPBF DSS 22Cr-6Ni) to 15% (LPBF 22Cr-13INC625) eliminated the detection of metastable pits. The reverse scan intercepted the forward polarization curve below E corr for LPBF DSS 22Cr-6Ni, indicating poor repassivation.\nThe LPBF manufacturing techniques can be used to control the ratio of austenite and ferrite in LPBF DSS. Li et al. [186] selected a base LPBF powder comprised of 93% DSS and 7% Ni, and adjusted the ferrite content by using different laser powders. As the laser power was increased from 150 to 350 W, the ferrite phase in LPBF DSS transitioned from 7.6\nto 66.5%. Additionally, Li et al. [187] enveloped a printing powder with 94% DSS and 6% Ni, and modified the ferrite concentration through the laser remelting process. Initially, the LPBF DSS achieved a 50% ferrite content without the remelting process. Subsequently, with each remelting process, the austenite phase increased, eventually leading the LPBF DSS to become entirely austenite after 6 remelting cycles. Both higher laser power and the remelting process facilitated the diffusion of Ni elements into the LPBF DSS, altering the   Cr eq and   Ni eq ratio in the LPBF DSS, thus resulting in a higher proportion of the austenite phase [188-191].\nThe  distributions  of  austenite/ferrite  in  LPBF  and wrought DSS differ. In hot-rolled DSS, elongated and islandshaped austenite was observed in a continuous ferrite matrix [192]. On the other hand, three types of austenite phases were observed in the heat-treated LPBF DSS: intragranular austenite, Widmanstatten austenite, and intergranular epitaxial austenite. Intragranular austenite was uniformly distributed on the heat-treated LPBF DSS and nucleated from dislocations, low-angle subgrain boundaries, and oxide particles. The formation of intragranular austenite is associated with the nucleated   Cr 2 N precipitates [193, 194].\n103\nFig. 5 EBSD images of LPBF DSS produced from mixed powders a 22Cr + 6Ni and b 22Cr + 13INC625 with related potentio-dynamic polarization [185]. (Adapted with permission from Ref. [185], copyright Elsevier 2022)",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "The small intragranular austenite exhibited random orientations. Whereas, the coarse intragranular austenite adopted an approximate Kurdjumov-Sachs orientation [195-197]. The Widmanstatten austenite nucleated at intergranular austenite sites and grew parallel to the overlapping zone of the melting pool [198-200]. Intergranular austenite was located along the grain boundaries of the ferrite grains in LPBF DSS. The volume of intergranular austenite increased with increasing energy input and/or decreasing cooling rates in LPBF DSS [201, 202]. The formation of intergranular austenite reduces the corrosion resistance by creating a chromium depletion region [203]. The size/shape of austenite and ferrite play important roles in pitting growth kinetics, where LDSS 2101 can have a slower pit growth rate than DSS 2205 with a reasonable distribution of austenite and ferrite [15, 204, 205].",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "The protective layer on DSS plays a crucial role in its resistance to corrosion [206]. However, the presence of two phases in DSS complicates the passivation process due to the galvanic coupling between austenite and ferrite. In wrought DSS, the effect of galvanic current on passivation is a topic of debate. Some studies have suggested that galvanic current enhances passivation properties by providing a shorter path for the transfer of passive cations between ferrite and austenite, thereby influencing the chemical composition (Cr, Ni, and Mo) and modifying the semiconductive properties (lower oxygen vacancy transfer rate and lower defect density) of the protective layer [207, 208]. However, others argue that galvanic current density has a negative impact\non corrosion resistance. Cao and colleagues [209] observed that the height difference between the austenite and ferrite increased from 6.5 to 8.5 μm after the galvanic current was enhanced by 25 μA. Ha et al. [210] indicated that galvanic current and E pit can be controlled through different heat treatments, with the highest E pit being determined when the galvanic current density reaches the minimum. However, in high-quality LPBF DSS, it seems that galvanic coupling does not influence the passivation ability. The electrochemical responses of as-built LPBF, heat-treated LPBF, and wrought DSS were similar in terms of E corr and I corr . Furthermore, Murkute et al. [97] claimed that heat treatment slightly increases the passivation ability of LPBF DSS, however, the quality of LPBF DSS is lower than that of conventional DSS. Table 4 summarizes the electrochemical behavior of LPBF DSS, illustrating the similarities in the E corr , I corr , and R ct of the DSS materials (as-built LPBF, heat-treated LPBF, and wrought).\nFigure 6 presents a comparison of the polarization properties of the single and dual phases in the conventional DSS. Single-phase DSS was manufactured by the selective dissolution of dual-phase DSS at different potentials in 2 mol/L H2SO4 + 0.5 mol/L HCl. The potentio-dynamic polarization curve shows that the passive potential range in the dualphase DSS is wider than that in the single-phase DSS with a lower passive current density. Both the passive potential range and current density indicate better passive performance in the dual DSS [207]. However, to analyze LPBF DSS, the potentio-dynamic polarization curves of as-built DSS 2205 and SDSS 2507 manufactured by the conventional and LPBF processes were compared. DSS 2205 and SDSS 2507 produced by LPBF had higher E corr , lower I corr ,\nTable 4 Summary of potentiodynamic polarisation response from LPBF DSS\nFig. 6 Potentio-dynamic polarization curves of single-phase (austenite and ferrite) and dual-phase DSS in 0.6 mol/L NaCl solution [207]. (Adapted with permission from Ref. [207], copyright Elsevier 2022)",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "and similar E trans values compared to the conventional counterparts. The lower passivation ability is attributed to the absence of a galvanic effect between the ferrite and austenite. After 5 min of heat treatment, the phase ratios of austenite to ferrite were 52:48 in LPBF DSS 2205 and 55:45 in LPBF SDSS 2507. The E corr , I corr , and E trans values of the heattreated LPBF and wrought samples were similar [211]. The EIS data for the as-built LPBF DSS, heat-treated (1100 ℃ and 1 h), and wrought DSS were also compared. The ratio of ferrite to austenite in the heat-treated LPBF DSS was 53:47. In these three DSS samples, the high charge transfer",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "22Cr-6Ni, Method = LPBF. 22Cr-6Ni, Condition = As-built. 22Cr-6Ni, I corr (μA/cm 2 ) = 0.126. 22Cr-6Ni, E corr (V SCE ) = -0.187. 22Cr-6Ni, R ct (kΩ cm 2 ) = . 22Cr-6Ni, References = [185]. 22Cr-13IN625, Method = LPBF. 22Cr-13IN625, Condition = As-built. 22Cr-13IN625, I corr (μA/cm 2 ) = 0.116. 22Cr-13IN625, E corr (V SCE ) = -0.116. 22Cr-13IN625, R ct (kΩ cm 2 ) = . 22Cr-13IN625, References = . 22Cr, Method = LPBF. 22Cr, Condition = Heat-treated. 22Cr, I corr (μA/cm 2 ) = 0.187. 22Cr, E corr (V SCE ) = -0.216. 22Cr, R ct (kΩ cm 2 ) = . 22Cr, References = . 22Cr, Method = Wrought. 22Cr, Condition = As-built. 22Cr, I corr (μA/cm 2 ) = 0.045. 22Cr, E corr (V SCE ) = -0.104. 22Cr, R ct (kΩ cm 2 ) = . 22Cr, References = . 22Cr, Method = LPBF. 22Cr, Condition = As-built. 22Cr, I corr (μA/cm 2 ) = 0.007. 22Cr, E corr (V SCE ) = 0.101. 22Cr, R ct (kΩ cm 2 ) = . 22Cr, References = [211]. 25Cr, Method = LPBF. 25Cr, Condition = As-built. 25Cr, I corr (μA/cm 2 ) = 0.013. 25Cr, E corr (V SCE ) = 0.095. 25Cr, R ct (kΩ cm 2 ) = . 25Cr, References = . 22Cr, Method = LPBF. 22Cr, Condition = Heat-treated. 22Cr, I corr (μA/cm 2 ) = 0.011. 22Cr, E corr (V SCE ) = -0.130. 22Cr, R ct (kΩ cm 2 ) = . 22Cr, References = . 25Cr, Method = LPBF. 25Cr, Condition = Heat-treated. 25Cr, I corr (μA/cm 2 ) = 0.045. 25Cr, E corr (V SCE ) = -0.128. 25Cr, R ct (kΩ cm 2 ) = . 25Cr, References = . 22Cr, Method = Wrought. 22Cr, Condition = As-built. 22Cr, I corr (μA/cm 2 ) = 0.045. 22Cr, E corr (V SCE ) = -0.104. 22Cr, R ct (kΩ cm 2 ) = . 22Cr, References = . 25Cr, Method = Wrought. 25Cr, Condition = As-built. 25Cr, I corr (μA/cm 2 ) = 0.062. 25Cr, E corr (V SCE ) = -0.144. 25Cr, R ct (kΩ cm 2 ) = . 25Cr, References = . 2205, Method = LPBF. 2205, Condition = As-built. 2205, I corr (μA/cm",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "2 ) = 0.24. 2205, E corr (V SCE ) = -0.22. 2205, R ct (kΩ cm 2 ) = . 2205, References = [212]. 2205, Method = Wrought. 2205, Condition = As-built. 2205, I corr (μA/cm 2 ) = 0.11. 2205, E corr (V SCE ) = -0.18. 2205, R ct (kΩ cm 2 ) = . 2205, References = . 2205, Method = LPBF. 2205, Condition = As-built. 2205, I corr (μA/cm 2 ) = 0.083. 2205, E corr (V SCE ) = -0.260. 2205, R ct (kΩ cm 2 ) = 560. 2205, References = [232]. 2205, Method = LPBF. 2205, Condition = As-built. 2205, I corr (μA/cm 2 ) = 0.065. 2205, E corr (V SCE ) = -0.248. 2205, R ct (kΩ cm 2 ) = 1170. 2205, References = . 2205, Method = LPBF. 2205, Condition = Heat-treated. 2205, I corr (μA/cm 2 ) = 0.062. 2205, E corr (V SCE ) = -0.241. 2205, R ct (kΩ cm 2 ) = 604. 2205, References = . 2205, Method = LPBF. 2205, Condition = Heat-treated. 2205, I corr (μA/cm 2 ) = 0.085. 2205, E corr (V SCE ) = -0.268. 2205, R ct (kΩ cm 2 ) = 638. 2205, References = . 2205, Method = Wrought. 2205, Condition = As-built. 2205, I corr (μA/cm 2 ) = 0.090. 2205, E corr (V SCE ) = -0.264. 2205, R ct (kΩ cm 2 ) = 709. 2205, References = \nresistance (> 500 kΩ   cm 2 ) indicates the progress of passivation; the similar impedance Bode plots and phase angle Bode plots indicate no visible difference in the passivation behavior. The passivation ability of LPBF DSS and SDSS did not improve the galvanic coupling. However, the single ferrite phase in the as-built LPBF stainless steel has lower ductility and machinability than dual-phase DSS [211-214].",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "Pitting corrosion is the rapid dissolution of metal from small surface areas in a halide ion environment [157, 215]. In traditional electrochemical tests, pitting corrosion cannot be nucleated on DSS 2205 at room temperature without the formation of harmful phases, such as σ phase, which will degrade both corrosion and mechanical properties [216-218]. Recently, high throughput manufacturing, testing, and analysis method become popular [219-221], a novel high throughput corrosion test method-bipolar electrochemistry, was used to test the pitting corrosion of different stainless steels at room temperature, including DSS 2205 and HDSS 2707 [222-228]. The relationship between ferrite/austenite  and  the  pitting  corrosion  resistance  of conventional DSSs has been widely researched. Austenite and ferrite with a similar PREN achieved the highest pitting corrosion resistance, where the ratio of ferrite to austenite was close to 1:1 [229, 230]. Figure 7a, c shows the evolution of austenite and ferrite in DSS 2205 and SDSS 2507 after heat treatment from 1000 to 1200 ℃ . The volume fraction of ferrite increased with higher heat-treatment temperatures, and the fraction of ferrite was the same as that of austenite after heat treatment at 1080 ℃ . Figure 7b, d shows the measured CPT of the entire DSS and the calculated PREN for ferrite and austenite. The PREN of austenite increased with higher exposure temperatures, whereas the PREN of ferrite decreased with higher soaking temperatures; different heat treatment temperatures had different effects on the redistribution of the elements. The CPT first increased, but then decreased at higher temperatures. Heat treatment at 1080 ℃ led to the highest CPT for austenite and ferrite with equal PREN [151, 231]. Thus, heat treatment at 1080 ℃ led to the highest CPT of conventional DSSs, with an equal volume and PREN for the two phases.\nFor  LPBF DSS, the relationship  between  the  phase ratio evolution and PREN of the two phases and the corresponding pitting corrosion resistance has not been studied.\nFig. 7 Relationship between a , c volume fraction, b , d PREN for austenite/ferrite, and CPT after different heat treatment of a , b DSS 2205 and c , d SDSS 2507 [151, 231]. (Fig. 8a, b adapted with permission from Ref. [231], copyright Elsevier 2022; Fig. 8c, d adapted with permission from Ref. [151], copyright Elsevier 2022)",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "However, some researchers have found that the corrosion resistance of heat-treated LPBF DSS with a balanced ratio of ferrite and austenite is similar to that of wrought DSS. Nigon et al. [232] found that the phase ratio in LPBF DSS changed from predominantly ferrite to a balanced phase ratio after heat treatment at 1100 ℃ for 1 h. The as-built LPBF, heat-treated LPBF, and wrought DSS had similar corrosion responses ( E corr and I corr ) in 0.6 mol/L NaCl solution at room temperature. However, metastable pits were obtained in LPBF DSS 2205, which may have been caused by pore and/ or chemical inhomogeneities. Post heat treatment at 1000 ℃ for 1 h improved the pitting resistance of LPBF DSS 2205, the increased resistance to pitting corrosion might be associated to the dissolution of   Cr 2 N [174]. The nucleation of pits from   Cr 2 N in LPBF DSS 2205 is mentioned by Haghdadi and co-workers [176]. In conventional DSS,   Cr 2 N led to nucleated pits is obtained in welded and heat-treated DSS [230, 233-236].\nFigure 8 shows the CPT of the as-built LPBF, heattreated LPBF, and hot-rolled DSS 2205 in 1 mol/L NaCl solution [176]. At the beginning stage, the current density remained below 0.1 mA/cm 2 ,  indicating no stable pits.  Some  of  the  current-density  fluctuations  measured at higher temperatures were due to metastable pits. Maintaining a current density of over 100 µA/cm 2 for 1 min indicates the formation of stable pits. The CPT of as-built LPBF DSS 2205 in 1 mol/L NaCl solution was 47 ℃ , which was lower than that of hot-rolled DSS 2205 (61 ℃ ),  due  to  the    Cr2N in LPBF DSS. After removing   Cr 2 N by heat treatment at 1000 ℃ for  10 min, the CPT of heat-treated LPBF DSS increased to 60 ℃ . However, the author did not prove the reason why the pitting\nFig. 8 CPT of as-built LPBF, heat-treated LPBF, and hot-rolled DSS specimens  in  1.0  mol/L  NaCl  solution.  (Adapted  with  permission from Ref. [176], copyright Elsevier 2022)\ncorrosion resistance enhance, which might be small   Cr 2N (nanoscale) nucleated the pitting corrosion is vanished or that the balanced phase ratio of ferrite and austenite dis reached.",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "The kinetics of pit growth differs for LPBF and conventional DSS due to the different sizes, ratios, and morphologies of the two phases in LPBF and conventional DSS. Figure 9a, b presents a comparison of the heat-treated LPBF DSS and conventional DSS. The phase volume fractions of ferrite and austenite were similar in these DSSs. However, the sizes and geometries of the two phases varied in the different DSSs. The average size of the intragranular austenite particles in the heat-treated LPBF was 2 µm. However, the average size of austenite in conventional DSS was 35 µm [176]. Figure 9c, d shows the pit morphology in welded DSS. Ferrite preferentially corrodes away from the retained austenite. The pit shapes are controlled by different phase morphologies in the fusion and heat-affected zones [14]. Therefore, the shapes of austenite and ferrite play a critical role in the kinetics of pitting corrosion. The kinetics of pit growth in DSS involve consuming one of the phases; therefore, the shape of the ferrite influences the direction of pit growth. The shape of austenite changes the porosity of the pit lacy cover, where both phases adjust the kinetics of pit growth [205, 237]. In Fig. 9e, f, the critical pitting potential and pit growth kinetics between LDSS 2101 and DSS 2205 tested by bipolar electrochemistry. The phase ratio/size/morphologies are adjusted by heat treatments, longer distance in the bipolar electrode (BPE) indicates lower critical pitting potential, and large pit volume on the BPE means faster pit growth kinetics. Figure 9e shows that LDSS 2101 has lower E pit than DSS 2205 in all heat treatment temperatures, which is  the  same  as  traditional  electrochemistry experiment, PREN and CPT. However, in Fig. 9f, the pitting volume in LDSS 2101 is lower than that in DSS 2205 before heat treatment temperature lower than 1300 ℃ , which is caused by the geometry of the austenite phase act as a barrier to prevent the pit expansion. So, the pit shape/geometry/size might not dramatically change the pit nucleation parameter, whereas, the pit growth kinetics can be largely reduced by reasonable design the distribution of austenite and ferrite [205]. It also found that, the environment factors, such as in the boiling water environment, it has dual opposite contributions to the pitting corrosion, which is increasing the frequency of pit nucleation, and reducing the stable pit propagation [238]. The higher concentration of   Cl -and temperature, also dramatically reduce the pitting nucleation parameter in SDSS 2507 [239].\nFigure 10a presents a comparison of E pit and E rep for DSS 2205 produced by hot-rolling, as-built LPBF, and LPBF heat-treated at 1000 ℃ for 10 min. Pitting corrosion originates from similar microstructural issues, resulting in similar E pit values at room temperature. The pitting and",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "Fig. 9 Phase of a heat-treated LPBF and b conventional DSS (red is ferrite and green is austenite) and c , d pit  morphology in conventional welded DSS (dark is ferrite and bright white is austenite), c shows pit in fusion zone and d shows a pit in the heat-affected zone [14, 176], e shows pit covered length and f shows pit volume loss on the BPE between LDSS 2101 and DSS 2205[205] (Fig. 9a, b adapted with permission from Ref. [176], copyright Elsevier 2022; Fig. 9c, d adapted with permission from Ref. [14], copyright Elsevier 2022; Fig. 9e, f adapted with permission from Ref. [205], copyright Elsevier 2023)\nrepassivation potentials of heat-treated LPBF DSS 2205 are similar to those of the hot-rolled counterparts, and the as-built LPBF DSS 2205 had the lowest repassivation potential. The difference in the repassivation potentials is caused by the higher Mo content (3.10% in the as-built\nLPBF DSS 2205 to 4.27% in the heat-treated LPBF DSS 2205) in the ferrite, which increases the repassivation ability [240-242]. Figure 10b-d shows the pit morphologies of the three DSSs. Shallow pits were observed in hot-rolled and heat-treated LPBF DSS 2205, indicating that the pits",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "Heat-treated LPBF\nFig. 10 a Average pitting and repassivation potentials determined from the CPP curves in 0.6 mol/L NaCl solution at room temperature and SEM images of pitting morphology in b hot-rolled, c as-built LPBF, and d heat-treated LPBE DSS [180]. (Adapted with permission from Ref. [180], copyright Elsevier 2022)\nwere easily repassivated [243]. The pit size of the heattreated LPBF DSS 2205 was larger than that of the hotrolled sample because of the difference in the pit growth kinetics. The pit lacy cover on the as-built LPBF DSS 2205 stabilized the pit growth [49, 237]. Here, the pitting corrosion resistance of the as-built LPBF, heat-treated LPBF, and hot-rolled DSS 2205 was similar; however, the kinetics of pitting corrosion and pit morphology were significantly different. Haghdadi et al. [176] mentioned that the pitting nucleation and growth mechanism for LPBF DSS changes after heat treatment because the pits nucleate at the austenite and ferrite phases and the pits grow by consuming austenite. The very little austenite in the as-built LPBF DSS reduced the pit nucleation sites and retarded pit growth in the growth direction.\nCompared to conventional DSS processing, LPBF offers significant advantages such as rapid manufacturing speed and geometric flexibility. The pores, cellular structure, grain size, and inclusions produced during the LPBF manufacturing process influence the corrosion performance of LPBF DSS. Additionally, the lack of specific composition powder for LPBF DSS results in an almost entirely ferrite phase in the as-built material, necessitating post-heat treatment to achieve the desired ferrite to austenite ratio. The composition of the powder and LPBF manufacturing parameters also impact the microstructures of LPBF DSS, making it challenging to find optimized heat treatment conditions without forming harmful precipitates. Through the use of a mixed powder strategy and increasing the austenite content in the as-built LPBF DSS, it may be possible to achieve balanced phase conditions without the need for post-heat treatment. However, the unique element distribution between austenite and ferrite, as well as the different geometry and shape of austenite in LPBF DSS compared to conventional DSS, present significant challenges. The distinct element distribution in ferrite and austenite influences the pitting nucleation parameter, and the geometry of the austenite/ferrite affects the pit growth kinetics. Limited research has been conducted on these aspects in LPBF DSS.",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    },
    {
        "content": "Some publications have introduced the microstructures and mechanical properties of LPBF DSS; however, only a few studies have tested the corrosion performance. The following aspects of LPBF DSS need to be addressed in future research:\n- 1. Design a special composition of the LPBF DSS powder, or find a suitable mixed powder, which can build a balanced ferrite-austenite phase in the as-built LPBF DSS.\n- 2. The parameters to manufacturing LPBF DSS with the lowest porosity and negligible nitrogen loss should be understand. Optimization of the post-heat treatment method used to balance the austenite and ferrite without forming harmful precipitates.\n- 3. The mechanisms of austenite formation of LPBF DSS during the LPBF manufacturing process should be researched. The contribution of special microstructure from LPBF process, such as ferrite composition and high dislocation density, to austenite transformation during post heat treatment should be studied.\n- 4. The effect of nanosized   Cr 2 N on the pitting corrosion of LPBF DSS. The effect of galvanic coupling between austenite and ferrite on the passivation and corrosion behavior of LPBF DSS. Analysis of the critical pore size and porosity that influence the corrosion resistance of LPBF DSS.\n- 5. Understanding more types of corrosion and the corresponding mechanisms in LPBF DSS, such as SCC, intergranular corrosion, and corrosion fatigue. Testing the corrosion performance of LPBF-DSS after a long exposure period.",
        "source": "10.1007/s40195-024-01679-z",
        "file_path": ""
    }
]